#include <ansi.h>

inherit NPC;

mixed ask_here();         //导航系统入口
mixed ask_ok();           //每次完成导师的任务后调用
mixed ask_zhiliao();      //给新手治疗
mixed ask_chucun();       //请求出村

void create()
{
        set_name(HIC "老村长" NOR, ({ "lao cunzhang", "lao", "cunzhang" }));
        set("long", @LONG
这是一个瘦小的老者，看起来有一百多岁，他是北戏子北丑和
南贤的师傅，也是这个新手村的村长，如果你有什么问题不妨
找他帮忙，输入指令 ask lao about here 可得到帮助信息。
LONG);
        set("nickname", HIY "人见人爱" NOR);
        set("title", HIR "导师" NOR);
        set("gender", "男性" );
        set("age", 110);
        set("attitude", "friendly");
        set("max_jing", 5000000);
        set("max_qi", 5000000);
        set("max_jingli", 5000000);
        set("jingli", 5000000);
        set("max_neili", 5000000);
        set("neili", 5000000);
        set("jiali", 600);
        set("str", 100);
        set("int", 100);
        set("con", 100);
        set("dex", 100);
        set("combat_exp", 100000000);

        set("inquiry", ([
                "here" : (: ask_here :),
                "HERE" : (: ask_here :),
                "ok"   : (: ask_ok :),
                "OK"   : (: ask_ok :),
                "治疗" : (: ask_zhiliao :),
                "治病" : (: ask_zhiliao :),
                "医疗" : (: ask_zhiliao :),
                "疗伤" : (: ask_zhiliao :),
                "恢复" : (: ask_zhiliao :),
                "解毒" : (: ask_zhiliao :),
                "出村" : (: ask_chucun :),
        ]));

        set_skill("dodge", 800);
        set_skill("unarmed", 800);
        set_skill("force", 800);
        set_skill("parry", 800);
        set_skill("sword", 800);
        set_skill("poison", 800);
        set_skill("medical", 800);
        set_skill("hand", 800);
        set_skill("strike", 800);
        set_skill("staff", 800);
        set_skill("finger", 800);
        set_skill("claw", 800);
        set_skill("blade", 800);
        set_skill("pixie-jian", 800);
        set_skill("literate", 800);
        set_skill("taoism", 800);
        set_skill("buddhism", 800);
        set_skill("jiuyang-shengong", 800);
        set_skill("lingbo-weibu", 800);
        set_skill("qiankun-danuoyi", 800);
        set_skill("xuanming-zhang", 800);
        set_skill("jiuyin-baiguzhao", 800);
        set_skill("lonely-sword", 800);
        set_skill("qianzhu-wandushou", 800);
        set_skill("ranmu-daofa", 800);
        set_skill("dagou-bang", 800);
        set_skill("shaolin-yishu", 800);
        set_skill("wudu-qishu", 800);
        set_skill("throwing", 800);
        set_skill("mantian-xing", 800);
        set_skill("idle-force", 800);
        set_skill("sad-strike", 800);

        map_skill("unarmed", "sad-strike");
        map_skill("force", "jiuyang-shengong");
        map_skill("dodge", "lingbo-weibu");
        map_skill("parry", "qiankun-danuoyi");
        map_skill("hand", "qianzhu-wandushou");
        map_skill("strike", "xuanming-zhang");
        map_skill("claw", "jiuyin-baiguzhao");
        map_skill("sword", "lonely-sword");
        map_skill("blade", "ranmu-daofa");
        map_skill("staff", "dagou-bang");
        map_skill("throwing", "mantian-xing");
        map_skill("poison", "wudu-qishu");
        map_skill("medical", "shaolin-yishu");

        prepare_skill("unarmed", "sad-strike");

        set("chat_chance_combat", 200);
        set("chat_msg_combat", ({
                (: perform_action, "sword.po" :),
                (: perform_action, "blade.zhenyan" :),
                (: perform_action, "blade.huo" :),
                (: perform_action, "staff.wugou" :),
                (: perform_action, "staff.chan" :),
                (: perform_action, "staff.ban" :),
                (: perform_action, "unarmed.xiao" :),
                (: perform_action, "parry.nuoyi" :),
                (: perform_action, "dodge.lingbo" :),
                (: perform_action, "throwing.shan" :),
                (: perform_action, "hand.zhugu" :),
                (: perform_action, "strike.wuji" :),
                (: perform_action, "finger.six" :),
                (: perform_action, "finger.zhongheng" :),
                (: perform_action, "claw.zhua" :),
                (: exert_function, "recover" :),
                (: exert_function, "powerup" :),
                (: exert_function, "shield" :),
                (: exert_function, "heal" :),
                (: exert_function, "dispel" :),
                (: exert_function, "regenerate" :),
        }));

        set("no_pk", 1);
	setup();
        carry_object("d/city/obj/cloth")->wear();
}

mixed ask_zhiliao()
{
        object me;
        string msg;

        me = this_player();

        if( query("combat_exp", me)>200000 )
        {
                return "对不起，你经验太高了，我恐怕也帮不了你！\n";
        }

        if( time()-query_temp("last_full", me)<30 )
        {
                tell_object(me, HIG "老村长告诉你：你刚治疗过，等下再来吧！\n" NOR);
                return 1;
        }
        msg = HIC "老村长看了看你道：好吧！就让我来给你治疗吧！\n" NOR;
        msg+= HIY "老村长默念口诀，然后用手在你身上一点，顿时一到金光将你笼罩 ……\n" NOR;
        msg+= HIG "你感觉全身舒畅之极！你的状态恢复满了！\n\n" NOR;
        
        set("jing",query("max_jing",  me), me);
        set("eff_jing",query("max_jing",  me), me);
        set("jingli",query("max_jingli",  me), me);
        set("eff_jingli",query("max_jingli",  me), me);
        set("neili",query("max_neili",  me), me);
        set("qi",query("max_qi",  me), me);
        set("eff_qi",query("max_qi",  me), me);
        set("food", me->max_food_capacity(), me);
        set("water", me->max_water_capacity(), me);

        me->clear_condition();

        set_temp("last_full", time(), me);

        tell_object(me, msg);

        return 1;
}

// 完成接受的练习
mixed ask_ok()
{
        object me;
        mapping n_quest;

        string msg;
        int exp, qn, score;

        object weapon;

        me = this_player();
        n_quest=query("newbie_quest", me);

        if (! mapp(n_quest))
        {
                tell_object(me, HIG "老村长告诉你：你目前并没有任何练习任务在身。\n"
                                    "如果有需要请 ask lao about here \n" NOR);
                return 1;
        }

        if (n_quest["leixing"] == "wield")
        {
                weapon=query_temp("weapon", me);

                if (! objectp(weapon))
                {
                        tell_object(me, HIG "老村长告诉你：你并没有装备剑啊，如果对使用兵器有疑问你可以输入\n"
                                            "指令 ask lao about 106\n\n" NOR);
                        return 1;
                }
                if( query("skill_type", weapon) != "sword" )
                {
                        tell_object(me, HIG "老村长告诉你：你并没有装备剑。\n\n" NOR);

                        return 1;
                }
                n_quest["completed"] = 1;
        }
        if (n_quest["leixing"] == "jifa")
        {
                if (! me->query_skill("sword", 1) || ! me->query_skill("tianjian", 1))
                {
                        tell_object(me, HIR "老村长对你说道：" + n_quest["msg"] + "\n" NOR);
                        return 1;
                }
                if (me->query_skill_mapped("sword") != "tianjian")
                {
                        tell_object(me, HIR "老村长对你说道：" + n_quest["msg"] + "\n" NOR);
                        return 1;
                }
                n_quest["completed"] = 1;
        }
        if (n_quest["leixing"] == "baishi")
                if( query("family/master_id", me) == "wu bo" )
                        n_quest["completed"] = 1;
        
        if (n_quest["completed"])
        {
                exp=query("newbie_quest/point", me)*5+random(10);
                qn = exp / 2 + random(exp / 2);
                score=query("newbie_quest/point", me);

                msg = HIG "老村长点头微笑道：不错！不错！看来你已经掌握了 " + HIY + 
                          query("newbie_quest/quest_name", me)+HIG"的方法了！\n"NOR;
                msg+= HIC "你完成了老村长交给你的练习任务， 获得了「" + chinese_number(exp) + 
                      "点实战经验和" + chinese_number(qn) + "点潜能以及" + chinese_number(score) + "点"
                      "江湖阅历」。\n" HIW "能力得到了提升！\n\n" NOR;

                addn("combat_exp", exp, me);
                addn("potential", qn, me);
                addn("score", score, me);

                // 任务记录
                set("newbie_quest_completed/"+query("newbie_quest/leixing", me), 1, me);

                // 任务完成
                delete("newbie_quest", me);

                me->save();
        }
        else
        {
                tell_object(me, HIR "老村长对你说道：" + n_quest["msg"] + "\n" NOR);
                return 1;
        }

        tell_object(me, msg);

        return 1;
}

int accept_object(object me, object ob)
{
        return 1;
}

// 接受询问，可回答相关问题，且可分派任务
// me代表this_player()
mixed accept_ask(object me, string topic) 
{
        mixed n_quest;
        string msg;

        n_quest=query("newbie_quest", me);

        if( topic == "all" )
        {
                "/cmds/std/ask.c"->query_inquiry(me, this_object()); 
                return 1;
        }
        // 检查是否是任务状态
        if (mapp(n_quest))
        {
                   tell_object(me, HIR "老村长对你说道：" + n_quest["msg"] + "\n如果已经练习请ask lao about ok\n" NOR);
                    return 1;
        }
        
        if (topic == "1") // 什么是文字MUD游戏
        {
                 msg = HIW + "\n"
"老村长对你说道：那就让我来给您介绍一下文字MUD游戏吧：\n"
"----------------------------------------------------\n" HIY +
"    文字MUD游戏是悬浮于现实中的一个虚拟世界，" HIM "在这里你可以扮演一个角色，\n"
"这个角色也许就是你在现实中隐藏于内心深处的真实性格的折射。 你可以控制\n"
"你所扮演的角色在这个虚拟的世界里生存、成长、寻觅、宣泄 ……，你也将逐\n"
"渐和你所扮演的角色融为一体， 用心去感受这个虚拟世界给你带来的快乐和难\n"
"忘时光，慢慢地忘却俗世中的不快与悲愁 ……\n\n" HIY +
"    在文字MUD这个虚拟的世界里，你几乎可以做你在现实中可以做的所有事情，\n" HIM +
"聊天、吃饭、喝水、生病/治病，爱情/友情，打架/练功/杀人/救人，探险，寻\n"
"宝，赚钱，买房，结婚，招兵买马逐鹿中原， 甚至可以成为整个虚拟世界的统\n"
"治者，从此君临天下 ……\n\n" HIY +
"    与图形游戏相比，文字MUD游戏最大的特色就是给人无限的想象空间，" HIM "图形\n"
"游戏是以固定、直观的图形描述你所看到的事物，而文字MUD就如你在读一本精\n"
"彩的小说一样， 所有小说中地点、人物、事件都是用生动的文字和色彩描述出\n"
"来，这样一来可以给人以无穷无尽的想象空间，让人感觉整个世界的多姿多彩。\n\n"
"    在这里你扮演着一个虚拟的角色，确切地来说你扮演的角色就是你。 和图\n"
"形游戏不同的是，你需要输入各种指令来达到你的目的，看东西可以输入 look\n"
"指令，吃东西输入eat指令，切磋武艺用fight指令，走路用go指令， 说话则可\n"
"以用chat、say、tell等指令，一言以蔽之，" HIY "你不再是通过鼠标来操作你的角色，\n"
"而是通过输入各种指令来控制你所扮演的角色的各种行为，" HIM "指令是文字MUD最常\n"
"用，最高效的操作方式。\n\n" HIY +
"    在这个虚拟世界里，你没有任何固定的目标， " HIM "你可以不断地成长，拜师学\n"
"艺，钻研至高无尚的武学；你也可以无忧无虑做些买卖， 四处搜罗一些奇珍异\n"
"宝卖个好价钱，成为一名富甲天下富豪；当然， 你也可以整日摸索诸如机关铸\n"
"造之术，锻造出震惊天下的神兵利器，战衣宝甲； 如果你是怀着一颗救世济民\n"
"之心，你也可以立志做一名药师， 将毕生的精力灌注于对医术、药理的研究中，\n"
"成为华佗再现、扁鹊重生的一代神医药王； 假如你天生不愿过多涉足纷乱的江\n"
"湖，喜欢做一个独来独往、来去无踪的人， 你不妨尝试到扶桑或高丽去做一名\n"
"刺客，从此过着隐姓埋名，浪迹天涯的生活 ……\n\n"
"    这就是文字MUD虚拟世界，赶快将融入到这个世界中来吧，它会带给你无穷\n"
"无尽的欢乐和微笑，让你忘却尘世中的无奈与悲愁 ……\n\n" HIR
"                                              泥潭Ⅴ之王者归来 欢迎您\n\n" NOR;
      
        } else
        if (topic == "2") // 单介绍一下这个游戏的玩法
        {                 msg = HIW + "\n"
"老村长对你说道：那就让我来给您介绍一下泥潭Ⅴ的玩法吧：\n"
"----------------------------------------------------\n" HIC +
"注：以下的「" HIY "泥潭" HIC "」代表本游戏「" HIY "泥潭Ⅴ" HIC "」\n\n" HIY +
"    泥潭是一个以浓郁的武侠色彩为背景的虚拟文字网络游戏，" HIM "注册进入游戏后\n"
"你首先来到的是『" HIG "古村" HIM "』，在这里，你将在系统为你设定的新手导师的细心的指\n"
"导下，了解和掌握如何进行这个游戏。同时，在你向新手导师学习的过程中你可\n"
"以通过完成一些新手导师交给你的简单任务获取一定的经验点和相关奖励，更重\n"
"要的是，在古村的「武伯」（在练武场）处你还可以学到几种武功技能，这将对\n"
"你日后的发展和行走江湖有很大的帮助。\n\n" HIY + 
"    当在古村历练完或不愿历练，你可请求导师「老村长」允许你出村，" HIM "一旦老\n"
"村长觉得你历练合格后将准许你离开古村进入江湖闯荡。大家注意了，在古村里\n"
"一切都有导师老村长的照顾，生病啊、受伤啊、饥饿啊什么都可以免费找他，而\n"
"且在古村里你的年龄永远不会增加。但是一旦你出了古村，进入纷乱复杂的江湖\n"
"就大不一样了，一切都得自己照顾自己了。\n\n" HIY +
"    进入江湖后最好就是立刻找一个自己中意的门派，拜师学艺。" HIM "泥潭提供了不\n"
"少的门派，诸如华山、武当、少林、逍遥等知名门派，各门派的特色也各有不同，\n"
"拜哪个门派学哪门武艺全凭个人的喜好。\n\n" HIY +
"    当你进入门派后，你就是真正江湖中的人了，以后的路如何走就得靠你自己\n"
"去抉择。" HIM "本游戏为每个玩家提供了多元化的发展空间，有多种职业方向供你们去\n"
"选择，这以后你们就得学会多看help帮助文件（输入指令help），多和其他玩家\n"
"交流，多开动你们的脑筋，你完全可以把这里想象成一个虚拟的现实世界，把自\n"
"己的才智充分的在这里发挥出来 ……\n\n" HIR
"    需要着重说明的是，你的一切行为都是通过指令来控制的，指令有以下几部\n"
"分组成：\n" HIM
"    1、" HIG "指令名：" HIM "  如吃的指令名就是 eat，杀人的指令名就是 kill 。\n\n"
"    2、" HIG "对  象：" HIM"  比如你要吃馒头(man tou)，你的对象就是馒头(man tou)，\n"
"                 要杀李四(li si)，你的对象就是李四(li si)。\n" HIR
"                 注：对象均是以ID的形式出现，在中文名后的括号中的英文名\n"
"                 就是对象ID，如要杀李四(li si)，应该输入指令：\n"
"                 kill li si ，而不是输入指令 kill 李四；\n"
"                 要吃馒头(man tou)应该输入指令：\n"
"                 eat man tou ，而不是输入指令 eat 馒头。\n" HIM
"    3、" HIG "参  数：" HIM "  比如直接输入指令 hp 可显示你当前的状态， 而再加上一个\n"
"                 参数 -g 的话则可显示你的先天属性，即输入指令 hp -g 。\n\n" 
"    具体的细节可通过 " HIY "ask lao about 信息编号" HIM " 来进一步了解。\n\n" HIM
"    好了，现在就赶快开始你的人生旅程吧，祝君多珍重！\n\n" HIR
"                                                     泥潭巫师组 欢迎您\n\n" NOR;

        } else
        if (topic == "3") // 我在游戏里能做些什么
        {                 msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你可以做些什么吧：\n"
"----------------------------------------------------\n" HIY +
"    正如你在现实中一样，这里是一个虚拟现实的世界，在这里你可以做几乎一\n"
"切你想做的事：探险、聊天、练功、经商、做官、杀人、救人、结婚等等，只不\n"
"过你是以另一个虚拟的角色存在于这个世界中。你可以在这里完成你在现实中无\n"
"法完成的想法、愿望或者一些梦想 ……\n\n"
"    总之，一句话，在这里以外你是生活在一个世界中，而进入这里以后你又是\n"
"生活在属于这个充满梦想的世界 ……\n\n" HIR
"                                                     泥潭巫师组 欢迎您\n\n" NOR;
        } else
        if (topic == "4") // 我自己是谁
        {
                msg =  HIM "关于<你自己是谁>有以下相关信息：\n" NOR;
                msg += HIY "编号         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "41        查看我自己的外表\n"
                           "42        查看我自己的基本资料\n"
                           "43        查看我自己的状态\n"
                           "44        查看我自己的天赋属性\n"
                           "45        查看我自己所学的技能\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
                msg += HIR "如要了解 <查看我自己的外表> 的信息，则输入 ask lao about 41\n" NOR;
        } else
        if (topic == "5") // 我在哪里
        {
                msg =  HIM "关于<你在哪里>有以下相关信息：\n" NOR;
                msg += HIY "编号         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "51        查看我所在的地点\n"
                           "52        查看我所在的区域\n"
                           "53        查看整个中原地图\n"
                           "54        查看整个世界地图\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
                msg += HIR "如要了解 <查看我所在的区域> 的信息，则输入 ask lao about 52\n" NOR;
        } else
        if (topic == "6") // 如何移动
        {
                msg =  HIM "关于<如何移动>有以下相关信息：\n" NOR;
                msg += HIY "编号         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "61        行走\n"
                           "62        乘坐马车\n"
                           "63        骑马\n"
                           "64        追寻自己的神兵\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
                msg += HIR "如要了解 <乘坐马车> 的信息，则输入 ask lao about 62\n" NOR;
        } else
        if (topic == "7") // 如何跟其他朋友交流
        {
                msg =  HIM "关于<如何跟其他朋友交流>有以下相关信息：\n" NOR;
                msg += HIY "编号         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "71        聊天\n"
                           "72        留言\n"
                           "73        短消息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
                msg += HIR "如要了解 <留言> 的信息，则输入 ask lao about 72\n" NOR;
        } else
        if (topic == "8") // 我可以扮演哪些角色
        {                 msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你关于泥潭职业的相关信息吧：\n"
"----------------------------------------------------\n" HIM +
"    抱歉，目前职业系统更新中，暂未开放。\n\n" NOR;
        } else
        if (topic == "9") // 如何生存
        {
                msg =  HIM "关于<如何生存>有以下相关信息：\n" NOR;
                msg += HIY "编号         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "91        解决温饱\n"
                           "92        生病了怎么办\n"
                           "93        死亡后怎么办\n"
                           "94        中毒了怎么办\n"
                           "95        受伤了怎么办\n"
                           "96        如何拣东西、给东西、扔东西\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
                msg += HIR "如要了解 <中毒了怎么办> 的信息，则输入 ask lao about 94\n" NOR;
        } else
        if (topic == "10") // 如何练功和使用兵器
        {
                msg =  HIM "关于<如何练功和使用兵器>有以下相关信息：\n" NOR;
                msg += HIY "编号         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "101       内功介绍\n"
                           "102       外功介绍\n"
                           "103       轻功介绍\n"
                           "104       招架介绍\n"
                           "105       其他技能介绍\n"
                           "106       使用兵器\n"
                           "107       拜师学艺\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
                msg += HIR "如要了解 <内功介绍> 的信息，则输入 ask lao about 101\n" NOR;
        } else
        if (topic == "11") // 如何战斗
        {
                msg =  HIM "关于<如何战斗>有以下相关信息：\n" NOR;
                msg += HIY "编号         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "111       战斗系统介绍\n"
                           "112       战斗前的必要准备\n"
                           "113       战斗指令介绍\n"
                           "114       如何施展内功\n"
                           "115       如何施展外功\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
                msg += HIR "如要了解 <内功介绍> 的信息，则输入 ask lao about 101\n" NOR;
        } else
        if (topic == "12") // 如何得到更多帮助
        {
                msg =  HIM "关于<如何得到更多帮助>有以下相关信息：\n" NOR;
                msg += HIY "编号         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "121       查看帮助文件库\n"
                           "122       玩家间的交流\n"
                           "123       请求新手导师帮助\n"
                           "124       广播你的求教信息\n"
                           "125       在泥潭信息库中搜索你需要的信息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
                msg += HIR "如要了解 <广播你的求教信息> 的信息，则输入 ask lao about 124\n" NOR;
        } else
        if (topic == "13") // 如何离开这里到外面的世界去
        {
                msg = HIM "等你在这里历练合格（输入指令 " HIY "ask lao about 出村" HIM "）后，可到『古村』村口\n"
                      "去找" HIG "花伯" HIM "（输入指令 " HIY "ask hua about 出村" HIM "）。\n" NOR;

        } 
        // ==================================================================================
        // 从 4 开始的二级分类
        // ==================================================================================
        else
        if (topic == "41") // 查看我自己的外表
        {
                msg=HIM"\n你可以输入指令"+BLINK+HIY+"look "+query("id", me)+NOR+HIM"来查看"
                          "你自己的外表。\n" NOR;
                msg += HIR "赶快试试这个指令吧！\n\n" NOR;
        } else
        if (topic == "42") // 查看我自己的基本资料
        {
                msg = HIM "\n你可以输入指令 " + BLINK + HIY + "score" + NOR + HIM " 来查看你自己的基本资料。\n" NOR;
                msg += HIR "赶快试试这个指令吧！\n\n" NOR;
                
                msg += HIM "关于<score指令所显示的基本资料>有以下相关信息：\n" NOR;
                msg += HIY "编号         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "421       天性的作用\n"
                           "422       实战经验的作用\n"
                           "423       江湖阅历的作用\n"
                           "424       正气和邪气的作用\n"
                           "425       门派贡献的作用\n"
                           "426       江湖威望的作用\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
                msg += HIR "如要了解 <江湖威望的作用> 的信息，则输入 ask lao about 425\n" NOR;
                msg += HIY "输入指令 " + HIR + BLINK + "score" + NOR + HIY " 可查看到以上基本资料。\n" NOR;
        } else
        if (topic == "43") // 查看我自己的状态
        {
                msg = HIM "\n你可以输入指令 " + BLINK + HIY + "hp" + NOR + HIM " 来查看你自己当前的状态。\n" NOR;
                msg += HIR "赶快试试这个指令吧！\n\n" NOR;
                
                msg += HIM "关于<hp指令所显示的数据>有以下相关信息：\n" NOR;
                msg += HIY "编号         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "431       精气的作用\n"
                           "432       精力的作用\n"
                           "433       气血的作用\n"
                           "434       内力的作用\n"
                           "435       食物与饮水有什么作用\n"
                           "436       潜能的作用\n" 
                           "437       体会的作用\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
                msg += HIR "如要了解 <内力的作用> 的信息，则输入 ask lao about 434\n" NOR;
                msg += HIY "输入指令 " + HIR + BLINK + "hp" + NOR + HIY " 可查看以上信息。\n" NOR;

        } else
        if (topic == "44") // 查看我自己的天赋属性
        {
                msg = HIM "\n你可以输入指令 " + BLINK + HIY + "hp -g" + NOR + HIM " 来查看你自己当前的状态。\n" NOR;
                msg += HIR "赶快试试这个指令吧！\n\n" NOR;
                
                msg += HIM "关于<hp -g 指令所显示的数据>有以下相关信息：\n" NOR;
                msg += HIY "编号         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "441       臂力的作用\n"
                           "442       悟性的作用\n"
                           "443       根骨的作用\n"
                           "444       身法的作用\n"
                           "445       种类的作用\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
                msg += HIR "如要了解 <身法的作用> 的信息，则输入 ask lao about 444\n" NOR;
                msg += HIY "输入指令 " + HIR + BLINK + "hp -g" + NOR + HIY " 可查看以上信息。\n" NOR;

        } else
        if (topic == "45") // 查看我自己所学的技能
        {
                msg = HIM "\n你可以输入指令 " + BLINK + HIY + "cha" + NOR + HIM " 来查看"
                          "你掌握的技能。\n" NOR;
                msg += HIR "赶快试试这个指令吧！\n\n" NOR;

        } else
        if (topic == "421") // 天性的作用
        {
                 msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你泥潭中有关天性的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    天性即是你出生时具有的先天性格，不同的天性会对你以后的发\n"
"展有一定的影响，虽然天性对你拜哪个门派并没有什么影响，但是它\n"
"会影响你学某些武功，而泥潭中的绝大多数上层武功均有天性的限制。\n"
"例如由胡家刀法与苗家剑法所演练合成的不世武学刀剑归真便非天性\n"
"光明磊落者不能学习，而此种天性者却不会使用毒技。又例，修炼号\n"
"称武林第一秘笈的葵花魔功及其残缺不全版本的辟邪剑法，便均需阴\n"
"险奸诈之辈。除了武功对性格的要求外，不同性格同时还具有以下特\n"
"点：\n\n" HIY +
"   【光明磊落】       具有最大的愤怒值和最大的加怒能力，能够\n"
"                      有效的施展愤怒一击。另外还将获得更好的\n"
"                      抗打击能力，不容易受伤。\n\n" + HIC +
"   【狡黠多变】       在受到对方的牵制性攻击或是自身使用绝招\n"
"                      后，所受到的忙碌状态将会缩短一些，但并\n"
"                      不是每次都能够奏效。\n\n" HIR +
"   【心狠手辣】       和光明磊落者一样，能够有效的运用愤怒技\n"
"                      能，施展加怒和愤怒一击。另外在命中对手\n"
"                      时还具有更为强大的杀伤力。\n\n" + HIG +
"   【阴险奸诈】       在普通战斗状态下或是使用一些特殊的进攻\n"
"                      性绝招时，自身的攻击命中率将获得有效的\n"
"                      提升，可以更容易击中对手。\n\n" NOR;

        } else
        if (topic == "422") // 实战经验的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关实战经验的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    简单来说，实战经验有以下几点作用：\n\n" HIY + 
"一、影响你在战斗中的攻击命中率及伤害点数。\n"
"二、限制你的技能等级，你的技能等级换算公式如下：\n" HIR
"    实战经验 >= 技能等级*技能等级*技能等级 / 10\n" HIY
"三、影响你在门派中继续向上拜师和学习一些绝招。\n"
"四、随着你实战经验地升高，你的任务难度也会逐渐增大。\n\n" HIM
"    如何提高实战经验：\n\n" HIY
"    可以通过完成师门任务、自由任务或一些特殊故事情节获取实战经验。\n\n" NOR;

        } else
        if (topic == "423") // 江湖阅历的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关江湖阅历的信息吧：\n"
"-----------------------------------------------------\n" HIY +
"    简单来说，江湖阅历有以下作用：\n\n" HIM
"一、在你领取师门任务前，师傅会叫你外出历练，而历练前提就是需\n"
"要具有100点江湖阅历。\n"
"二、对于一些特殊事件会对江湖阅历做要求。\n"
"三、影响你的综合实力评价。\n\n" HIR
"    如何提升江湖阅历？\n\n" HIM
"    通过完成各种任务，到郭府历练等都可以提高江湖阅历，同时在\n"
"古村历练完成后也将获得一些江湖阅历。\n" NOR;

        } else
        if (topic == "424") // 正气和邪气的作用
        {                
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关正气和邪气的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    正气和邪气代表着你正邪立场，江湖中有正道就有邪道，所谓正邪\n"
"不两立，一旦你选择了正道，就将被邪道所排斥，相反也是如此。所以，\n"
"一开始你就得想好你以后是走哪条路，泥潭为玩家们提供了比较丰富的\n"
"门派以供选择，其中包含正派，如武当、少林等，也有邪派，如星宿派、\n"
"日月神教等，正派要求你具有正气而邪派要求你具有邪气。你在一个门\n"
"派中的地位越高，则要求你的正气或者邪气越高。\n\n" HIR
"    如何增加正气或邪气？\n\n" HIM
"    很简单，你只要多杀正派人士，你的邪气就会增加；多杀邪派人士，\n"
"你的正气就会增加。在进入这个世界的时候，你的正气是 0，即代表你\n"
"没有正气也没有邪气，加入正派时只要你的正气不是负数（即没有邪气）\n"
"即可；而加入某些邪派却需要邪气，一开始，当你什么技能都没有的时\n"
"候，可以去通过吃人头来增加邪气。\n\n" NOR;

        } else
        if (topic == "425") // 门派贡献的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关门派贡献作用的信息吧：\n"
"---------------------------------------------------------\n" HIM +
"    在泥潭里，所有的玩家都会有一个门派，在门派中你要获得较高\n"
"的地位，学到更高级的武功及绝招以及获得师傅奖励的物品都需要消\n"
"耗门派贡献。\n\n"
"    在泥潭里，你可以通过完成师门任务（输入指令 help quest 查\n"
"看）或一些特殊故事情节来增加门派贡献度。\n\n" NOR;

        } else
        if (topic == "426") // 江湖威望的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关江湖威望作用的信息吧：\n"
"---------------------------------------------------------\n" HIM +
"    简单来说，江湖威望有以下作用：\n\n"
"一、在门派掌门处领取杀人的任务时需要至少20点江湖威望。\n"
"二、在做自由任务之调解任务时，需要请单正做调解，至少要江湖威\n"
"望10000点以上才能请得动单正。\n"
"三、影响你的综合实力评价。\n\n" HIR
"    如何增加江湖威望？\n\n" HIM
"一、如果你能弄到黄金可通过向泥潭基金捐献黄金获得威望。\n"
"二、通过完成门派掌门交给你的送信任务来增加威望。\n\n" NOR;

        } else
        if (topic == "431") // 精气的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关精气的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    简单来说，精气代表着你的精神状态，你在读书或者研究武功的\n"
"时候需要消耗精气。精气为零只会导致你不能读书或研究武功，不会\n"
"晕倒。\n\n" HIR
"   如何提高精气？\n\n" HIM 
"   提高你的精力值，精气上限值受精力值的限制。\n\n" NOR;

        } else
        if (topic == "432") // 精力的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关精力的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    精力是一个比较重要的属性值，代表着你的思维状态，一旦精\n"
"力为零你就会晕倒，这非常之严重，如果在战斗中你突然晕倒即意\n"
"味着死亡。再就是，精力的高低影响着你的发展，如修炼一些高级\n"
"武学境界，同时精力的高低也直接影响着精气的高低。\n\n" HIR
"    如何提高精力？\n\n" HIM
"    你可以通过吐呐（输入指令 help tuna 查看）来提高你的精力。\n\n" NOR;

        } else
        if (topic == "433") // 气血的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关气血的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    气血代表着你的生命值，当气血为零的时候你就会死亡。在练\n"
"习武功或进行一些体力活动时要消耗气血。\n\n" HIR
"    如何提高气血？\n\n" HIM
"    随着你年龄的增加你的气血会增加少量，在泥潭里累积在线 240\n"
"小时增加年龄一岁。再就是你的内力上限影响你的气血，内力越来越\n"
"高你的气血就会越高，所以等你有一定内功基础后可以通过打坐来提\n"
"高内力，从而提高你的气血， 有关打坐方法请输入指令 help dazuo\n"
"查看。\n\n" NOR;

        } else
        if (topic == "434") // 内力的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关内力的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    内力代表你体内所蕴藏的能量，简单来说，在你施展绝招，运功\n"
"疗伤、解毒等时候，都需要消耗你的内力值。内力在泥潭里是一个非\n"
"常重要的属性。\n\n" HIR
"    如何提高内力？\n" HIM
"    等你有一定内功基础的时候可以通过打坐来提高你的内力，有关\n"
"打坐的方法及指令可输入指令 help dazuo 来查看。\n\n" NOR;

        } else
        if (topic == "435") // 食物与饮水有什么作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关食物与饮水的作用的信息吧：\n"
"-------------------------------------------------------------\n" HIM +
"    食物和饮水属性代表着你的饥饿程度，一旦食物或饮水为零则会\n"
"导致你晕倒，如在战斗中晕倒则意味着死亡。\n\n" HIR
"    如何提高食物和饮水？\n\n" HIR
"    在泥潭里你可以通过吃东西和喝东西来提高食物和饮水，通常在\n"
"各城市的客店都会有食物和水袋卖。\n\n" NOR;
        } else
        if (topic == "436") // 潜能有什么作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关潜能的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    潜能通俗地来说就是“学习点数”，你在向师傅学习技能或自己\n"
"研究技能的时候都需要消耗潜能，如果潜能不足，你将无法继续学习\n"
"技能。\n\n" HIR
"    如何提高潜能？\n\n" HIM
"    在泥潭中你可以通过多种途径来提高潜能，如工作、做任务、服\n"
"用一些特殊丹药等。通常玩家通过完成师门任务来积累潜能。\n\n" NOR;
        } else
        if (topic == "437") // 体会有什么作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关体会的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    体会即实战体会，是你在战斗或任务中获得的体会，当你的体会\n"
"值积累到一定的时候，可以通过汲取体会（输入指令 jiqu ）来将体\n"
"会转化为武学修养，武学修养影响着你学习一些高级武功。\n\n" HIR
"    如何提高体会？\n\n" HIM
"    通过完成师门任务或一些特殊任务可提高实战体会。\n\n" NOR;

        } else
        if (topic == "441") // 臂力的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关臂力的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    在泥潭中臂力分为" HIY "先天臂力" HIM "和" HIY "后天臂力" HIM "，先天臂力是你一出生就\n"
"具有的，且不会随着后天某些武功的增加而增加，但是可以通过服用\n"
"各种仙丹、奇遇和先天特殊技能来提升，除此外别无他法。\n\n"
"    先天臂力的高低会影响你日后学习某些高级技能，如九阴神功需\n"
"要限制你先天臂力不低于三十八点。\n\n"
"    后天臂力则不同，后天臂力可通过学习基本拳脚等空手技能来提\n"
"升，每学习十级可提升一点臂力，后天臂力的计算公式是：\n\n" HIG
"    后天臂力 = 先天臂力 + 拳脚等级 / 10\n\n" HIM
"    臂力影响你的：攻击威力、负重等。\n\n"
"    先天臂力可输入指令 hp -g 查看。\n"
"    后天臂力可输入指令 score 查看。\n\n"NOR;

        } else
        if (topic == "442") // 悟性的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关悟性的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    在泥潭中悟性分为" HIY "先天悟性" HIM "和" HIY "后天悟性" HIM "，先天悟性是你一出生就\n"
"具有的，且不会随着后天某些武功的增加而增加，但是可以通过服用\n"
"各种仙丹、奇遇和先天特殊技能来提升，除此外别无他法。\n\n"
"    先天悟性的高低会影响你日后学习某些高级技能，如独孤九剑需\n"
"要限制你先天悟性不低于三十九点。\n\n"
"    后天悟性则不同，后天悟性可通过学习读书写字来提升，每学习\n"
"十级可提升一点悟性，后天悟性的计算公式是：\n\n" HIG
"    后天悟性 = 先天悟性 + 读书写字等级 / 10\n\n" HIM
"    悟性影响你的：学习速度、领悟能力。\n\n"
"    先天悟性可输入指令 hp -g 查看。\n"
"    后天悟性可输入指令 score 查看。\n\n"NOR;

        } else
        if (topic == "443") // 根骨的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关根骨的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    在泥潭中根骨分为" HIY "先天根骨" HIM "和" HIY "后天根骨" HIM "，先天根骨是你一出生就\n"
"具有的，且不会随着后天某些武功的增加而增加，但是可以通过服用\n"
"各种仙丹、奇遇和先天特殊技能来提升，除此外别无他法。\n\n"
"    先天根骨的高低会影响你日后学习某些高级技能，如六脉神剑需\n"
"要限制你先天根骨不低于三十六点。\n\n"
"    后天根骨则不同，后天根骨可通过学习基本内功来提升，每学习\n"
"十级可提升一点根骨，后天根骨的计算公式是：\n\n" HIG
"    后天根骨 = 先天根骨 + 基本内功等级 / 10\n\n" HIM
"    根骨影响你的：体力等恢复速度、内力上限等。\n\n"
"    先天根骨可输入指令 hp -g 查看。\n"
"    后天根骨可输入指令 score 查看。\n\n"NOR;


        } else
        if (topic == "444") // 身法的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关身法的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    在泥潭中身法分为" HIY "先天身法" HIM "和" HIY "后天身法" HIM "，先天身法是你一出生就\n"
"具有的，且不会随着后天某些武功的增加而增加，但是可以通过服用\n"
"各种仙丹、奇遇和先天特殊技能来提升，除此外别无他法。\n\n"
"    先天身法的高低会影响你日后学习某些高级技能，如凌波微步需\n"
"要限制你先天身法不低于三十点。\n\n"
"    后天身法则不同，后天身法可通过学习基本轻功来提升，每学习\n"
"十级可提升一点身法，后天身法的计算公式是：\n\n" HIG
"    后天身法 = 先天身法 + 基本轻功等级 / 10\n\n" HIM
"    身法影响你的：攻击命中、闪躲能力。\n\n"
"    先天身法可输入指令 hp -g 查看。\n"
"    后天身法可输入指令 score 查看。\n\n"NOR;

        } else
        if (topic == "445") // 种类的作用
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关种类的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    输入 hp -g 命令后，可以看到第一行显示以下种类：\n\n" HIG
"    『初始』 『先天』 『成功』 『失败』 『故事』 『元神』\n\n" HIM
"    初始：你出生的时候获得该天赋（如先天悟性）初始先天值。\n"
"    先天：你当前该天赋（如先天根骨）的先天值。\n"
"    成功：这项代表你服用丹药来增加先天属性的成功次数。\n"
"    失败：这项代表你服用丹药来增加先天属性的失败次数。\n"
"    故事：1代表你已经中过能增加该天赋的故事。\n"
"          0代表你未中过能增加该天赋的故事。\n"
"    元神：表示你通过元神的修炼也可以增加臂力、悟性等属性。\n\n" HIR
"    注：无论成败，对于一种天赋，你一生只能吃十个增加天赋的仙\n"
"    丹。如先天悟性，你总共吃丹数量最多限制为十颗，当前已服用\n"
"    仙丹数量（如增加先天悟性的仙丹）的计算方法如下：\n\n" HIG
"    服用数量 = 成功次数 + 失败次数\n\n" NOR;

        } else
        if (topic == "51") // 查看我所在的地点
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关你所在的地点信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    输入指令 " BLINK + HIR "look" NOR + HIM" 可查看你当前所在的地点，你可以看到以下一些\n"
"    信息：\n\n" HIM
"    地点名：    " HIY "即该地点的地名，如你现在就在「世界之树」这个\n"
"    地方。\n\n" HIM
"    地点描述：  " HIY "即该地点的说明，如“这里是古村的正中心……”\n"
"    就是该地点的一些描述。\n\n" HIM
"    地点出口：  " HIY "即该地点连接到的其他地方，如：\n"
"   “这里明显的出口是 north、east、west 和 south” \n"
"    以上的north（北面）、east（东面）等就是该地点的出口。\n\n" HIM
"    人物、物品：" HIY "即该地点中有哪些人物，如：\n"
"    “导师「人见人爱」老村长(lao cunzhang)” 就是该地点中\n"
"    人物。如果地上有物品则会有相关显示：如“一两黄金(Gold)”\n\n" NOR;

        } else
        if (topic == "52") // 查看我所在的区域
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关你所在的区域信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    输入指令 " BLINK + HIY + "map" + NOR + HIM " 来查看你当前所在区域。\n" HIR
"    赶快试试这个指令吧！\n\n" NOR;
        } else
        if (topic == "53") // 查看整个中原地图
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关查看中原地图信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    输入指令 " BLINK + HIY + "map china" + NOR + HIM " 来查看整个中原地图。\n" HIR
"    赶快试试这个指令吧！\n\n" NOR;
        } else
        if (topic == "54") // 查看整个世界地图
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关查看世界地图信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    输入指令 " BLINK + HIY + "help mapall.txt" + NOR + HIM " 来查看整个世界地图。\n" HIR
"    赶快试试这个指令吧！\n\n" NOR;
        } else
        if (topic == "61") // 行走
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关行走的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    在泥潭里行走是最基本最常用的移动方式，你可以通过行走移动到与你\n"
"所在地点有出口的地方，如你输入指令 look 可以看到你所在地点的出口：\n\n" HIG
"    这里明显的出口是 north、east、west 和 south \n\n" HIM
"    north(北)、east(东)、west(西)、south(南)就是这个地点的出口，你\n"
"只需要输入出口的英文名，如输入指令 north 即向北移动。 通过连续地移\n"
"动你便可以达到你想去的地方。\n\n"
"    但是，如果对地图不熟悉，使用行走的方式移动容易迷路，这就需要借\n"
"助 show 指令的了，输入指令 show 可以看到你所在的这个地点在你这个区\n"
"域内的具体位置，通过指令 show 你可以查看到你在的地点是「世界之树」，\n"
"而你所在的区域是【古村】，根据：\n\n "HIG
"    上北、下南、左西、右东的原则，\n\n" HIM
"    如果你要行走到「南练武场」，则依次输入：\n\n" HIC
"    east、east、south\n\n" HIM
"    即可到达，而为简单方便起键，通常出口都可以进行以下缩写：\n\n" HIR
"    east = e; south = s; north = n; west = w;\n"
"    up(上) = u; down(下) = d; northeast(东北) = ne 等等\n\n" NOR;

        if( !query("newbie_quest_completed/move", me) )
        {
                msg += HIM "    现在，你将接受一个练习，根据你学到的行走方式，你移动到「" HIG "竹林" HIM "」\n";
                msg +=     "去，然后回来找我 " HIY "ask lao about ok" HIM " 。\n\n" NOR;
                set("newbie_quest/leixing", "move", me);
                set("newbie_quest/quest_name", "如何行走", me);
                set("newbie_quest/tar_id", "zhulin", me);
                set("newbie_quest/point", 10, me);
                set("newbie_quest/msg", HIY"你先移动到竹林去，然后再回来找我（ask lao about ok）。"NOR, me);
                me->save();
        } // endif
        } else
        if (topic == "62") // 乘坐马车
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关乘坐马车的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    通常，在一个城市内移动不需要乘坐马车，使用行走方式即可。但是如\n"
"果需要移动到其他城市，便可以通过乘坐马车来节约时间。马车可在每个城\n"
"市的马厩里输入指令 " HIY "goto <城市ID>" HIM " 来乘坐，在马厩输入指令 " HIY "look paizi\n"
HIM "可查看各城市ID。\n\n" NOR;
        } else
        if (topic == "63") // 骑马
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关骑马的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    骑马的功能几乎的乘坐马车一样，但是骑马具有更大的灵活性，其不但\n"
"可以从任何地方开始，直接到达各大城市马厩，而且可以通过记录某些地点，\n"
"以后可骑马直接达到。更重要的是，你不但可以自己骑马而且也可以搭上你\n"
"的同伴与你一起快马同行。\n"
"如果你对骑马的移动方式感兴趣可参见帮助文件 " HIY "help horse\n\n" NOR;
        } else
        if (topic == "64") // 追寻自己的神兵
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关追寻自己的神兵的信息吧：\n"
"-----------------------------------------------------------\n" HIM +
"    每一个江湖人士都会有一把自己心爱的兵器，兵器也有等级之分，当你\n"
"的兵器被炼化到十级的时候，你便可以把兵器放在任何一个地方，以后直接\n"
"通过追寻(指令为 miss <兵器ID>)便可从任何地方到达你兵器所在地方。\n"
"如果你对追寻神兵感兴趣的话可参见帮助文件 " HIY "help weapon\n\n" NOR;
        } else
        if (topic == "71") // 聊天指令
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关聊天指令的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    任何一个世界中都无法离开交流，而聊天是最直观，最高效的交流方式。\n"
"本游戏为各位玩家提供了非常丰富的聊天指令，现简单介绍如下：\n\n" HIC
"    chat <聊天内容>   ： 将聊天内容广播出，所有在线的玩家都能收到。\n"
"    sos <聊天内容>    ： 新手求救，可在此发出你的求救信息。\n"
"    rumor <聊天内容>  ： 发布谣言。此频道可隐藏发言人的姓名。\n"
"    bill <聊天内容>   ： 交易频道，交易信息可在此频道发布。\n"
"    family <聊天内容> ： 同门交流，只有与你同师门的玩家能收到。\n"
"    tell sb <聊天内容>： 密谈，跟sb进行秘聊，这些聊天内容只有你们两人看得到。\n\n" HIM
"    其他聊天指令可参见帮助文件 help channels\n\n" NOR;
        } else
        if (topic == "72") // 留言
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关留言的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    在游戏中的客店或其他一些特殊的地方都设有留言板(board)，你可以在这些地方\n"
"输入指令 post <留言主题>，然后输入留言内容后，注意，这时你需要按 . 键（即小\n"
"数点号），表示你输入完毕。这时，路过的玩家只要输入 read new 或者 read <留言\n"
"编号>  就可以查看你输入的内容了。要查看所有的留言可以输入指令 look <留言板编\n"
"号>，通常为 look board\n\n" BLINK + HIY
"    你面前就有一块 新手留言板(board)，你可以尝试一下以上指令。\n\n" NOR;

        } else
        if (topic == "73") // 短消息
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关短消息的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    本站为方便玩家间交流，克服离线后难以交流的缺点，特地开发了短消息系统，玩\n"
"家可通过输入指令 msg mail <玩家ID> 向任何一个玩家发送短消息， 不管该玩家是否\n"
"在线都能收到这条消息，是目前最普遍的交流方式。\n\n" NOR;
        } else
        if (topic == "91") // 解决温饱
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关解决温饱的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    一个人总有饥饿和口渴的时候，这时，就需要补充以下能量了，通常在各城市的客\n"
"店里能买到鸡腿和水袋等。使用指令 eat <物品ID> 可吃东西，而指令 drink <物品ID>\n"
"可以喝水等物品。\n\n"
"    在古村里，你不会饥饿或者口渴，但是一旦你出去了就需要注意了。\n\n" NOR;
        } else
        if (topic == "92") // 生病了怎么办
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关生病了怎么办的信息吧：\n"
"--------------------------------------------------------\n" HIM +
"    通常新手由于体质较差会经常生病，这时，新手可以到扬州的药铺里有各种治病的\n"
"药买，你可以根据你的病情买一些药，吃后即可恢复正常。\n\n"
"    在古村里，如果你生病可以来找我 ask lao about 治疗 。\n\n" NOR;
        } else
        if (topic == "93") // 死亡后怎么办
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关死亡后怎么办的信息吧：\n"
"---------------------------------------------------------\n" HIM +
"    在你死亡后，会到阴曹地府内，白无常会说你的阳寿未尽叫你回到阳间。然后，你\n"
"可以继续游戏。但是死亡后，你身上的物品会丢失并且会丢失一定的经验、潜能和武功。\n\n"
"    在古村里，你不用担心，你不会死亡，不过出村后一定要多加小心哦！\n\n" NOR;
        } else
        if (topic == "94") // 中毒怎么办
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关中毒怎么办的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    如果你内功等级高，你中毒后，可以先封闭穴道（输入指令 fengxue），然后尽快\n"
"解毒。解毒的方式有多种，一种是自己用内功逼毒或者找内功高的玩家帮助解毒，还有\n"
"一种是找解毒的NPC帮助解毒。具体信息可参见帮助文件 help poison\n\n"
"    如果你在古村中毒的话，可来找我解毒 ask lao about 治疗 \n\n" NOR;

        } else
        if (topic == "95") // 受伤了怎么办 
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关受伤了怎么办的信息吧：\n"
"---------------------------------------------------------\n" HIM +
"    通常，你的气血会逐渐慢慢的恢复，恢复速度跟你的根骨属性有关。如果你的内功\n"
"达到一定等级，你可以运用内功来疗伤，具体信息可参见帮助文件 help force\n\n"
"    如果你在古村受伤，你可以来找我，输入指令 ask lao about 治疗 \n\n" NOR;
        } else
        if (topic == "96") // 如何拣东西、给东西、扔东西
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关如何拣东西、给东西、扔东西的信息吧：\n"
"-----------------------------------------------------------------------\n" HIM +
"    首先，你输入指令 look 可以看到你所在地方有什么东西可拣。\n"
"    然后输入指令 get <物品ID> 可将物品拣起来，输入指令 i 可查看你身上的物品。\n\n"
"        输入指令 give <对方ID> <数量> <物品ID> 可将你身上的物品给对方。如：\n"
"                 give jack 2 man tou 可将两个馒头给jack。\n\n"
"        输入指令 drop <数量> <物品ID> 可将身上物品丢弃。\n\n" NOR;
        }
 else
        if (topic == "101") // 内功介绍
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关内功的信息吧：\n"
"-------------------------------------------------\n" HIM +
"    内功即你的武功的内在修为，如九阳神功就是一种内功。在泥潭里内功是比较重要的，\n"
"它直接影响着你的内力大小，攻击威力等诸多方面。内功主要有以下作用：\n\n" HIY +
"普通功能\n\n" HIC +
"regenerate     提振精神          recover     调匀气息\n"
"lifeheal       为人疗伤          heal        运功疗伤\n"
"dispel         疗解毒素          inspire     激励精神\n\n" HIY +
"特殊功能\n\n" HIC +
"roar           内劲伤敌          shot        弹射毒药\n"
"powerup        提升战力          shield      护体真气\n\n" NOR +
"    如你要使用疗伤功能则可使用指令 yun heal。当然，前提是你已经学会一种内功，并\n"
"且内功修为和内力修为达到一定等级。\n\n" HIY;
"    更多相关帮助请参阅帮助文件 help force\n\n" NOR;
        } else
        if (topic == "102") // 外功介绍
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关外功的信息吧：\n"
"--------------------------------------------------\n" HIM +
"    外功即你的外家功夫的修为，如剑法，拳法等，如独孤九剑和太极拳就是外功的一种。\n"
"通常战斗中用来攻击对方的都是外功，而外功施展绝招需要内功和内力的支持。\n\n" HIY +
"    有关武功说明可参见帮助文件 help skills\n\n" NOR;
        } else
        if (topic == "103") // 轻功介绍
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关轻功的信息吧：\n"
"--------------------------------------------------\n" HIM +
"    轻功影响着你的攻击命中率及闪躲回避率，如果你的轻功等级较高可以在战斗中有更\n"
"高的几率打中对方，并且当别人攻击你的时候你有更多的机会闪避。\n\n" NOR;
        } else
        if (topic == "104") // 招架介绍
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关招架的信息吧：\n"
"-------------------------------------------------\n" HIM +
"    招架很好理解，假设别人在攻击你的时候你没有成功地闪避，但是，如果你招架等级\n"
"较高仍然可以将别人的攻击化去，如别人一刀砍向你，你用手中的兵器挡住。\n\n" NOR;
        } else
        if (topic == "105") // 其他技能介绍
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关其他技能介绍的信息吧：\n"
"---------------------------------------------------------\n" HIM +
"    在泥潭中除了内功、外功、轻功、招架外还有其他许多技能，其中部分会直接影响到你\n"
"的战斗效果，如桃花岛绝学「阴阳八卦」，可以破除对手的特殊防御效果；其他部分虽然不\n"
"会对你的战斗效果有影响，但是它们却是武学提升和学习一些高级武功的先决条件，如武学\n"
"修养，很多高级的武功都会要求你的武学修养，武学修养只能通过汲取战斗中累计的实战经\n"
"验来提升。还有一些其他技能如：丹青技术、镶嵌手艺、梵文、禅宗心法等都会有相应的作\n"
"用，具体的应用，你可以在需要时参看相关的帮助文件。\n\n" NOR;
        } else
        if (topic == "106") // 使用兵器
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关使用兵器的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    兵器在泥潭中的地位非常之重要，一把好的兵器可以使你战斗力大大地提升，在泥潭中\n"
"兵器大致分为以下几类：\n\n" HIY
"    攻击类兵器：剑、刀、杖、棍、鞭、拳套、指套等\n" HIC +
"    防御类兵器：甲、衣、鞋、靴、、头盔、头饰、护腕、披风等。\n\n" HIR
"    如何装备/卸载兵器：\n\n" HIY
"    攻击类兵器都使用指令 wield <兵器ID> 装备，但是拳套，指套等空手武功兵器除外。\n"
"    攻击类兵器都使用指令 unwield <兵器ID> 卸载装备，但是拳套，指套等空手武功兵器除外。\n\n" HIC +
"    防御类兵器都使用指令 wear <兵器ID> 装备。\n" HIC +
"    防御类兵器都使用指令 remove <兵器ID> 卸载装备。\n\n" HIR
"    你可以通过查看兵器属性（look <兵器ID>）来查看该兵器如何使用。\n" HIR
"    输入指令 i 可查看你身上的物品！\n\n" NOR;

        if( !query("newbie_quest_completed/wield", me) )
        {
                msg += HIM "    现在，你将接受一个练习，根据你学到兵器使用方法，到兵器室去拿一把剑（到兵器室\n";
                msg +=     "内输入指令 get jian from 装备后来找我 " HIY "ask lao about ok" HIM " 。\n\n" NOR;
                set("newbie_quest/leixing", "wield", me);
                set("newbie_quest/quest_name", "如何装备兵器", me);
                set("newbie_quest/tar_id", "newbiejian", me);
                set("newbie_quest/point", 15, me);
                set("newbie_quest/msg", HIY"你先把兵器室里的剑拿来装上，然后在来找我。\n"NOR, me);
                me->save();
        } // endif
        } else
        if (topic == "107") // 拜师学艺
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关拜师学艺的信息吧：\n"
"-----------------------------------------------------------------------\n" HIM +
"    每个人要成长总得不断地学习，拜师是个人成长发展的必然阶段，泥潭提供了30余个门派供\n"
"大家选择，每个门派均有其特色，玩家可以选择自己喜欢的门派发展。当然，国有国法，家有家\n"
"规，既然你选择了一个门派就好好地在此发展吧，如果你想要判师，那么……，后果非常严重，\n"
"你将终身被本门派的高手追杀，一旦被杀，你所有的特殊武功将被废掉，更严重的是，即使你躲\n"
"过了本门高手的追杀，要想在江湖中容身也是非常困难的，很多门派不收判师的人，所以，你得\n"
"考虑清楚，以免后悔莫及。\n\n"
"    好了，该说说如何拜师了，首先，到你想去的门派，一开始你得从入门弟子做起，一般拜一\n"
"些武功比较低微的人物为师，就拿华山派来说，你进入华山派，首先得拜劳德诺为师，拜师的指\n"
"令是 bai <师傅ID>，等你武功等级和门派贡献提高后可以继续向上拜，比如你拜华山掌门岳不群\n"
"为师，这时你就可以学到更高级的武功技能了，如紫霞神功等，你可以用指令 cha <师傅ID>来查\n"
"看你师傅会哪些武功，使用指令 xue <师傅ID> <武功ID> <学习次数> 来学习武功。\n\n" NOR;

        if( !query("newbie_quest_completed/baishi", me) )
        {
                msg += HIM "    现在，你将接受一个练习，你到练武场去找一个叫武伯的人，然后拜他为师后再回来\n"; 
                msg +=     "找我 " HIY "ask lao about ok" HIM " 。\n\n" NOR;
                set("newbie_quest/leixing", "baishi", me);
                set("newbie_quest/quest_name", "如何拜师", me);
                set("newbie_quest/tar_id", "wuqingzi", me);
                set("newbie_quest/point", 15, me);
                set("newbie_quest/msg", HIY"你先去拜武伯为师，然后在来找我。\n"NOR, me);
                me->save();
        } // endif
        } else
        if (topic == "111") // 战斗系统介绍
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关战斗系统的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    所谓学以致用，学习了各种武功就是要在战斗中能派上用场。本游戏的战斗系统是自动战斗\n"
"类型的，也就是说一旦你和对方开始战斗，则你所扮演的角色将自动发招，直到战斗结束为止。\n"
"当然，你在战斗过程中可以灵活地控制你的角色，如施展绝招，恢复气血，运功等，从而达到克\n"
"敌制胜的效果。\n\n"
"    影响你战斗能力的有诸多因素，如你的臂力、武器攻击力、武功强弱等会影响你的攻击能力；\n"
"身法，轻功效果等会影响你的闪避和命中能力；防具等又会影响你的防护能力。如果要查看你的\n"
"战斗能力，你可以输入指令 stats/ability 来查看。不要一味地追求某一方面的强度， 综合全\n"
"面的发展才是最重要的，在泥潭里没有最强，只有更强！\n\n" NOR;
        }  else
        if (topic == "112") // 战斗前的准备
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关战斗前的准备的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    首先，你得确保你要准备好在战斗中使用什么武功，假设你要使用兵器武功，如你已经学会\n"
"了华山剑法和独孤九剑，那么战斗中你只能在同一时间使用一种武功，这里我们要做的就是确定\n"
"你要使用何种剑法，在泥潭里，选择战斗中使用的武功叫“激发”，比如我们将独孤九剑激发到\n"
"基本剑法上，然后只要装备一把剑就可以在战斗中施展独孤九剑了，指令格式为：\n\n" HIY
"    jifa sword <武功ID>，如 jifa sword lonely-sword，就是激发独孤九剑为基本剑法。\n\n" HIM
"    如果你要换使用华山剑法则只需输入 jifa sword huashan-sword 即可。\n\n" HIC
"    这时，你要问，我同样也激发了空手武功，那么该如何才能施展呢？\n\n" NOR
"    很简单，只要你取下兵器，你所施展的武功自然就是空手武功了，但是空手武功跟兵器类武\n"
"功稍稍有点不同，试想，虽然空手武功也需要激发，但是，由于空手武功包含了：拳脚、掌法、\n"
"指法、爪法等，这些在战斗中同一时间内只能施展一种，那么如何来确定我们施展何种空手技能\n"
"呢，这时，我们就需要通过“准备”来实现这个功能，即当手中无兵器时，用何种空手技能战斗。\n"
"指令如下：\n\n" HIY
"    首先，拿九阴白骨爪来说，其武功类型为空手爪法，我们先把它激发为基本爪法：\n\n"
"    jifa claw jiuyin-baiguzhao 然后，准备空手技能施展爪法，指令为：\n\n"
"    bei claw，这样就完成了空手技能的准备。现在，装上你心爱的兵器，出去闯荡江湖吧！！！\n\n" NOR;

        if( !query("newbie_quest_completed/jifa", me) )
        {
                msg += HIM "    现在，你将接受一个练习，先找武伯学会「基本剑法」和「天剑」，然后将天剑\n";                              
                msg +=     "激发为基本剑法后再来找我 " HIY "ask lao about ok" HIM " 。\n\n" NOR;
                set("newbie_quest/leixing", "jifa", me);
                set("newbie_quest/quest_name", "如何激发武功", me);
                set("newbie_quest/tar_id", "tianjian", me);
                set("newbie_quest/point", 20, me);
                set("newbie_quest/msg", HIY"你先去把天剑激发为基本剑法，然后在来找我（ask lao about ok）。\n"NOR, me);
                me->save();
        } // endif
        }  else
        if (topic == "113") // 战斗指令介绍
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关战斗指令的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    在泥潭里战斗功能是相当丰富的，现在大概介绍一些常用的功能及指令用法：\n\n" HIG
"    kill <对象ID>      :       杀人，一旦下达此指令后，双方将尽全力撕杀。\n"
"    hit <对象ID>       :       打人，通常此指令通常用于将对手打晕为止。\n"
"    fight <对象ID>     :       切磋，同对手切磋武艺，此战斗方式一般不会有什么危险。\n"
"    jiali <数值>       :       这个表示你设置用多少内力来伤敌，通常设置为max。\n"
"    halt               :       停止战斗，在下达kill指令后无法停止。\n"
"    perform <绝招ID>   :       施展绝招。\n"
"    yun <内功ID>       :       运功，如yun powerup可提高战斗力。详细地可参见帮助文件 help force。\n\n" HIM
"    以上都是战斗中最常用的指令，要想了解更多的请参见泥潭帮助文件库，输入指令 help 。\n\n";

         }  else
        if (topic == "114") // 如何施展内功
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关如何施展内功的信息吧：\n"
"-------------------------------------------------\n" HIM +
"    首先，你得将一种特殊内功，如北冥神功激发到你的基本内功上，再确保你有足够的内力。\n"
"    施展内功的指令是 yun <内功ID>，如下所示：\n\n" HIY
"普通功能\n\n" HIC
"regenerate     提振精神          recover     调匀气息\n"
"lifeheal       为人疗伤          heal        运功疗伤\n"
"dispel         疗解毒素          inspire     激励精神\n\n" HIY
"特殊功能\n\n" HIC
"roar           内劲伤敌          shot        弹射毒药\n"
"powerup        提升战力          shield      护体真气\n\n" HIM
"    如要调匀气息，则输入 yun recover 即可。\n\n" NOR;
        } else
        if (topic == "115") // 如何施展外功
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关如何施展外功的信息吧：\n"
"------------------------------------------------------\n" HIM +
"    外功，用通俗一点的说法就是你武功的绝招，比如独孤九剑有一招叫「破剑式」，要施\n"
"展该招则输入指令 perform po 即可。施展外功的命令格式为：\n\n" HIY
"    perform 绝招ID\n\n" NOR;

        if( !query("newbie_quest_completed/perform", me) )
        {
                msg += HIM "    现在，你将接受一个练习，到竹林使用天剑的绝招（perform lian）杀一只\n" NOR;
                msg += HIM "野兔（指令为 kill ye tu），然后再来找我 " HIY "ask lao about ok" HIM " 。\n\n" NOR;
                set("newbie_quest/leixing", "perform", me);
                set("newbie_quest/quest_name", "如何施展外功", me);
                set("newbie_quest/tar_id", "tianjian", me);
                set("newbie_quest/point", 30, me);
                me->set("newbie_quest/msg",HIY"你先用天剑的绝招（perform lian）到竹林杀（kill ye tu）一只野兔，然后\n"
                                                "再来找我（ask lao about ok）。\n" NOR);
                me->save();
        } // endif
        }    else
        if (topic == "121") // 查看帮助文件库
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关查看帮助文件库的信息吧：\n"
"--------------------------------------------------------\n" HIM +
"    泥潭帮助文件库中有丰富的有关这个游戏的各种帮助信息，几乎所有的信息都可以在里面\n"
"查阅到，输入指令 help 可打开帮助信息库，然后输入 help <信息代码>  可查看到具体需要\n"
"查看的信息，如需要查看华山派介绍则输入 help huashan 即可。\n\n" NOR;
        }  else
        if (topic == "122") // 玩家间的交流
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关如何玩家间的交流的信息吧：\n"
"-----------------------------------------------------------\n" HIM +
"    在泥潭里，交流是必不可少的学习途径，也是获得帮助最重要的方法之一，记住，多和\n"
"有经验的朋友交流，少走弯路，可以使你更快地成长。本站提供了丰富的交流指令，可以参\n"
"见帮助文件 help channels。\n\n"
"    虽然在线交流非常重要，但是离线交流也很重要，你可以使用 msg send <玩家ID>  指\n"
"令发送一个短信息给对方，不管对方是否在线都会收到，交流在泥潭里就是如此的简单。\n\n" NOR;
        }  else
        if (topic == "123") // 请求新手导师帮助
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关请求新手导师帮助的信息吧：\n"
"----------------------------------------------------------\n" HIM +
"    新手导师是本站为引导新人入门而聘请的有经验的玩家担当的，如果你有什么问题可以\n"
"找新手导师，和他们交谈或是发送短信息给他们都行。输入指令 who -v 可查看在线的导师。\n\n" NOR;
        }  else
        if (topic == "124") // 广播你的求教信息
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关广播你的求教信息的信息吧：\n"
"-------------------------------------------------------------\n" HIM +
"    除了与导师在线交流及短消息沟通外，一些问题你需要征求所有导师的意见以及本站管\n"
"理巫师的意见，你可以使用 teach help 指令发布你的求教信息。\n\n" NOR;
        }  else
        if (topic == "125") // 在泥潭信息库中搜索你指定的信息
        {
                msg = HIW + "\n"
"老村长对你说道：那就让我来告诉你有关在泥潭信息库中搜索你指定的信息的信息吧：\n"
"---------------------------------------------------------------------------\n" HIM +
"    虽然泥潭的帮助库文件内容非常丰富，但是也带来另外一个问题，如何快速地查找到你\n"
"需要的信息呢？我们为方便大家查找各种信息，提供了一个 grep 指令，比如你要在帮助库\n"
"中查找有关 太极拳 的信息，你可以输入 grep help 太极拳 ，这时，系统会将帮助文件库\n"
"中所有有关太极拳的帮助文件名罗列出来，供你进一步参考。\n\n" NOR;
        }
        else
        {
                msg = HIY "你问的问题我好象并没听说过，请输入指令 " HIM "ask lao about here" HIY " 查看我知道的问题。\n" NOR;
        }

        tell_object(me, msg);
        return 1;
}

// 进行帮助
/*
        n_quest = ([
             "leixing"      :   "wield",
             "quest_name"   :   "装备兵器"
             "target_id"    :   "tie jian",
             "target_name"  :   "铁剑",
             "target_place" :   "兵器室",
             "point"        :   10, // 奖励点数
             "msg"          :   "到兵器室去拿一把剑，装备（wield tie jian）后再来找我（ask lao about ok）。\n"
        ]);
*/
mixed ask_here()
{
        object me;
        mixed n_quest;
        string msg;

        me = this_player();

        n_quest=query("newbie_quest", me);

        // 检查是否是任务状态
        if (mapp(n_quest))
        {
             tell_object(me, HIR "老村长对你说道：" + n_quest["msg"] + "\n如果已经完成请输入ask lao about ok" NOR);
             return 1;
        }

        msg =  HIM "你可以在我这里了解以下信息：\n" NOR;
        msg += HIY "编号         信    息\n" NOR;
        msg += HIY "------------------------------------------\n" NOR;
        msg += HIC " 1        什么是文字MUD游戏\n"
                   " 2        简单介绍一下这个游戏的玩法\n"
                   " 3        我在游戏里能做些什么\n"
                   " 4        我自己是谁\n"
                   " 5        我在哪里\n"
                   " 6        如何移动\n"
                   " 7        如何跟其他朋友交流\n"
                   " 8        我可以扮演哪些角色\n"
                   " 9        如何生存\n"
                   "10        如何练功和使用兵器\n"
                   "11        如何战斗\n"
                   "12        如何得到更多帮助\n"
                   "13        如何离开这里到外面的世界去\n" NOR;
        msg += HIY "------------------------------------------\n" NOR;
        msg += HIR "要了解的信息可以输入指令 ask lao about <编号>\n" NOR;
        msg += HIR "如要了解 <如何移动> 的信息，则输入 ask lao about 6\n\n" NOR;
        msg += HIY "如果你是位老玩家，你也可以直接ask lao about 出村，去闯荡江湖，当然这样的话你可能会错失了某种机缘。\n" NOR;

        tell_object(me, msg);

        return 1;
}

mixed ask_chucun()
{
        object me;
        string msg;

        me = this_player();

        // 判断几个条件
        //1、是否学会了移动
        /*
        if( !query("newbie_quest_completed/move", me) )
        {
                tell_object(me, "老村长告诉你：你还没有学会如何移动呢！请 ask lao about 61\n");
                return 1;
        }        

        // 2、是否学会装备兵器
        if( !query("newbie_quest_completed/move", me) )
        {
                tell_object(me, "老村长告诉你：你还没学会如何装备兵器呢！请 ask lao about 106\n");
                return 1;
        }

        //3、是否掌握如何拜师
        if( !query("newbie_quest_completed/baishi", me) )
        {
                tell_object(me, "老村长告诉你：你还没掌握如何拜师呢！请 ask lao about 107\n");
                return 1;
        }

        //4、是否掌握如何激发武功
        if( !query("newbie_quest_completed/jifa", me) )
        {
                tell_object(me, "伯告诉你：你还没学会如何激发武功呢！请 ask lao about 112\n");
                return 1;
        }

        //5、是否掌握如何施展外功
        if( !query("newbie_quest_completed/perform", me) )
        {
                tell_object(me, "老村长告诉你：你还没掌握如何施展外功呢！请 ask lao about 115\n");
                return 1;
        }

        set("newbie_quest_completed/can_out", 1, me);
        
        msg = HIY "不错，不错，看来你已经决定出去闯荡江湖了！在你临走前，我将送你一件\n"
                  "礼物，你先把你的眼睛闭上（指令 closeeye ）吧。\n\n" NOR;
*/
        msg = HIY "不错，不错，看来你已经决定出去闯荡江湖了！那么现在选择你的江湖路：\n" NOR;
        msg+= HIR "1.快意恩仇(PK)  " NOR;
        msg+= HIC "2" NOR ".江湖隐士(NOPK) (";
        msg+= HIC "choose 1" NOR "-" HIC "2" NOR ")\n\n" NOR;

        if( !query("gift_xinshoucun", me)) tell_object(me,msg);

        else
                tell_object(me, HIY "不错，不错，看来你已经可以出去闯荡江湖了！\n\n" NOR);

        return 1;        
}

void init()
{
        object me;

        me = this_player();

        call_out("do_hello", 2, me);

        add_action("do_closeeye", "closeeye");
        add_action("do_choose", "choose");

        return;
        
}

void do_hello(object me)
{
        if (! objectp(me))return;

        if (environment(me) != environment(this_object()))return;
                
        tell_object(me, HIG "\n老村长对你说道：这位" + RANK_D->query_respect(me) +
                "，如果需要帮助请输入指令 " HIR "ask lao about here \n\n" NOR);
}

int do_choose(string arg) 
{
        object me = this_player(); 
        int n; 

        if (! arg || arg == "") 
                n = 1; 
        else 
                sscanf(arg, "%d", n); 

       if (n < 1 || n > 2) 
       { 
               write("您只能选择(choose)系统所提供的这 2 种江湖道路：\n" 
                   HIR "1.快意恩仇(PK)  " NOR 
                   HIC "2" NOR ".江湖隐士(NOPK) (" 
                   HIC "choose 1" NOR "-" HIC "2" NOR ")\n"); 
               return 1; 
       } 

       switch(n) 
       { 
       case 1: 
               write(HIR "你选择了快意恩仇的江湖路，好气魄！\n" NOR);
               break;
       case 2: 
               set("NO_PK", 1, me);
               write(HIC "你选择了江湖隐士的江湖路，好心态！\n" NOR);
               break;
        }

        set("newbie_quest_completed/can_out", 1, me);
        write(HIY"希望你能一直坚持你的选择，在你临走前，我将送你一件礼物，你先把你的眼睛闭上（指令 closeeye ）吧。\n\n" NOR);
        return 1;
}

int do_closeeye(string arg)
{
        object me;
        string msg;
        int point, myexp;
        string mapsk;
        int exp, pot, score;
        
        int can_exp = 1;

        me = this_player();

        if( !query("newbie_quest_completed/can_out", me) )
                return 0;

        myexp=query("combat_exp", me);

        if (myexp >= 3500)can_exp = 0;

        if( query("gift_xinshoucun", me) )
                return notify_fail(HIG "\n老村长说到：咦，你怎么……又来了！？\n" NOR);

        set("gift_xinshoucun", 1, me);

        msg = HIM "你闭上双目，只感觉有一只炽热的手按在你天灵盖上，一股暖暖的真气缓缓流入你的体内。\n"
                  "你凝神闭气，将真气慢慢吸收，感觉全身舒畅之极！\n\n" NOR;

        tell_object(me, msg);

        mapsk = me->query_skill_mapped("force");
        //if (me->can_improve_skill("force")) 
               me->improve_skill("force", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);

        mapsk = me->query_skill_mapped("sword");
        //if (me->can_improve_skill("sword")) 
               me->improve_skill("sword", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);

        mapsk = me->query_skill_mapped("parry");
        //if (me->can_improve_skill("parry")) 
               me->improve_skill("parry", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);

        mapsk = me->query_skill_mapped("dodge");
        //if (me->can_improve_skill("dodge")) 
               me->improve_skill("dodge", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);

        mapsk = me->query_skill_mapped("blade");
        //if (me->can_improve_skill("blade")) 
               me->improve_skill("blade", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);        

        mapsk = me->query_skill_mapped("unarmed");
        //if (me->can_improve_skill("unarmed")) 
               me->improve_skill("unarmed", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);        
               
        point = 3500 - myexp;
        if (point <= 0)point = 400 + random(400);
        exp = can_exp * point / 2 + can_exp * random(point / 2);
        pot = point / 3 + random(point / 2);
        score = 120 + random(100);

        addn("combat_exp", exp, me);
        addn("potential", pot, me);
        addn("max_neili", 200, me);
        addn("max_jingli", 200, me);
        addn("max_jing", 200, me);
        addn("max_qi", 300, me);
        addn("score", score, me);

        msg  = HIY "\n你得到了" + chinese_number(exp) + "点实战经验、" + chinese_number(pot) + "点潜能，" + 
                   chinese_number(score) + "点江湖阅历，并且\n你的内力修为、气血、精力都有了提高！\n\n" NOR;

        me->save();

        msg+= HIG "老村长说道：你现在到村口（walk 村口）找花伯（指令 ask hua about 出村）吧，他会告诉你怎么出古村！\n";
        msg+= HIC "老村长嘱咐道：以后行走江湖你就得多加小心了！切记，凡事需忍让，不可与人多起争端！\n\n" NOR;
        
        tell_object(me, msg);

        return 1;
}
