#include <ansi.h>
int give_gift();
mixed *story = 
({
        "且说泥潭准备召开迎新大会，专门指派能歌善舞的精意山庄负责",
        "重头演出事宜，狂风接到标有"HIR"“王者归来文化教育部礼仪司”"NOR+WHT,
        "的红头文件，立刻紧张起来，虽然精意山庄现成的剧本不少，且",
        "一应俱全，《阳春白雪》与《泰坦尼克》齐飞，《阿甘正传》共",
        "《脱衣舞娘》一色。但是都已经被看的不胜其烦，没有新意了。",
        "蓝芷萍急得在房子里走来走去，把毛巾往脑袋上缠出一个大球，作",
        "“绞尽脑汁”状，但还是没有一点主意。",
        "缪斯看了不忍，于是对维纳斯说：“你看那个人，虽然是笨了点，",
        "不过还是很用心的嘛！还是我们舞蹈艺术的积极分子嘛，是值得培",
        "养的优秀人才，是伟大的艺术事业的接班人嘛……",
        "？？？维纳斯一脸疑惑的看着缪斯。",
        "“所以我认为，为了把他们的这次演出搞好，我们应该帮帮忙才对。",
        "你不是想把我们的舞蹈秘籍《七宝天岚舞》送给她们吧？",
        "“是啊！”",
        "“需要吗？”",
        "“不需要吗？”",
        "“需要吗？”",
        "“不需要吗？”",
        "………………",
        "于是一个要给，一个不给，两个人开始争抢，一不小心，书掉下去了。",
        (: give_gift :),
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/task/story/stormdance_book", 1,
                  HIM "\n一本装潢华美的"NOR+YEL"《七宝天岚舞》"HIM"掉了下来，你\n"
                           "耳边感受到一阵呼呼的风声。\n\n" NOR);
        return 0;
}
