#include <ansi.h>
int give_gift();
mixed *story = 
({
        "某天，茅山练功场。",
        "南贤正在参详《降魔道法》之《遁甲天书》，刚好看到《地遁》一节。",
        "看后自言自语：“实践是检验真理的唯一标准，恩，我得尝试一下才行。",
        "于是南贤开始念起《地遁》，口中念念有词，身体慢慢虚化……",
        "只觉一阵金光扑面，耳边呼呼作响，发觉自己早已穿山越岭，飘飘然有",
        "些天人合一的感觉。",
        "如此这般遁了半天，终于累了，想起回茅山休息，总觉得少了点什么，",
        (: give_gift :),
        "但是玩的太开心了，一时想不起来，于是想：“管他呢，先睡觉再说。”",
        "一觉醒来，又想起玩先前的游戏，但是突然把咒语忘记了，找来找去，",
        "终于发现原来是《降魔道法》不见了……",
        "南贤对着空气忿忿地踢了一脚。",
        "凌云匾上立刻多了一张告示：“由于本人贪玩，不慎在穿山越岭时丢失",
        "《降魔道法》一本，有拾到者请迅速交还。感激不尽。”",
        "“拜托啦，没书玩，这两天可闷的慌啊……”",
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/task/story/xmdaofa", 1,
                           HIM "\n你忽然觉得脚底一阵翻动，低头一看，地里冒出一本"HIG"《降魔道法》"HIM"！\n\n" NOR);
        return 1;
}
