#include <room.h> 
inherit WAREHOUSE;

void create()
{
        set("short", "北京城商栈");
        set("long", @LONG
这里就是著名的北京城商栈，北京城买卖商品的集散地，也是富
商大贾云集之所，由北京城商会控制。在北京城大宗商品的买卖都要
通过这里进行。门口挂着一块木牌(sign)。
LONG );

        set("item_desc",([
        "sign" : "
list                    查看当地各种商品的价格。
shou <数量> 商品        收购一定数量的商品。
pao <数量> 商品         在本地抛售一定数量的商品。
fasong                  将你在本地的货物发往其它的地点。
\n",
]));

        set("exits",([
        "south" : __DIR__"majiu",
]));

        // 初始货物数量
        set("all_wares",([
        "rice" :   175000,     //1
        "wheat" :  175000,    //2
        "corn" :   175000,     //3
        "ganzhe" : 175000,   //4
        "goober" : 175000,   //5
        "silk" :    35000,     //6
        "cloth" :  175000,    //7
        "zxiu" :    35000,     //8
        "iron" :   175000,     //9
        "tong" :   175000,     //10
        "diamand" : 35000,  //11
        "suis" :   175000,     //12
        "gold" :    17500,      //13
        "silver" : 175000,   //14  本地
        "picture" : 17500,   //15  
        "jxiu" :     3500,      //16  需要
        "book" :    17500,      //17
        "vase" :    17500,      //18
        "harm" :   175000,     //19
        "guiy" :    35000,     //20
        "meat" :   175000,     //21
        "fish" :   315000,     //22  本地
        "orange" : 175000,   //23
        "tea" :    175000,      //24
        "yye" :    175000,      //25
        "shen" :    17500,      //26
        "deer" :    17500,      //27
        "sdan" :     3500,      //28  需要
        "bamboo" :      0,       //29  需要
        "pei" :     17500,       //30
        "hairpin" : 17500,   //31
        "qilin" :   17500,     //32  
        "guan" :    17500,      //33  
        "ddai" :    17500,      //34
        "mxia" :    17500,      //35
        "jade" :    17500,      //36
        "pearl" :   17500,     //37
        "bonsai" :  17500,    //38
        "spear" :  175000,    //39
        "sword" :  175000,    //40
        "blade" :  175000,    //41
        "shield" : 280000,   //42
        "jian" :   280000,     //43
        "armor" :  175000,    //44
        "wood" :   175000,     //45
        "stone" :  280000,    //46
        "cansi" :   35000,    //47  
        "cotton" : 280000,   //48
        "salt" :   280000,     //49 
        "paper" :   35000,    //50
]));

        // 各类商品的价格指数
        set("kind_rate",([
        "silver" : 86,     //14  本地
        "jxiu" : 103,      //16  需要
        "fish" : 73,       //22  本地
        "sdan" : 124,      //28  需要
        "bamboo" : 126,    //29  需要
]));
 
	set("coor/x", -2850);
	set("coor/y", 7690);
	set("coor/z", 0);
	setup();
}