#include <ansi.h>
inherit ROOM;
string *long_desc = ({
"点苍山云弄、沧浪峰。此两峰相连，险峻峥嵘。峰上云雾环绕，有
如仙境。山峰间夹一条山溪，名“霞移”，溪水清碧，涓涓流淌。\n",

"点苍山五台、莲花峰。此两峰相连，险峻峥嵘。峰上怪石林立，且
又各具形态。山峰间一条山溪，名曰“万花”，溪水清碧，涓涓流淌。\n",

"点苍山沧浪、五台峰。此两峰一高一矮，相依成景。峰上林木繁多，
雾气翻腾，宛如沧海。山峰间一瀑飞落，乃是“阳溪”，其水甘甜如泉却
又冷似冰雪。\n",

"点苍山莲花、白云峰。此两峰峰势不雄，但却秀丽无比。峰上花木
成林，红绿相间，一片春色。山峰间“茫涌”溪水色如碧玉，随着山势缓
缓流淌。\n",

"点苍山白云、鹤云峰。白云低而鹤云高，远远望去，有如一只仙鹤
矗立于茫茫云海之中。“锦溪”从峰间流过，载起飞花、落叶，宛如一根
凌空飞舞的彩云丝带。\n",

"点苍山鹤云、三阳峰。一峰高耸有如仙鹤，一峰壮阔有如海涛。溪
水流过，形似灵蛇，盘旋于两峰之间，不急不缓，正是“灵泉”名渠。\n",
});
void create()
{
        string msg = long_desc[random(sizeof(long_desc))];
        set("short", GRN"点苍十九峰"NOR);
        set("long", msg);
        set("resource/water", 1);
        set("outdoors", "dali");

        set("exits", ([
                "north" : __DIR__"ylf1",
            "southdown" : __DIR__"dc2",              
        ]));

        set("coor/x",-350);
  set("coor/y",-410);
   set("coor/z",20);
   setup();
}