// /adm/daemons/banned_named.c

string *banned_name = ({    // 禁止出现在人名的任何部分
// 巫师的名字
    "叮当", "阿兰", "阿飞",

// 系统保留字
    "巫师", "天神", "女巫", "某人",

// 名人的名字
    "毛泽东", "邓小平", "江泽民", "胡锦涛", "朱镕基", "钱其琛",
    "李瑞环", "胡耀邦", "赵紫阳", "温家宝",
    "金庸", "查良镛",

// 脏话以及敏感字眼
    "日你", "操你", "干你", "日死", "操死", "干死", "狗日",
    "我日", "我操", "我干", "鸡巴", "肛门", "性交", "畜生",
    "强奸", "肛交", "法轮功", "插死", "狗娘", "杂种", "自慰",
    "鸡奸", "淫荡", "母狗", "祖宗十八", "妈的个逼", "妈的逼",
    "妈个逼", "妈逼", "逼养的", "小逼", "骚货", "你妈生",
    "阴道", "阴户", "阴蒂", "阴茎", "龟头", "卵蛋", "睾丸",
    "狗娘", "乌龟王八", "傻逼", "轮奸",
    "妓", "娼", "尻", "婊", "屄", "肏", "屌", "屁", "鸡",
    "性", "淫", "嫖", "奸", "妓", "爷", "奶",
    "父", "母", "叔", "舅", "爸", "妈", "爹", "娘",
    "老婆", "丈夫", "老公", "妻子", "姘头",
    "赤佬", "瘪三", "傻逼", "蠢蛋", "阉割", "阉人", "裸体", "婊子",
    "统一", "法轮", "吃人", "革命", "反动", "台独", "黑客", "骇客",
    "废物", "低能", "垃圾", "变态", "混蛋", "浑蛋", "白痴", "弱智",
    "国民", "共产", "社会", "自由", "民主", "主义", "人民", "中央",
    "打倒", "反对", "反动", "攻击", "占领", "消灭", "攻陷", "抢劫",
    "称霸", "广告", "色情", "侮辱", "辱骂", "骂人", "大便",
});

string *novel_name = ({        // 禁止和人名完全匹配

// 次系统保留字
    "孙中山", "孙文", "蒋介石", "林彪", "江青", "朱德",
    "罗荣桓", "陶铸", "刘伯承", "陈毅", "贺龙", "彭德怀",
    "叶剑英", "毛岸英", "李大钊", "陈独秀", "叶群", "罗干",
    "列宁", "斯大林", "马克思", "恩格斯",
    "陈水扁", "李登辉", "连战", "李洪志",

// 通用名字 及 通用称谓
    "将军", "副将", "参将", "牙将", "武将", "官兵", "兵丁", "士兵",
    "捕头", "巡捕", "快捕", "铁捕", "捕快", "衙役", "差役", "官差",
    "太监", "公公", "宦官", "宫女", "侍女", "随从", "亲随", "伙计",

    "土匪", "强盗", "大盗", "劫匪", "恶霸", "恶棍", "叛徒", "流氓",
    "小土匪", "土匪头目", "土匪大头目", "山贼", "小山贼", "倭寇",
    "倭寇头目", "倭寇大头目", "流氓头",

    "艺人", "小二", "跑堂", "穷汉", "乞丐", "杂役", "工头", "流浪汉",
    "脚夫", "车夫", "挑夫", "马夫", "轿夫", "渔夫", "民夫", "牧人",
    "庄家", "管家", "店家", "船家", "梢公", "老板", "掌柜", "商人",
    "铁匠", "匠人", "工匠", "裁缝", "农夫", "医生", "药师", "采药人",
    "船夫", "老船夫", "渔翁", "樵夫", "门卫", "仕卫", "侍卫", "小贩",

    "豪客", "侠客", "刀客", "剑客", "游客", "赌客", "刺客", "旅客",
    "拳师", "武师", "镖师", "保镖", "打手", "护院", "教头", "趟子手",
    "忍者", "武士", "杀手",

    "老爷", "夫人", "少爷", "公子", "相公", "书生", "小姐", "太太",
    "丫鬟", "家丁", "仆人", "下人", "小童", "哑仆", "书僮", "使女",
    "女人", "女子", "女的", "女孩", "妇人", "姑娘", "丫头", "小孩",
    "男人", "男子", "男的", "男孩", "孩子", "小伙", "小子", "孩童",
    "老翁", "老头", "老者", "老人", "青年", "中年", "壮年", "后生",

    "和尚", "尼姑", "喇嘛", "道士", "沙弥", "上人", "僧人", "行者",
    "禅师", "师太", "尊者", "罗汉", "大师", "比丘", "道长", "道人",
    "师傅", "师父", "师兄", "师弟", "师姐", "师妹", "师叔", "弟子",
    "小喇嘛", "小沙弥", "小乞丐", "老乞丐", "乞丐", "道童",

    "教主", "寨主", "帮主", "舵主", "洞主", "堂主", "门主", "岛主",
    "坛主", "掌门", "方丈", "主持", "护法", "龙头", "长老", "大哥",
    "帮众", "教众", "教徒",

// 动物
    "毒蛇", "黑冠巨蟒", "蟒蛇", "金环蛇", "竹叶青蛇", "眼镜蛇",
    "蝮蛇", "菜花蛇", "小毛驴", "公鸡", "大狼狗", "野鸡", "野猪",
    "野兔", "鲨鱼", "噬人鱼", "猴子", "老鼠", "玉蜂", "白兔",
    "狼", "蜜蜂", "小蜜蜂", "乌鸦",
    "黄骠马", "伊犁马", "乌骓马", "铁甲马",
    "乌云盖雪", "墨蹄玉兔", "汗血宝马",

// 金庸原著小说人物
    // A
    "鳌拜", "敖彪",
    "安健刚", "安提督", "安奉日", "安大娘", "安剑清", "安小慧",
    "阿济赤", "阿尔尼", "阿凡提", "阿里", "阿曼", "阿大", "阿二", "阿三",
    "阿紫", "阿朱", "阿珂", "阿秀", "阿九", "阿碧", "阿洪", "阿胜", "阿根",

    // B
    "巴泰", "巴天石", "巴郎星", "巴颜法师",
    "白自在", "白万剑", "白龟寿", "白振", "白世镜", "白寒松", "白寒枫",
    "白阿绣", "白脸人", "白二", "白熊",
    "贝锦仪", "贝海石", "贝人龙",
    "本相", "本观", "本因", "本参",
    "包不同", "包不靓", "包万叶", "包惜弱",
    "鲍千灵", "鲍大楚", "鲍承先",
    "宝树", "宝象",
    "卜泰", "卜垣", "卜沉",
    "博尔术", "博尔忽", "拨速台", "波罗星", "不戒", "班淑娴", "笔贴式",
    "百草仙",

    // C
    "迟玄", "迟百城",
    "陈家洛", "陈世倌", "陈近南", "陈玄风", "陈达海", "陈正德", "陈珂",
    "陈孤雁", "陈圆圆", "陈高波", "陈歪嘴", "陈大方", "陈老丐", "陈禹",
    "陈冲之", "陈友谅", "陈七",
    "程英", "程灵素", "程嘲风", "程清霜", "程青霜", "程瑶迦", "程维藩",
    "程瑛", "程青竹",
    "成昆", "成不忧", "成自学", "成高", "成吉思汗", "成璜",
    "常伯志", "常赫志", "常敬之", "常金鹏", "常长风", "常遇春",
    "崔希敏", "崔志方", "崔百泉", "崔百胜", "崔绿华", "崔瞎子", "崔秋山",
    "蔡子峰", "蔡邑", "蔡威", "蔡德忠",
    "曹云奇", "曹猛", "曹能", "曹司朋", "曹化淳",
    "察合台", "察尔珠",
    "澄光", "澄通", "澄观", "澄心", "澄识",
    "出尘子", "采花子", "长青子", "冲虚", "丛不弃", "侍剑", "岑其斯",
    "赤老温", "车尔库", "昌齐",

    // D
    "狄修", "狄云",
    "杜百当", "杜希孟", "杜立德",
    "丁春秋", "丁敏君", "丁坚", "丁典", "丁当", "丁大全", "丁游",
    "丁不三", "丁不四", "丁珰", "丁勉", "丁同", "丁敏尹",
    "邓百川", "邓炳春", "邓八公", "邓愈",
    "段延庆", "段正淳", "段正明", "段誉", "段天德", "段智兴",
    "多隆", "多尔衮",
    "大痴", "大癫", "大苦", "大悲", "大头鬼",
    "渡厄", "渡劫", "渡难", "定闲", "定逸", "定静",
    "达摩", "达尔巴", "德布", "德鄂", "德成",
    "独孤求败", "黛绮丝", "丹青生", "刀白凤", "戴永明", "洞玄", "董开山",
    "东方不败", "端木元", "都史", "对喀纳", "吊死鬼", "点苍渔隐", "都大锦",

    // E
    "鄂尔多",

    // F
    "范百龄", "范遥", "范松", "范骅", "范禹", "范中恩", "范一飞",
    "范文程",
    "方大洪", "方怡", "方生", "方证", "方人智", "方有德", "方东白",
    "方天劳", "方腊", "方评",
    "风清扬", "风万里", "风波恶", "风良", "风际中", "风陵师太",
    "凤南天", "凤一鸣", "凤七",
    "冯阿三", "冯锡范", "冯默风", "冯衡", "冯振武", "冯同知", "冯辉",
    "冯难敌", "冯不摧", "冯不破", "冯坦",
    "费彬", "费要多罗",
    "樊纲", "樊一翁",
    "封不平", "封弓影", "封万里",
    "傅思归", "符敏仪", "浮尘子", "福康安", "富春",

    // G
    "郭啸天", "郭靖", "郭襄", "郭芙", "郭破虏", "郭玉堂",
    "高根明", "高山王", "高则成", "高升泰", "高里津", "高彦超", "高克新",
    "高三娘子",
    "归辛树", "归二娘", "归钟",
    "公孙止", "公孙绿萼", "公冶乾",
    "古笃诚", "古松子", "古般若",
    "关安基", "关夫子", "关明梅",
    "耿万钟", "耿天霜",
    "葛光佩", "葛尔丹", "葛通",
    "顾炎武", "顾金标",
    "过三拳", "过彦之",
    "盖一鸣", "盖运聪",
    "龚光杰", "孤鸿子", "苟读", "甘宝宝", "干光豪", "狗肉头陀", "刚相", "宫九佳",

    // H
    "黑白子", "黑熊",
    "哈大霸", "哈合台",
    "何足道", "何太冲", "何铁手", "何惕守", "何红药", "何沅君", "何思豪",
    "何望海", "何三七",
    "和里布", "和珅", "和尔大",
    "韩宝驹", "韩小莹", "韩文冲", "韩春霖", "韩无垢", "韩老丐", "韩千叶",
    "韩林儿",
    "胡斐", "胡一刀", "胡青牛", "胡逸之", "胡德第", "胡大哥", "胡青羊",
    "胡桂南", "胡老三",
    "呼音克", "呼巴音",
    "忽必烈", "忽伦大虎", "忽伦二虎", "忽伦三虎", "忽伦四虎", "忽都虎",
    "黄裳", "黄药师", "黄蓉", "黄伯流", "黄钟公", "黄希节", "黄国柏",
    "黄甫", "黄金魁", "黄眉", "黄宗羲", "黄真", "黄二毛子", "黄须人",
    "霍都", "霍青桐", "霍元龙", "霍阿伊",
    "洪七公", "洪凌波", "洪安通", "洪人雄", "洪哮天", "洪朝", "洪胜海",
    "侯人英", "侯君集", "侯通海", "侯飞文",
    "花万紫", "花剑影", "花铁干", "花云",
    "海大富", "海兰弼",
    "郝大通", "郝密",
    "华赫艮", "华辉", "华筝", "华伯斯基",
    "慧方", "慧观", "慧净", "慧真", "红叶", "红娘子", "辉月使", "皇太极",
    "赫大通", "赫连铁树", "鹤笔翁", "罕贴摩", "皇甫阁", "呼延万善", "贺老三",

    // J
    "姬清玄", "姬晓峰",
    "金轮法王", "金花婆婆",
    "蒋四根", "蒋涛", "蒋调侯", "蒋天寿", "蒋士铨",
    "纪晓芙", "计老人", "计无施",
    "姜小铁", "姜铁山", "姜师叔", "姜文",
    "贾老六", "贾布", "贾人达",
    "鞠文泰", "鞠智盛",
    "菊友", "菊剑", "菊芳",
    "焦文期", "焦木", "焦公礼", "焦宛儿",
    "简捷", "江百胜", "杰书", "建宁公主", "吉人通",
    "静虚", "静玄", "静空", "静照", "静迦", "静慧",
    "觉远", "觉月", "净清", "净济", "静智", "建除", "鸠摩智", "九难", "九死生",

    // K
    "康熙", "康广陵",
    "柯镇恶", "柯万钧",
    "空见", "空闻", "空智", "空性", "空相",
    "邝天雄", "邝宝官",
    "凯别兴", "喀丝丽", "枯容", "枯木",

    // L
    "李文秀", "李四", "李莫愁", "李秋水", "李延庆", "李沅芷", "李傀儡",
    "李万山", "李三", "李志常", "李天垣", "李自成", "李可秀", "李春来",
    "李廷豹", "李萍", "李西华", "李式开", "李力世", "李大元", "李四摧",
    "李天恒", "李岩",
    "林远图", "林镇南", "林平之", "林玉龙", "林朝英", "林兴珠", "林永超", "林刚",
    "梁子翁", "梁发", "梁自进",
    "刘处玄", "刘正风", "刘培生", "刘竹庄", "刘鹤真", "刘之余", "刘元鹤",
    "刘乘风", "刘瑛姑", "刘一舟", "刘芳亮", "刘宗敏", "刘於义", "刘菁",
    "刘敖", "刘芹",
    "吕文德", "吕留良", "吕四娘", "吕小妹", "吕葆中", "吕毅中", "吕正平",
    "吕七",
    "陆大有", "陆菲青", "陆万通", "陆乘风", "陆展元", "陆立鼎", "陆柏",
    "陆无双", "陆二娘", "陆冠英", "陆天抒", "陆高轩",
    "凌退思", "凌霜华",
    "蓝凤凰", "蓝天和", "蓝秦", "兰剑", "蓝天野",
    "鲁有脚", "鲁坤", "鲁连荣",
    "鹿清笃", "鹿杖客",
    "柳大洪", "柳燕",
    "老不死", "老头子",
    "罗信", "罗人杰", "罗大千", "罗立如",
    "雷猛", "雷一啸",
    "令狐冲", "黎刚", "黎生", "龙骏", "龙德邻", "灵智上人", "龙岛主",
    "绿竹翁", "骆冰", "冷谦", "劳德诺", "卢一峰", "廖自砺",
    "流云使", "来福儿", "灵虚",

    // M
    "马大鸣", "马钰", "马俱为", "马法通", "马家骏", "马善均", "马佑",
    "马敬侠", "马真", "马大元", "马行空", "马春花", "马五德", "马宝",
    "马博仁", "马喇", "马超兴", "马光佐", "马大挺", "马青雄", "马齐",
    "莫声谷", "莫大", "莫大先生",
    "苗人凤", "苗若兰",
    "梅剑和", "梅超风", "梅良鸣", "梅念笙", "梅剑", "梅文馨", "梅芳姑",
    "慕容博", "慕容复", "慕容景岳", "慕天颜",
    "木婉清", "木卓伦", "木文察", "木华黎", "木高峰", "木岛主", "木桑",
    "沐剑屏", "沐剑声",
    "穆贵妃", "穆念慈", "穆人清",
    "孟健雄", "孟师叔", "孟正鸿", "孟伯飞", "孟铸", "孟铮",
    "米为义", "米思翰", "米横野",
    "闵子华", "闵柔",
    "灭绝", "毛东珠", "茅十八", "明珠", "明月", "玛米尔", "蒙哥",
    "麦鲸", "妙风使", "梦姑", "摩诃巴思", "灭绝师太",
});

string *novel_name1 = ({
    // N
    "南希仁", "南怀仁", "南仁通", "南兰", "南海鳄神",
    "倪不大", "倪不小", "倪浩",
    "宁中则", "宁完我", "努儿海", "聂钺", "尼摩星",

    // O
    "欧阳峰", "欧阳克", "欧阳公政", "欧阳牧之", "欧治子",

    // P
    "平一指", "平旺先", "平阿四", "平婆婆", "平威", "平四",
    "彭有净", "彭莹玉", "彭连虎", "彭三春",
    "胖头陀", "皮清云", "潘天耕", "潘秀达",

    // Q
    "戚长发", "戚芳",
    "齐自勉", "齐伯涛", "齐元凯", "齐洛诺夫", "齐云", "齐云敖",
    "祁清彪", "祁六三", "祁志诚", "祁天彪",
    "乔三槐", "乔峰", "乔福",
    "裘千仞", "裘千丈", "裘千尺",
    "曲灵风", "曲非烟", "曲洋", "曲三",
    "秦红棉", "秦耐之", "秦锦", "秦娟", "秦伟邦", "秦老五", "秦栋",
    "钱老本", "钱青健", "钱正伦", "钱二败", "钱通四",
    "全冠清", "全金发",
    "乾隆", "丘处机", "邱山风", "樵子", "仇松年", "晴画", "泉建男",
    "青灵子", "清风", "清虚",

    // R
    "任我行", "任盈盈", "任飞燕", "任通武",
    "阮星竹", "阮士忠",
    "瑞婆婆", "瑞大林", "瑞芳", "瑞栋",
    "容子矩", "荣彩", "蕊初", "人厨子", "若克琳",

    // S
    "施令威", "施戴子", "施琅",
    "司徒雷", "司徒鹤", "司徒横", "司徒伯雷", "司徒千钟",
    "司空玄", "司马林", "司马大",
    "石清", "石破天", "石中玉", "石双英", "石嫂", "石清露", "石万嗔", "石骏",
    "史伯威", "史仲猛", "史孟捷", "史叔刚", "史季强", "史小翠", "史亿刀",
    "史仲俊", "史青山", "史登达", "史火龙", "史孟龙", "史红石", "史松",
    "史秉文", "史秉光",
    "沙通天", "沙天江", "沙老大", "沙广天",
    "苏荃", "苏星河", "苏万虹", "苏鲁克", "苏普", "苏习之", "苏菲亚",
    "苏冈", "苏梦清", "苏毅",
    "舒化龙", "舒奇",
    "宋远桥", "宋青书", "宋善朋", "宋天保", "宋德方", "宋五", "宋献策",
    "孙不二", "孙仲君", "孙克通", "孙刚峰", "孙伏虎", "孙均", "孙思克",
    "孙大善", "孙老三", "孙万年", "孙三毁", "孙仲寿", "孙仲尹",
    "邵燕", "邵鹤",
    "商老太", "商宝震",
    "单伯山", "单仲山", "单叔山", "单季山", "单小山", "单正", "单铁生",
    "桑三娘", "桑斯儿", "桑飞虹", "桑土公", "桑昆", "桑结", "桑拉巴",
    "上官云", "上官虹", "上官剑南", "上官毅山", "上官", "上官铁生",
    "水笙", "水福", "水岱", "水鉴", "水云",
    "申志凡", "申人俊",
    "沈城", "沈德潜", "沈青刚",
    "双儿", "说不得", "泗水渔隐", "术赤", "室里", "索额图", "瘦头陀", "萨多",
    "傻姑", "寿南山", "狮吼子", "时万年", "神山", "神音", "蛇皮张", "丧门鬼",
    "侍剑", "侍刀", "侍杖", "侍枪", "侍斧", "侍叉", "侍鞭",

    // T
    "谭公", "谭婆", "谭处端", "谭青", "谭迪人", "覃天丞", "谭文理",
    "田归农", "田伯光", "田青文", "田见秀",
    "天狼子", "天门", "天松", "天柏", "天乙", "天镜", "天虹", "天山童姥",
    "天竺僧", "天虚", "天鸣",
    "唐文亮", "唐光雄", "唐洋", "唐六爷",
    "童百熊", "童怀道", "童兆和", "童大海", "佟国纲",
    "陶子安", "陶百岁", "陶红英", "陶钧",
    "桃干仙", "桃根仙", "桃花仙", "桃实仙", "桃叶仙", "桃枝仙", "桃红",
    "汤沛", "汤祖德", "汤若望", "汤和",
    "拖雷", "铁木真", "秃笔翁", "图海道", "图尔布青", "腾一雷", "讨债鬼", "太虚子",

    // W
    "王重阳", "王处一", "王夫人", "王难姑", "王语嫣", "王十三", "王潭",
    "王剑英", "王剑杰", "王仲萍", "王武通", "王进宝", "王志坦", "王罕",
    "王伯奋", "王家驹", "王家骏", "王元霸", "王仲强", "王维扬", "王诚",
    "王惟忠", "王老六", "王万仞", "王八衰", "王保保", "王琪", "王道",
    "汪万翼", "汪浩天", "汪剑通", "汪铁鹗", "汪啸风",
    "温南扬", "温方达", "温方山", "温方悟", "温方施", "温方义", "温仪",
    "温青青", "温有方", "温有道", "温仁厚", "温正", "温青",
    "吴领军", "吴光胜", "吴长风", "吴六奇", "吴三桂", "吴应熊", "吴坎",
    "吴之荣", "吴大鹏", "吴青烈", "吴立身", "吴宝宇", "吴柏英", "吴祯",
    "吴国栋", "吴道通", "吴天德", "吴劲草", "吴良", "吴平",
    "无崖子", "无青子", "无尘", "无色", "无相", "无常鬼",
    "武眠风", "武三通", "武敦儒", "武修文", "武铭夫", "武三娘", "武青缨",
    "武天风", "武烈",
    "文醉翁", "文泰来",
    "闻万夫", "闻苍松",
    "韦小宝", "韦一笑", "韦春花",
    "卫春华", "卫璧", "卫周祚", "卫天望", "卫四娘",
    "万震山", "万圭", "万大平", "万庆澜", "万里风",
    "完颜萍", "完颜洪烈", "完颜洪熙", "完颜阿骨打",
    "窝阔台", "瓦耳拉齐", "乌老大",    "乌旺阿普", "五符", "五姑",

    // X
    "西门观止", "西华子",
    "萧峰", "萧中慧", "萧半和", "萧远山",
    "薛鹊", "薛慕华", "薛公远", "薛烛",
    "小龙女", "小凤", "小昭", "小翠", "小桂子", "小玄子", "小菊",
    "小棒头", "小翠", "小虹", "小玲",
    "谢烟客", "谢逊", "谢不当",
    "解风", "解文豹",
    "夏雪宜", "夏青青", "夏国相", "夏胄",
    "徐天宏", "徐潮生", "徐铮", "徐达", "徐小舍", "徐天川",
    "许雪亭", "许卓诚",
    "辛双清", "辛然", "辛国梁", "心砚", "心溪",
    "向问天", "向大年", "项易天",
    "玄慈", "玄痛", "玄悲", "玄寂", "玄苦", "玄难", "玄生", "玄澄", "玄惭",
    "潇湘子", "逍遥子", "血滴子", "血刀老祖", "鲜于通", "虚竹", "西宝",
    "玄烨", "熊元献", "行痴", "行颠",

    // Y
    "杨过", "杨康", "杨铁心", "杨成协", "杨莲亭", "杨不悔", "杨光",
    "杨逍", "杨宾", "杨溢之", "杨景亭", "杨鹏举", "杨中慧",
    "游驹", "游骥", "游坦之", "游迅", "游讯",
    "殷梨亭", "殷天正", "殷野王", "殷素素", "殷螭", "殷仲翔", "殷吉", "殷锦",
    "殷无禄", "殷无福", "殷无寿",
    "袁崇焕", "袁承志", "袁冠南", "袁紫衣", "袁士霄", "袁枚",
    "元伤", "元痛", "元悲", "元义方", "元澄", "元广波",
    "岳不群", "岳灵珊", "岳老三", "岳肃",
    "余沧海", "余人彦", "余鱼同", "余洪兴", "余嫂", "余婆婆", "余兆兴",
    "于人豪", "于万亭", "于光豪", "于八", "于嫂",
    "俞莲舟", "俞岱岩", "俞朝奉",
    "玉音子", "玉矶子", "玉玑子", "玉磐子", "玉磬子", "玉钟子", "玉林",
    "玉如意", "玉真子", "玉灵", "郁光标",
    "易大彪", "易三娘", "易吉", "易国梓",
    "尹志平", "尹克西", "尹章垓",
    "姚伯当", "姚春", "姚必达", "姚清泉",
    "云中鹤", "云岛主", "云素梅", "云鹤",
    "叶长青", "叶二娘",
    "耶律燕", "耶律洪基", "耶律莫哥", "耶律涅鲁古", "耶律重元", "耶律楚材",
    "耶律晋", "耶律齐",
    "英白罗", "英颚", "瑛姑",
    "缘根", "圆真", "圆音", "圆业", "圆心",
    "仪琳", "仪清", "仪和", "仪质", "仪灵", "仪光", "仪净", "仪真", "仪文",
    "言伯乾", "言达平",
    "阎世章", "阎世魁", "阎基",
    "颜垣", "延万善", "严三星", "义生", "应松", "一灯大师",
    "雍正", "一灯", "乐厚", "幽草", "阳顶天", "尤得胜", "尉迟连", "银叶先生",

    // Z
    "张三丰", "张君宝", "张翠山", "张松溪", "张三", "张无忌", "张阿生",
    "张乘风", "张乘云", "张万风", "张全祥", "张中", "张浩天", "张飞雄",
    "张十五", "张淡月", "张康年", "张金鏊", "张九", "张安官", "张志光",
    "张召重", "张一氓", "张二叔", "张朝唐", "张信", "张春九", "张若谷",
    "张勇", "张康",
    "章老三", "章进",
    "周伯通", "周芷若", "周威信", "周颠", "周绮", "周仲英", "周隆",
    "周铁鹤", "周云阳", "周孤桐", "周桐", "周圻", "周子旺", "周阿三",
    "周英杰", "周五输", "周牧",
    "卓不凡", "卓天雄",
    "左冷禅", "左全", "左子穆",
    "诸万春", "诸万里", "诸保昆", "褚圆", "褚轰", "褚万里", "褚万春",
    "褚红柏",
    "朱丹臣", "朱子柳", "朱祖荫", "朱九真", "朱长龄", "朱聪", "朱元璋",
    "朱安国",
    "祖大寿", "祖千秋",
    "曾铁鸥", "曾阿牛", "曾柔", "曾图南",
    "郑三娘", "郑成功", "郑克爽", "郑萼", "郑板桥", "郑光芝", "郑七灭",
    "郑起云",
    "赵半山", "赵敏", "赵志敬", "赵钱孙", "赵洵", "赵斐", "赵鹤",
    "赵齐贤", "赵良栋", "赵一伤", "赵城之",
    "庄有恭", "庄铮", "庄廷垅", "庄允城",
    "宗维侠", "宗雄", "宗赞王子",
    "钟兆文", "钟兆英", "钟兆能", "钟四嫂", "钟小二", "钟万仇", "钟灵",
    "钟阿四", "钟志灵", "钟镇",
    "智光", "摘星子", "詹春", "止清", "查继佐", "震山子", "子聪", "照虚",
    "哲别", "哲罗星", "者勒米", "札木合", "蛛儿", "兆惠", "竹剑", "展飞",
});

int valid_name(string name)
{
    int len = strlen(name);
    int i, j;

    if(member_array(name, novel_name) != -1)
        return 0;

    if(member_array(name, novel_name1) != -1)
        return 0;

    for(i = 0; i < len; i += 2)
        for(j = i + 1; j < len; j += 2)
            if(member_array(name[i..j], banned_name) != -1)
                return 0;
    return 1;
}
