// This program is a part of NITAN MudLIB 
// redl 2013/9
inherit NPC;
#include <ansi.h>

#define START_INTERVAL 15       //分钟
#define TEACH_NUM 18
#define TEACH_COIN -5000000

int clean_up() { return 1;}

mapping *listen = ({
        ([      "msg"           :       "$N在课桌下玩手机，被$n一瞪，吓得赶紧坐正。\n",
                "value"         :       10
        ]),
        ([      "msg"           :       "$N挪了挪座凳，忍不住放了个响屁。\n",
                "value"         :       10
        ]),
        ([      "msg"           :       "$N偷偷掏了块牛肉干放在嘴里，小心慢慢地嚼动着。\n",
                "value"         :       10
        ]),
        ([      "msg"           :       "$N抽出一本武侠小说，盖在课本上偷看。\n",
                "value"         :       13
        ]),
        ([      "msg"           :       "$N斜着头望向窗外的树枝上，好像有两只鸟在打架。\n",
                "value"         :       13
        ]),
        ([      "msg"           :       "$N趁$n没看见，一把抢过同桌的作业猛抄。\n",
                "value"         :       15
        ]),
        ([      "msg"           :       "$N做贼心虚地看了看讲台，偷偷把玩前桌女同学的辫子。\n",
                "value"         :       18
        ]),
        ([      "msg"           :       "$N趁$n不注意，用剪子剪去了前桌男同学的一缕头发。\n",
                "value"         :       18
        ]),
        ([      "msg"           :       "$N呆呆地盯着$n的衣襟，看得口水直流，不知道在想些什么？\n",
                "value"         :       36
        ])
});

mapping *book_exp = ({
        ([  "name"              :       "三字经",
                "lv"            :       320,
                "content"       :       ({
                        "    人之初，性本善，性相近，习相远，苟不教，性乃迁",
                        "    教之道，贵以专，昔孟母，择邻处，子不学，断机杼",
                        "    窦燕山，有义方，教五子，名俱扬，养不教，父之过",
                        "    教不严，师之惰，子不学，非所宜，幼不学，老何为",
                        "    玉不琢，不成器，人不学，不知义，为人子，方少时",
                        "    亲师友，习礼仪，香九龄，能温席，孝于亲，所当执",
                        "    融四岁，能让梨，弟于长，宜先知，首孝弟，次见闻",
                        "    知某数，识某文，一而十，十而百，百而千，千而万",
                        "    三才者，天地人，三光者，日月星，三纲者，君臣义",
                        "    父子亲，夫妇顺，曰春夏，曰秋冬，此四时，运不穷",
                        "    曰南北，曰西东，此四方，应乎中，曰水火，木金土",
                        "    此五行，本乎数，曰仁义，礼智信，此五常，不容紊",
                        "    稻粱菽，麦黍稷，此六谷，人所食，马牛羊，鸡犬豕",
                        "    此六畜，人所饲，曰喜怒，曰哀惧，爱恶欲，七情具",
                        "    匏土革，木石金，丝与竹，乃八音，高曾祖，父而身",
                        "    身而子，子而孙，自子孙，至玄曾，乃九族，人之伦",
                        "    父子恩，夫妇从，兄则友，弟则恭，长幼序，友与朋",
                        "    君则敬，臣则忠，此十义，人所同，凡训蒙，须讲究",
                        "    详训诂，名句读，为学者，必有初，小学终，至四书",
                        "    论语者，二十篇，群弟子，记善言，孟子者，七篇止",
                        "    讲道德，说仁义，作中庸，乃孔伋，中不偏，庸不易",
                        "    作大学，乃曾子，自修齐，至平治，孝经通，四书熟",
                        "    如六经，始可读，诗书易，礼春秋，号六经，当讲求",
                        "    有连山，有归藏，有周易，三易详，有典谟，有训诰",
                        "    有誓命，书之奥，我周公，作周礼，著六官，存治体",
                        "    大小戴，注礼记，述圣言，礼乐备，曰国风，曰雅颂",
                        "    号四诗，当讽咏，诗既亡，春秋作，寓褒贬，别善恶",
                        "    三传者，有公羊，有左氏，有谷梁，经既明，方读子",
                        "    撮其要，记其事，五子者，有荀杨，文中子，及老庄",
                        "    经子通，读诸史，考世系，知终始，自羲农，至黄帝",
                        "    号三皇，居上世，唐有虞，号二帝，相揖逊，称盛世",
                        "    夏有禹，商有汤，周文武，称三王，夏传子，家天下",
                        "    四百载，迁夏社，汤伐夏，国号商，六百载，至纣亡",
                        "    周武王，始诛纣，八百载，最长久，周辙东，王纲堕",
                        "    逞干戈，尚游说，始春秋，终战国，五霸强，七雄出",
                        "    嬴秦氏，始兼并，传二世，楚汉争，高祖兴，汉业建",
                        "    至孝平，王莽篡，光武兴，为东汉，四百年，终于献",
                        "    魏蜀吴，争汉鼎，号三国，迄两晋，宋齐继，梁陈承",
                        "    为南朝，都金陵，北元魏，分东西，宇文周，与高齐",
                        "    迨至隋，一土宇，不再传，失统绪，唐高祖，起义师",
                        "    除隋乱，创国基，二十传，三百载，梁灭之，国乃改",
                        "    梁唐晋，及汉周，称五代，皆有由，炎宋兴，受周禅",
                        "    十八传，南北混，辽与金，皆称帝，元灭金，绝宋世",
                        "    舆图广，超前代，九十年，国祚废，太祖兴，国大明",
                        "    号洪武，都金陵，迨成祖，迁燕京，十六世，至崇祯",
                        "    权阉肆，寇如林，李闯出，神器焚，清世祖，应景命",
                        "    靖四方，克大定，古今史，全在兹，载治乱，知兴衰",
                        "    读史书，考实录，通古今，若亲目，口而诵，心而惟",
                        "    朝于斯，夕于斯，昔仲尼，师项橐，古圣贤，尚勤学",
                        "    赵中令，读鲁论，彼既仕，学且勤，披蒲编，削竹简",
                        "    彼无书，且知勉，头悬梁，锥刺股，彼不教，自勤苦",
                        "    如囊萤，如映雪，家虽贫，学不辍，如负薪，如挂角",
                        "    身虽劳，犹苦卓，苏老泉，二十七，始发愤，读书籍",
                        "    彼既老，犹悔迟，尔小生，宜早思，若梁灏，八十二",
                        "    对大廷，魁多士，彼既成，众称异，尔小生，宜立志",
                        "    莹八岁，能咏诗，泌七岁，能赋棋，彼颖悟，人称奇",
                        "    尔幼学，当效之，蔡文姬，能辨琴，谢道韫，能咏吟",
                        "    彼女子，且聪敏，尔男子，当自警，唐刘晏，方七岁",
                        "    举神童，作正字，彼虽幼，身已仕，尔幼学，勉而致",
                        "    有为者，亦若是，犬守夜，鸡司晨，苟不学，曷为人",
                        "    蚕吐丝，蜂酿蜜，人不学，不如物，幼而学，壮而行",
                        "    上致君，下泽民，扬名声，显父母，光于前，裕于后",
                        "    人遗子，金满嬴，我教子，惟一经，勤有功，戏无益"
                        })
        ]),
        ([  "name"              :       "千字文",
                "lv"            :       360,
                "content"       :       ({
                        "    天地玄黄，宇宙洪荒，日月盈昃，辰宿列张",
                        "    寒来暑往，秋收冬藏，闰余成岁，律吕调阳",
                        "    云腾致雨，露结为霜，金生丽水，玉出昆冈",
                        "    剑号巨阙，珠称夜光，果珍李柰，菜重芥姜",
                        "    海咸河淡，鳞潜羽翔，龙师火帝，鸟官人皇",
                        "    始制文字，乃服衣裳，推位让国，有虞陶唐",
                        "    吊民伐罪，周发殷汤，坐朝问道，垂拱平章",
                        "    爱育黎首，臣伏戎羌，遐迩壹体，率宾归王",
                        "    鸣凤在树，白驹食场，化被草木，赖及万方",
                        "    盖此身发，四大五常，恭惟鞠养，岂敢毁伤",
                        "    女慕贞絜，男效才良，知过必改，得能莫忘",
                        "    罔谈彼短，靡恃己长，信使可覆，器欲难量",
                        "    墨悲丝染，诗讃羔羊，景行维贤，克念作圣",
                        "    德建名立，形端表正，空谷传声，虚堂习听",
                        "    祸因恶积，福缘善庆，尺璧非宝，寸阴是竞",
                        "    资父事君，曰严与敬，孝当竭力，忠则尽命",
                        "    临深履薄，夙兴温凊，似兰斯馨，如松之盛",
                        "    川流不息，渊澄取映，容止若思，言辞安定",
                        "    笃初诚美，慎终宜令，荣业所基，籍甚无竟",
                        "    学优登仕，摄职从政，存以甘棠，去而益咏",
                        "    乐殊贵贱，礼别尊卑，上和下睦，夫唱妇随",
                        "    外受傅训，入奉母仪，诸姑伯叔，犹子比儿",
                        "    孔怀兄弟，同气连枝，交友投分，切磨箴规",
                        "    仁慈隐恻，造次弗离，节义廉退，颠沛匪亏",
                        "    性静情逸，心动神疲，守真志满，逐物意移",
                        "    坚持雅操，好爵自縻，都邑华夏，东西二京",
                        "    背邙面洛，浮渭据泾，宫殿盘郁，楼观飞惊",
                        "    图写禽兽，画彩仙灵，丙舍傍启，甲帐对楹",
                        "    肆筵设席，鼓瑟吹笙，升阶纳陛，弁转疑星",
                        "    右通广内，左达承明，既集坟典，亦聚羣英",
                        "    杜稾钟隶，漆书壁经，府罗将相，路侠槐卿",
                        "    户封八县，家给千兵，高冠陪辇，驱毂振缨",
                        "    世禄侈富，车驾肥轻，策功茂实，勒碑刻铭",
                        "    磻溪伊尹，佐时阿衡，奄宅曲阜，微旦孰营",
                        "    桓公匡合，济弱扶倾，绮回汉惠，说感武丁",
                        "    俊乂密勿，多士寔宁，晋楚更霸，赵魏困横",
                        "    假途灭虢，践土会盟，何遵约法，韩弊烦刑",
                        "    起翦颇牧，用军最精，宣威沙漠，驰誉丹青",
                        "    九州禹迹，百郡秦并，岳宗恒岱，禅主云亭",
                        "    雁门紫塞，鸡田赤城，昆池碣石，钜野洞庭",
                        "    旷远緜邈，岩岫杳冥，治本於农，务兹稼穑",
                        "    俶载南亩，我艺黍稷，税熟贡新，劝赏黜陟",
                        "    孟轲敦素，史鱼秉直，庶几中庸，劳谦谨敕",
                        "    聆音察理，鉴貌辨色，贻厥嘉猷，勉其祗植",
                        "    省躬讥诫，宠增抗极，殆辱近耻，林皋幸即",
                        "    两疏见机，解组谁逼，索居闲处，沈默寂寥",
                        "    求古寻论，散虑逍遥，欣奏累遣，戚谢欢招",
                        "    渠荷的历，园莽抽条，枇杷晚翠，梧桐早凋",
                        "    陈根委翳，落叶飘颻，游鵾独运，凌摩绛霄",
                        "    耽读翫市，寓目囊箱，易輶攸畏，属耳垣墙",
                        "    具膳飡饭，适口充肠，饱饫烹宰，饥厌糟糠",
                        "    亲戚故旧，老少异粮，妾御绩纺，侍巾帷房",
                        "    纨扇圆洁，银烛炜煌，昼眠夕寐，蓝笋象床",
                        "    弦歌酒讌，接杯举觞，矫手顿足，悦豫且康",
                        "    嫡后嗣续，祭祀烝尝，稽颡再拜，悚惧恐惶",
                        "    牋牒简要，顾答审详，骸垢想浴，执热愿凉",
                        "    驴骡犊特，骇跃超骧，诛斩贼盗，捕获叛亡",
                        "    布射辽丸，嵇琴阮啸，恬笔伦纸，钧巧任钓",
                        "    释纷利俗，并皆佳妙，毛施淑姿，工颦妍笑",
                        "    年矢每催，曦晖朗耀，璇玑悬斡，晦魄环照",
                        "    指薪修祜，永绥吉劭，矩步引领，俯仰廊庙",
                        "    束带矜庄，徘徊瞻眺，孤陋寡闻，愚蒙等诮"
                        })
        ]),
        ([  "name"              :       "道德经",
                "lv"            :       420,
                "content"       :       ({
                        "    道可道，非常道。名可名，非常名。\n"
                        "    无名天地之始﹔有名万物之母。\n"
                        "    故常无，欲以观其妙﹔常有，欲以观其徼。\n"
                        "    此两者，同出而异名，同谓之玄。\n"
                        "    玄之又玄，众妙之门。",
                        "    天下皆知美之为美，斯恶已。\n"
                        "    皆知善之为善，斯不善已。\n"
                        "    有无相生，难易相成，长短相形，\n"
                        "    高下相盈，音声相和，前后相随。\n"
                        "    恒也。是以圣人处无为之事，\n"
                        "    行不言之教﹔万物作而弗始，\n"
                        "    生而弗有，为而弗恃，功成而不居。\n"
                        "    夫唯弗居，是以不去。",
                        "    不尚贤，使民不争\n"
                        "    不贵难得之货，使民不为盗﹔\n"
                        "    不见可欲，使民心不乱。\n"
                        "    是以圣人之治，\n"
                        "    虚其心，\n"
                        "    实其腹，\n"
                        "    弱其志，\n"
                        "    强其骨。\n"
                        "    常使民无知无欲。\n"
                        "    使夫智者不敢为也。\n"
                        "    为无为，则无不治。",
                        "    道冲，而用之或不盈。\n"
                        "    渊兮，似万物之宗﹔湛兮，似或存。\n"
                        "    吾不知谁之子，象帝之先。",
                        "    天地不仁，以万物为刍狗﹔圣人不仁，以百姓为刍狗。\n"
                        "    天地之间，其犹橐钥乎。虚而不屈，动而愈出。\n"
                        "    多言数穷，不如守中。",
                        "    谷神不死，是谓玄牝。\n"
                        "    玄牝之门，是谓天地根。帛系若存，用之不勤。",
                        "    天长地久。\n"
                        "    天地所以能长且久者，\n"
                        "    以其不自生，故能长生。\n"
                        "    是以圣人后其身而身先﹔外其身而身存。\n"
                        "    非以其无私邪。\n"
                        "    故能成其私。",
                        "    上善若水。\n"
                        "    水善利万物而不争，\n"
                        "    处众人之所恶，故几于道。\n"
                        "    居善地，心善渊，与善仁，\n"
                        "    言善信，政善治，事善能，\n"
                        "    动善时。夫唯不争，故无尤。",
                        "    持而盈之，不如其已﹔\n"
                        "    揣而锐之，不可长保。\n"
                        "    金玉满堂，莫之能守﹔\n"
                        "    富贵而骄，自遗其咎。\n"
                        "    功遂身退，天之道也。",
                        "    载营魄抱一，能无离乎。\n"
                        "    专气致柔，能如婴儿乎。\n"
                        "    涤除玄鉴，能如疵乎。\n"
                        "    爱国治民，能无为乎。\n"
                        "    天门开阖，能为雌乎。\n"
                        "    明白四达，能无知乎。",
                        "    三十辐，共一毂，当其无，有车之用。\n"
                        "    埏埴以为器，当其无，有器之用。\n"
                        "    凿户牖以为室，当其无，有室之用。\n"
                        "    故有之以为利，无之以为用。",
                        "    五色令人目盲﹔五音令人耳聋﹔五味令人口爽﹔\n"
                        "    驰骋畋猎，令人心发狂﹔难得之货，令人行妨。\n"
                        "    是以圣人为腹不为目，故去彼取此。",
                        "    宠辱若惊，贵大患若身。\n"
                        "    何谓宠辱若惊。\n"
                        "    宠为下，得之若惊，失之若惊，是谓宠辱若惊。\n"
                        "    何谓贵大患若身。\n"
                        "    吾所以有大患者，为吾有身，\n"
                        "    及吾无身，吾有何患。\n"
                        "    故贵以身为天下，若可寄天下﹔\n"
                        "    爱以身为天下，若可托天下。",
                        "    视之不见，名曰夷﹔\n"
                        "    听之不闻，名曰希﹔\n"
                        "    搏之不得，名曰微。\n"
                        "    此三者不可致诘，故混而为一。\n"
                        "    其上不皦，其下不昧。\n"
                        "    绳绳兮不可名，复归于物。\n"
                        "    是谓无状之状，无物之象，是谓惚恍。\n"
                        "    迎之不见其首，随之不见其后。\n"
                        "    执古之道，以御今之有。\n"
                        "    能知古始，是谓道纪。",
                        "    古之善为道者，微妙玄通，深不可识。\n"
                        "    夫唯不可识，故强为之容：\n"
                        "    豫兮若冬涉川﹔\n"
                        "    犹兮若畏四邻﹔\n"
                        "    俨兮其若客﹔\n"
                        "    涣兮其若凌释﹔\n"
                        "    敦兮其若朴﹔\n"
                        "    旷兮其若谷﹔\n"
                        "    混兮其若浊﹔\n"
                        "    澹兮其若海﹔\n"
                        "    飂兮若无止。\n"
                        "    孰能浊以静之徐清。\n"
                        "    孰能安以动之徐生。\n"
                        "    保此道者，不欲盈。\n"
                        "    夫唯不盈，故能蔽而新成。",
                        "    致虚极，守静笃。\n"
                        "    万物并作，吾以观复。\n"
                        "    夫物芸芸，各复归其根。\n"
                        "    归根曰静，静曰复命。\n"
                        "    复命曰常，知常曰明。\n"
                        "    不知常，妄作凶。\n"
                        "    知常容，容乃公，\n"
                        "    公乃全，全乃天，\n"
                        "    天乃道，道乃久，没身不殆。",
                        "    太上，不知有之﹔\n"
                        "    其次，亲而誉之﹔\n"
                        "    其次，畏之﹔\n"
                        "    其次，侮之。\n"
                        "    信不足焉，有不信焉。\n"
                        "    悠兮其贵言。\n"
                        "    功成事遂，百姓皆谓：「我自然」。",
                        "    大道废，有仁义﹔智慧出，有大伪﹔\n"
                        "    六亲不和，有孝慈﹔国家昏乱，有忠臣。",
                        "    绝圣弃智，民利百倍﹔\n"
                        "    绝仁弃义，民复孝慈﹔\n"
                        "    绝巧弃利，盗贼无有。\n"
                        "    此三者以为文，不足。\n"
                        "    故令有所属：见素抱朴，少思寡欲，绝学无忧。",
                        "    唯之与阿，相去几何。\n"
                        "    之与恶，相去若何。\n"
                        "    人之所畏，不可不畏。\n"
                        "    荒兮，其未央哉。\n"
                        "    众人熙熙，如享太牢，如春登台。\n"
                        "    我独泊兮，其未兆﹔\n"
                        "    沌沌兮，如婴儿之未孩﹔\n"
                        "    儽儽兮，若无所归。\n"
                        "    众人皆有余，而我独若遗。我愚人之心也哉。\n"
                        "    俗人昭昭，我独昏昏。\n"
                        "    俗人察察，我独闷闷。\n"
                        "    众人皆有以，而我独顽且鄙。\n"
                        "    我独异于人，而贵食母。",
                        "    孔德之容，惟道是从。\n"
                        "    道之为物，惟恍惟惚。\n"
                        "    惚兮恍兮，其中有象﹔恍兮惚兮，其中有物。\n"
                        "    窈兮冥兮，其中有精﹔其精甚真，其中有信。\n"
                        "    自今及古，其名不去，以阅众甫。\n"
                        "    吾何以知众甫之状哉。以此。",
                        "    曲则全，枉则直，洼则盈，\n"
                        "    敝则新，少则得，多则惑。\n"
                        "    是以圣人抱一为天下式。\n"
                        "    不自见，故明﹔\n"
                        "    不自是，故彰﹔\n"
                        "    不自伐，故有功﹔\n"
                        "    不自矜，故长。\n"
                        "    夫唯不争，故天下莫能与之争。\n"
                        "    古之所谓「曲则全」者，岂虚言哉。\n"
                        "    诚全而归之。",
                        "    希言自然。\n"
                        "    故飘风不终朝，骤雨不终日。\n"
                        "    孰为此者。\n"
                        "    天地。天地尚不能久，而况于人乎。\n"
                        "    故从事于道者，同于道﹔\n"
                        "    德者，同于德﹔失者，同于失。\n"
                        "    同于道者，道亦乐得之﹔\n"
                        "    同于德者，德亦乐得之﹔\n"
                        "    同于失者，失亦乐得之。\n"
                        "    信不足焉，有不信焉。",
                        "    企者不立﹔跨者不行﹔\n"
                        "    自见者不明﹔自是者不彰﹔\n"
                        "    自伐者无功﹔自矜者不长。\n"
                        "    其在道也，曰：余食赘形。\n"
                        "    物或恶之，故有道者不处。",
                        "    有物混成，先天地生。\n"
                        "    寂兮寥兮，独立而不改，\n"
                        "    周行而不殆，可以为天地母。\n"
                        "    吾不知其名，强字之曰道，强为之名曰大。\n"
                        "    大曰逝，逝曰远，远曰反。\n"
                        "    故道大，天大，地大，人亦大。\n"
                        "    域中有四大，而人居其一焉。\n"
                        "    人法地，地法天，天法道，道法自然。",
                        "    重为轻根，静为躁君。\n"
                        "    是以君子终日行不离辎重。\n"
                        "    虽有荣观，燕处超然。\n"
                        "    奈何万乘之主，而以身轻天下。\n"
                        "    轻则失根，躁则失君。",
                        "    善行无辙迹，善言无瑕谪﹔\n"
                        "    善数不用筹策﹔善闭无关楗而不可开，\n"
                        "    善结无绳约而不可解。\n"
                        "    是以圣人常善救人，故无弃人﹔\n"
                        "    常善救物，故无弃物。\n"
                        "    是谓袭明。\n"
                        "    故善人者，不善人之师﹔\n"
                        "    不善人者，善人之资。\n"
                        "    不贵其师，不爱其资，\n"
                        "    虽智大迷，是谓要妙。",
                        "    知其雄，守其雌，为天下溪。\n"
                        "    为天下溪，常德不离，复归于婴儿。\n"
                        "    知其白，守其辱，为天下谷。\n"
                        "    为天下谷，常德乃足，复归于朴。\n"
                        "    知其白，守其黑，为天下式。\n"
                        "    为天下式，常德不忒，复归于无极。\n"
                        "    朴散则为器，圣人用之，\n"
                        "    则为官长，故大智不割。",
                        "    将欲取天下而为之，吾见其不得已。\n"
                        "    天下神器，不可为也，不可执也。\n"
                        "    为者败之，执者失之。\n"
                        "    是以圣人无为，故无败﹔\n"
                        "    无执，故无失。\n"
                        "    夫物或行或随﹔或嘘或吹﹔\n"
                        "    或强或羸﹔或载或隳。\n"
                        "    是以圣人去甚，去奢，去泰。",
                        "    以道佐人主者，不以兵强天下。\n"
                        "    其事好远。\n"
                        "    师之所处，荆棘生焉。\n"
                        "    大军之后，必有凶年。\n"
                        "    善有果而已，不以取强。\n"
                        "    果而勿矜，果而勿伐，果而勿骄。\n"
                        "    果而不得已，果而勿强。\n"
                        "    物壮则老，是谓不道，不道早已。",
                        "    夫兵者，不祥之器，\n"
                        "    物或恶之，故有道者不处。\n"
                        "    君子居则贵左，用兵则贵右。\n"
                        "    兵者不祥之器，非君子之器，\n"
                        "    不得已而用之，恬淡为上。\n"
                        "    胜而不美，而美之者，是乐杀人。\n"
                        "    夫乐杀人者，则不可得志于天下矣。\n"
                        "    吉事尚左，凶事尚右。\n"
                        "    偏将军居左，上将军居右，言以丧礼处之。\n"
                        "    杀人之众，以悲哀泣之，战胜以丧礼处之。",
                        "    道常无名朴。\n"
                        "    虽小，天下莫能臣。\n"
                        "    侯王若能守之，万物将自宾。\n"
                        "    天地相合，以降甘露，民莫之令而自均。\n"
                        "    始制有名，名亦既有，\n"
                        "    夫亦将知止，知止可以不殆。\n"
                        "    譬道之在天下，犹川谷之于江海。",
                        "    知人者智，自知者明。\n"
                        "    胜人者有力，自胜者强。\n"
                        "    知足者富。\n"
                        "    强行者有志。\n"
                        "    不失其所者久。\n"
                        "    死而不亡者寿。",
                        "    大道泛兮，其可左右。\n"
                        "    万物恃之以生而不辞，功成而不有。\n"
                        "    衣养万物而不为主，可名于小﹔\n"
                        "    万物归焉而不为主，可名为大。\n"
                        "    以其终不自为大，故能成其大。",
                        "    执大象，天下往。\n"
                        "    往而不害，安平泰。\n"
                        "    乐与饵，过客止。\n"
                        "    道之出口，淡乎其无味，\n"
                        "    视之不足见，听之不足闻，用之不足既。",
                        "    将欲歙之，必故张之﹔将欲弱之，必故强之﹔\n"
                        "    将欲废之，必故兴之﹔将欲取之，必故与之。\n"
                        "    是谓微明。\n"
                        "    柔弱胜刚强。\n"
                        "    鱼不可脱于渊，国之利器不可以示人。",
                        "    道常无为而无不为。\n"
                        "    侯王若能守之，万物将自化。\n"
                        "    化而欲作，吾将镇之以无名之朴。\n"
                        "    镇之以无名之朴，夫将不欲。\n"
                        "    不欲以静，天下将自正。",
                        "    上德不德，是以有德﹔\n"
                        "    下德不失德，是以无德。\n"
                        "    上德无为而无以为﹔\n"
                        "    下德无为而有以为。\n"
                        "    上仁为之而无以为﹔\n"
                        "    上义为之而有以为。\n"
                        "    上礼为之而莫之应，\n"
                        "    则攘臂而扔之。\n"
                        "    故失道而后德，失德而后仁，\n"
                        "    失仁而后义，失义而后礼。\n"
                        "    夫礼者，忠信之薄，而乱之首。\n"
                        "    前识者，道之华，而愚之始。\n"
                        "    是以大丈夫处其厚，不居其薄﹔\n"
                        "    处其实，不居其华。故去彼取此。",
                        "    昔之得一者：\n"
                        "    天得一以清﹔\n"
                        "    地得一以宁﹔\n"
                        "    神得一以灵﹔\n"
                        "    谷得一以生﹔\n"
                        "    侯得一以为天下正。\n"
                        "    其致之也，谓天无以清，将恐裂﹔\n"
                        "    地无以宁，将恐废﹔\n"
                        "    神无以灵，将恐歇﹔\n"
                        "    谷无以盈，将恐竭﹔\n"
                        "    万物无以生，将恐灭﹔\n"
                        "    侯王无以正，将恐蹶。\n"
                        "    故贵以贱为本，高以下为基。\n"
                        "    是以侯王自称孤、寡、不谷。\n"
                        "    此非以贱为本邪。非乎。故致誉无誉。\n"
                        "    是故不欲琭琭如玉，珞珞如石。",
                        "    反者道之动﹔弱者道之用。\n"
                        "    天下万物生于有，有生于无。",
                        "    上士闻道，勤而行之﹔中士闻道，若存若亡﹔\n"
                        "    下士闻道，大笑之。不笑不足以为道。\n"
                        "    故建言有之：\n"
                        "    明道若昧﹔\n"
                        "    进道若退﹔\n"
                        "    夷道若颣﹔\n"
                        "    上德若谷﹔\n"
                        "    广德若不足﹔\n"
                        "    建德若偷﹔\n"
                        "    质真若渝﹔\n"
                        "    大白若辱﹔\n"
                        "    大方无隅﹔\n"
                        "    大器晚成﹔\n"
                        "    大音希声﹔\n"
                        "    大象无形﹔\n"
                        "    道隐无名。\n"
                        "    夫唯道，善贷且成。",
                        "    道生一，一生二，二生三，三生万物。\n"
                        "    万物负阴而抱阳，冲气以为和。\n"
                        "    人之所恶，唯孤、寡、不谷，而王公以为称。\n"
                        "    故物或损之而益，或益之而损。\n"
                        "    人之所教，我亦教之。\n"
                        "    强梁者不得其死，吾将以为教父。",
                        "    天下之至柔，驰骋天下之至坚。\n"
                        "    无有入无间，吾是以知无为之有益。\n"
                        "    不言之教，无为之益，天下希及之。",
                        "    名与身孰亲。身与货孰多。得与亡孰病。\n"
                        "    甚爱必大费﹔多藏必厚亡。\n"
                        "    故知足不辱，知止不殆，可以长久。",
                        "    大成若缺，其用不弊。\n"
                        "    大盈若冲，其用不穷。\n"
                        "    大直若屈，大巧若拙，大辩若讷。\n"
                        "    静胜躁，寒胜热。清静为天下正。",
                        "    天下有道，却走马以粪。\n"
                        "    天下无道，戎马生于郊。\n"
                        "    祸莫大于不知足﹔咎莫大于欲得。\n"
                        "    故知足之足，常足矣。",
                        "    不出户，知天下﹔不窥牖，见天道。\n"
                        "    其出弥远，其知弥少。\n"
                        "    是以圣人不行而知，不见而明，不为而成。",
                        "    为学日益，为道日损。\n"
                        "    损之又损，以至于无为。\n"
                        "    无为而无不为。\n"
                        "    取天下常以无事，及其有事，不足以取天下。",
                        "    圣人常无心，以百姓心为心。\n"
                        "    善者，吾善之﹔不善者，吾亦善之﹔德善。\n"
                        "    信者，吾信之﹔不信者，吾亦信之﹔德信。\n"
                        "    圣人在天下，歙歙焉，为天下浑其心，\n"
                        "    百姓皆注其耳目，圣人皆孩之。",
                        "    出生入死。\n"
                        "    生之徒，十有三﹔\n"
                        "    死之徒，十有三﹔\n"
                        "    人之生，动之于死地，亦十有三。\n"
                        "    夫何故。\n"
                        "    以其生之厚。\n"
                        "    盖闻善摄生者，路行不遇兕虎，入军不被甲兵﹔\n"
                        "    兕无所投其角，虎无所用其爪，兵无所容其刃。\n"
                        "    夫何故。以其无死地。",
                        "    道生之，德畜之，物形之，势成之。\n"
                        "    是以万物莫不尊道而贵德。\n"
                        "    道之尊，德之贵，夫莫之命而常自然。\n"
                        "    故道生之，德畜之﹔\n"
                        "    长之育之﹔成之熟之﹔养之覆之。\n"
                        "    生而不有，为而不恃，\n"
                        "    长而不宰。是谓玄德。",
                        "    天下有始，以为天下母。\n"
                        "    既得其母，以知其子，\n"
                        "    复守其母，没身不殆。\n"
                        "    塞其兑，闭其门，终身不勤。\n"
                        "    开其兑，济其事，终身不救。\n"
                        "    见小曰明，守柔曰强。\n"
                        "    用其光，复归其明，无遗身殃﹔是为袭常。",
                        "    使我介然有知，行于大道，唯施是畏。\n"
                        "    大道甚夷，而人好径。\n"
                        "    朝甚除，田甚芜，仓甚虚﹔\n"
                        "    服文采，带利剑，厌饮食，\n"
                        "    财货有余﹔是为盗夸。\n"
                        "    非道也哉。",
                        "    善建者不拔，\n"
                        "    善抱者不脱，子孙以祭祀不辍。\n"
                        "    修之于身，其德乃真﹔\n"
                        "    修之于家，其德乃余﹔\n"
                        "    修之于乡，其德乃长﹔\n"
                        "    修之于邦，其德乃丰﹔\n"
                        "    修之于天下，其德乃普。\n"
                        "    故以身观身，\n"
                        "    以家观家，以乡观乡，\n"
                        "    以邦观邦，以天下观天下。\n"
                        "    吾何以知天下然哉。以此。",
                        "    含「德」之厚，比于赤子。\n"
                        "    毒虫不螫，猛兽不据，攫鸟不搏。\n"
                        "    骨弱筋柔而握固。\n"
                        "    未知牝牡之合而峻作，精之至也。\n"
                        "    终日号而不嗄，和之至也。\n"
                        "    知和曰「常」，\n"
                        "    知常曰「明」。\n"
                        "    益生曰祥。心使气曰强。\n"
                        "    物壮则老，谓之不道，不道早已。",
                        "    知者不言，言者不知。\n"
                        "    挫其锐，解其纷，和其光，\n"
                        "    同其尘，是谓「玄同」。\n"
                        "    故不可得而亲，不可得而疏﹔\n"
                        "    不可得而利，不可得而害﹔\n"
                        "    不可得而贵，不可得而贱。故为天下贵。",
                        "    以正治国，以奇用兵，以无事取天下。\n"
                        "    吾何以知其然哉。以此：\n"
                        "    天下多忌讳，而民弥贫﹔\n"
                        "    人多利器，国家滋昏﹔\n"
                        "    人多伎巧，奇物滋起﹔\n"
                        "    法令滋彰，盗贼多有。\n"
                        "    故圣人云：\n"
                        "    「我无为，而民自化﹔\n"
                        "    我好静，而民自正﹔\n"
                        "    我无事，而民自富﹔\n"
                        "    我无欲，而民自朴。」",
                        "    其政闷闷，其民淳淳﹔\n"
                        "    其政察察，其民缺缺。\n"
                        "    是以圣人方而不割，廉而不刿，\n"
                        "    直而不肆，光而不耀。\n"
                        "    祸兮福之所倚，福兮祸之所伏。\n"
                        "    孰知其极。其无正也。\n"
                        "    正复为奇，善复为妖。\n"
                        "    人之迷，其日固久。",
                        "    治人事天，莫若啬。\n"
                        "    夫唯啬，是谓早服﹔\n"
                        "    早服谓之重积德﹔重积德则无不克﹔\n"
                        "    无不克则莫知其极﹔莫知其极，可以有国﹔\n"
                        "    有国之母，可以长久﹔\n"
                        "    是谓深根固柢，长生久视之道。",
                        "    治大国，若烹小鲜。\n"
                        "    以道莅天下，其鬼不神﹔\n"
                        "    非其鬼不神，其神不伤人﹔\n"
                        "    非其神不伤人，圣人亦不伤人。\n"
                        "    夫两不相伤，故德交归焉。",
                        "    大邦者下流，天下之牝，\n"
                        "    天下之交也。\n"
                        "    牝常以静胜牡，以静为下。\n"
                        "    故大邦以下小邦，则取小邦﹔\n"
                        "    小邦以下大邦，则取大邦。\n"
                        "    故或下以取，或下而取。\n"
                        "    大邦不过欲兼畜人，小邦不过欲入事人。\n"
                        "    夫两者各得所欲，大者宜为下。",
                        "    道者万物之奥。善人之宝，不善人之所保。\n"
                        "    美言可以市尊，美行可以加人。\n"
                        "    人之不善，何弃之有。\n"
                        "    故立天子，置三公，\n"
                        "    虽有拱璧以先驷马，\n"
                        "    不如坐进此道。\n"
                        "    古之所以贵此道者何。\n"
                        "    不曰：求以得，有罪以免邪。故为天下贵。",
                        "    为无为，事无事，味无味。\n"
                        "    图难于其易，为大于其细﹔\n"
                        "    天下难事，必作于易，\n"
                        "    天下大事，必作于细。\n"
                        "    是以圣人终不为大，故能成其大。\n"
                        "    夫轻诺必寡信，多易必多难。\n"
                        "    是以圣人犹难之，故终无难矣。",
                        "    其安易持，其未兆易谋。\n"
                        "    其脆易泮，其微易散。\n"
                        "    为之于未有，治之于未乱。\n"
                        "    合抱之木，生于毫末﹔\n"
                        "    九层之台，起于累土﹔\n"
                        "    千里之行，始于足下。\n"
                        "    民之从事，常于几成而败之。\n"
                        "    慎终如始，则无败事。",
                        "    古之善为道者，非以明民，将以愚之。\n"
                        "    民之难治，以其智多。\n"
                        "    故以智治国，国之贼﹔\n"
                        "    不以智治国，国之福。\n"
                        "    知此两者亦稽式。\n"
                        "    常知稽式，是谓「玄德」。\n"
                        "    「玄德」深矣，远矣，与物反矣，然后乃至大顺。",
                        "    江海之所以能为百谷王者，\n"
                        "    以其善下之，故能为百谷王。\n"
                        "    是以圣人欲上民，必以言下之﹔\n"
                        "    欲先民，必以身后之。\n"
                        "    是以圣人处上而民不重，处前而民不害。\n"
                        "    是以天下乐推而不厌。\n"
                        "    以其不争，故天下莫能与之争。",
                        "    天下皆谓我道大，似不肖。\n"
                        "    夫唯大，故似不肖。\n"
                        "    若肖，久矣其细也夫。\n"
                        "    我有三宝，持而保之。\n"
                        "    一曰慈，\n"
                        "    二曰俭，\n"
                        "    三曰不敢为天下先。\n"
                        "    慈故能勇﹔俭故能广﹔\n"
                        "    不敢为天下先，故能成器长。\n"
                        "    今舍慈且勇﹔舍俭且广﹔\n"
                        "    舍后且先﹔死矣。\n"
                        "    夫慈以战则胜，以守则固。\n"
                        "    天将救之，以慈卫之。",
                        "    善为士者，不武﹔\n"
                        "    善战者，不怒﹔\n"
                        "    善胜敌者，不与﹔\n"
                        "    善用人者，为之下。\n"
                        "    是谓不争之德，\n"
                        "    是谓用人之力，\n"
                        "    是谓配天古之极。",
                        "    用兵有言：\n"
                        "    「吾不敢为主，而为客﹔\n"
                        "    不敢进寸，而退尺。」\n"
                        "    是谓行无行﹔攘无臂﹔\n"
                        "    扔无敌﹔执无兵。\n"
                        "    祸莫大于轻敌，轻敌几丧吾宝。\n"
                        "    故抗兵相若，哀者胜矣。",
                        "    吾言甚易知，甚易行。\n"
                        "    天下莫能知，莫能行。\n"
                        "    言有宗，事有君。\n"
                        "    夫唯无知，是以不我知。\n"
                        "    知我者希，则我者贵。\n"
                        "    是以圣人被褐而怀玉。",
                        "    知不知，尚矣﹔不知知，病也。\n"
                        "    圣人不病，以其病病。\n"
                        "    夫唯病病，是以不病。",
                        "    民不畏威，\n"
                        "    则大威至。\n"
                        "    无狎其所居，\n"
                        "    无厌其所生。\n"
                        "    夫唯不厌，\n"
                        "    是以不厌。\n"
                        "    是以圣人自知不自见﹔\n"
                        "    自爱不自贵。\n"
                        "    故去彼取此。",
                        "    勇于敢则杀，勇于不敢则活。\n"
                        "    此两者，或利或害。\n"
                        "    天之所恶，孰知其故。\n"
                        "    天之道，\n"
                        "    不争而善胜，不言而善应，\n"
                        "    不召而自来，繟然而善谋。\n"
                        "    天网恢恢，疏而不失。",
                        "    民不畏死，奈何以死惧之。\n"
                        "    若使民常畏死，而为奇者，\n"
                        "    吾得执而杀之，孰敢。\n"
                        "    常有司杀者杀。\n"
                        "    夫代司杀者杀，是谓代大匠斲，\n"
                        "    夫代大匠斲者，希有不伤其手矣。",
                        "    民之饥，以其上食税之多，是以饥。\n"
                        "    民之难治，以其上之有为，是以难治。\n"
                        "    民之轻死，以其上求生之厚，是以轻死。\n"
                        "    夫唯无以生为者，是贤于贵生。",
                        "    人之生也柔弱，其死也坚强。\n"
                        "    草木之生也柔脆，其死也枯槁。\n"
                        "    故坚强者死之徒，柔弱者生之徒。\n"
                        "    是以兵强则灭，木强则折。\n"
                        "    强大处下，柔弱处上。",
                        "    天之道，其犹张弓欤。\n"
                        "    高者抑之，下者举之﹔\n"
                        "    有余者损之，不足者补之。\n"
                        "    天之道，损有余而补不足。\n"
                        "    人之道，则不然，损不足以奉有余。\n"
                        "    孰能有余以奉天下，唯有道者。\n"
                        "    是以圣人为而不恃，功成而不处，其不欲见贤。",
                        "    天下莫柔弱于水，而攻坚强者莫之能胜，以其无以易之。\n"
                        "    弱之胜强，柔之胜刚，\n"
                        "    天下莫不知，莫能行。\n"
                        "    是以圣人云：\n"
                        "    「受国之垢，是谓社稷主﹔\n"
                        "    受国不祥，是为天下王。」\n"
                        "    正言若反。",
                        "    和大怨，必有余怨﹔\n"
                        "    报怨以德，安可以为善。\n"
                        "    是以圣人执左契，而不责于人。\n"
                        "    有德司契，无德司彻。\n"
                        "    天道无亲，常与善人。",
                        "    小国寡民。\n"
                        "    使有什伯之器而不用﹔\n"
                        "    使民重死而不远徙。\n"
                        "    虽有舟舆，无所乘之，\n"
                        "    虽有甲兵，无所陈之。\n"
                        "    使民复结绳而用之。\n"
                        "    甘其食，美其服，安其居，乐其俗。\n"
                        "    邻国相望，鸡犬之声相闻，\n"
                        "    民至老死，不相往来。",
                        "    信言不美，美言不信。\n"
                        "    善者不辩，辩者不善。\n"
                        "    知者不博，博者不知。\n"
                        "    圣人不积，既以为人己愈有，\n"
                        "    既以与人己愈多。\n"
                        "    天之道，利而不害﹔\n"
                        "    圣人之道，为而不争。"
                        })
        ])
});

mapping *book_sk = ({
        ([  "name"              :       "阴符经",
                "lv"            :       320,
                "content"       :       ({
                        "    观天之道，执天之行，尽矣。\n"
                        "    故天有五贼，见之者昌。\n"
                        "    五贼在心，施行于天。\n"
                        "    宇宙在乎手，万化生乎身。",
                        "    天性，人也；人心，机也。\n"
                        "    立天之道，以定人也。\n"
                        "    天发杀机，移星易宿；\n"
                        "    地发杀机，龙蛇起陆；\n"
                        "    人发杀机，天地反覆；\n"
                        "    天人合发，万化定基。",
                        "    性有巧拙，可以伏藏。\n"
                        "    九窍之邪，在乎三要，可以动静。\n"
                        "    火生于木，祸发必克；\n"
                        "    奸生于国，时动必溃。\n"
                        "    知之修之，谓之圣人。 ",
                        "    天生天杀，道之理也。\n"
                        "    天地，万物之盗；\n"
                        "    万物，人之盗；\n"
                        "    人，万物之盗。\n"
                        "    三盗既宜，三才即安。",
                        "    故曰：\n"
                        "    食其时，百骸理；\n"
                        "    动其机，万化安。\n"
                        "    人知其神之神，\n"
                        "    不知其不神之所以神也。",
                        "    日月有数，大小有定，\n"
                        "    圣功生焉，神明出焉。\n"
                        "    其盗机也，天下莫能见，莫能知。\n"
                        "    君子得之固穷，小人得之轻命。 ",
                        "    瞽者善听，聋者善视。\n"
                        "    绝利一源，用师十倍。\n"
                        "    三返昼夜，用师万倍。",
                        "    心生于物，死于物，机在于目。\n"
                        "    天之无恩而大恩生。\n"
                        "    迅雷烈风，莫不蠢然。\n"
                        "    至乐性余，至静性廉。\n"
                        "    天之至私，用之至公。",
                        "    禽之制在炁。生者死之根，死者生之根。\n"
                        "    恩生于害，害生于恩。\n"
                        "    愚人以天地文理圣，我以时物文理哲。\n"
                        "    人以愚虞圣，我以不愚虞圣；\n"
                        "    人以奇期胜，我以不奇期胜。",
                        "    故曰：\n"
                        "    沉水入火，自取灭亡。\n"
                        "    自然之道静，故天地万物生。\n"
                        "    天地之道浸，故阴阳胜。\n"
                        "    阴阳推，而变化顺矣。",
                        "    是故圣人知自然之道不可违，因而制之，至静之道。\n"
                        "    律历所不能契。\n"
                        "    爰有奇器，是生万象，八卦甲子，神机鬼藏。\n"
                        "    阴阳相胜之术，昭昭乎进于象矣。"
                        })
        ]),
        ([  "name"              :       "外景经",
                "lv"            :       360,
                "content"       :       ({
                        "    老君闲居作七言，解说身形及诸神，上有黄庭下关元，后有幽阙前命门",
                        "    呼吸庐间入丹田，玉池清水灌灵根，审能修之可长存，黄庭中人衣朱衣",
                        "    关元茂龠阖两靡，幽阙侠之高巍巍，丹田之中精气微，玉池清水上生肥",
                        "    灵根坚固老不衰，中池有士服赤衣，横下三寸神所居，中外相距重闭之",
                        "    神庐之中当修治，玄府气管受精府，急固子精以自持，宅中有士常衣绎",
                        "    子能见之可不病，横立长尺约其上，子能守之或无惹，呼吸庐间以自偿",
                        "    子保完坚身受庆，方寸之中谨盖藏，精神还归老复壮，心结幽厥流下竞",
                        "    养子玉树令可壮，至道不烦无旁午，灵台通天临中野，方寸之中间关下",
                        "    玉房之中神门户，既是公子教我者，明堂四达法海源，真人子丹当吾前",
                        "    三关之中精气深，子欲不死修昆仑，绎官重楼十二环，琼室之中五色集",
                        "    赤神之子中池立，下有长城玄谷邑，长生要慎房中急，弃捐淫欲专子精",
                        "    寸田尺宅可治生，系子长留心安宁，推志游神三奇灵，行间无事心太平",
                        "    常存玉房神明达，时思太仓不饥渴，役使六丁玉女渴，闭子精门可长活",
                        "    正室堂前神所舍，洗心自治无败污，历观五脏视节度，六府修治洁如素",
                        "    虚无自然道之固，物有自然道不烦，垂拱无为身体安，虚无之居在帏间",
                        "    寂寞郭然口不言，修和独立真人官，恬淡无欲游德园，清净香洁玉女前",
                        "    作道优游深独居，扶养性命守虚无，恬淡自乐何思虑，羽翼已具正扶疏",
                        "    长生久视乃飞去，五行参差同根蒂，三五合气其本一，谁与共之斗日月",
                        "    抱玉怀珠和子室，子能守一万事毕，子自有之持无失，即欲不死入金室",
                        "    出日大月是吾道，天七地三回相守，升降进退合乃久，玉石落落是吾宝",
                        "    子自有之何不守，心晓根基养华彩，服天顺地合藏精，七口之五回相合",
                        "    昆仑之上不迷误，九原之山何亭亭，中有真人可使令，蔽以紫官舟城楼",
                        "    侠以日月如明珠，万岁昭昭非有期，外本三阳物自来，内拘三神可长生",
                        "    魂欲上天魄入渊，还魂返魄道自然，庶几结珠固灵根，玉匙金钥身完坚",
                        "    载地悬天周乾坤，象以四时赤如舟，前仰后卑列其门，选以还丹与玄泉",
                        "    象龟引气致灵根，中有真人巾金巾，负甲持符开七门，此非扶叶实是根",
                        "    昼夜忌之可长存，仙人造士非异有，积精所致和专仁，人皆食谷与五味",
                        "    独食太和阴阳气，故能不死天相既，试说五脏各有方，心为国主五脏王",
                        "    受意动静气得行，道自将我神明光，昼日昭昭夜自守，渴可得浆饥自饱",
                        "    经历六府藏卯酉，通我精华调阴阳，转阳之阴藏于九，常能行之耳不老",
                        "    肝之为气修而长，罗列五脏主三光，上合三焦下玉浆，我神玖魄在中央",
                        "    精液流泉去鼻香，立于玄膺含明堂，雷电霹雳往相闻，右酉左卯是吾室",
                        "    伏于志门侯天道，近在子身还自守，清静无为神留止，精神上下开分理",
                        "    精候天道长生草，七窍已通不知老，还坐天门侯阴阳，下于喉咙神明通",
                        "    过华盖下清且凉，大清灵渊见吾形，期成还年可长生，还过华池动肾精",
                        "    立于明堂望丹田，将使诸神开命门，通利天道存灵根，阴阳列布若流星",
                        "    肝气周还终无端，肺之为气三焦起，上座天门侯故道，津液醴泉通六府",
                        "    随鼻上下开两耳，窥视天地存童子，调和精华治发齿，颜色光泽不复白",
                        "    下于喉咙何落落，诸神皆会相求索，下大绛宫紫华色，隐藏华盖观通庐",
                        "    专守心神转相呼，观我神明辟诸邪，脾神还归依大家，致于胃管通虚无",
                        "    藏养灵根不复枯，闭塞命门如玉都，寿传万岁年有余，脾中之神主中官",
                        "    朝会五脏列三光，上合天门合明堂，通利六府调五行，金木水火土为王",
                        "    通利止脉汗为浆，修护七窍去不祥，二神相待化玉英，上禀天气命益长",
                        "    日月列布张阴阳，五脏之主肾最精，伏于太阴成吾形，出入二窍合黄庭",
                        "    呼吸虚无见吾形，强我筋骨血脉盛，恍惚不见过青灵，坐于庐下几小童",
                        "    内息思存神明光，出于天门大无闲，恬淡无欲养华茎，服食玄气可遂生",
                        "    还返七门饮太渊，通我悬膺过青灵，坐于膺间见小童，问于仙迂与奇方",
                        "    服食芝草紫华英，头戴白素足丹田，沐浴华池生灵根，三府相得开命门",
                        "    五味皆至善气还，披发行之可长存，大道荡荡心勿烦，吾言毕矣勿妄传"
                        })
        ]),
        ([  "name"              :       "内景经",
                "lv"            :       420,
                "content"       :       ({
                        "    上清紫霞虚皇前，太上大道玉晨君\n"
                        "    闲居蕊珠作七言，散化五形变万神\n"
                        "    是为黄庭曰内篇，琴心三叠舞胎仙\n"
                        "    九气映明出霄间，神盖童子生紫烟\n"
                        "    是曰玉书可精研，咏之万过升三天\n"
                        "    千灾以消百病痊，不惮虎狼之凶残\n"
                        "    亦以却老年永延",
                        "    上有魂灵下关元，左为少阳右太阴\n"
                        "    后有密户前生门，出日入月呼吸存\n"
                        "    四气所合列宿分，紫烟上下三素云\n"
                        "    灌溉五华植灵根，七液洞流冲庐间\n"
                        "    迥紫抱黄入丹田，幽室内明照阳明",
                        "    口为玉池太和官，漱咽灵液灾不干\n"
                        "    体生光华气香兰，却灭百邪玉炼颜\n"
                        "    审能修之登广寒，昼夜不寐乃成真\n"
                        "    雷鸣电激神泯泯",
                        "    黄庭内人服锦衣，紫华飞裙云气罗\n"
                        "    丹青绿条翠灵柯，七蕤玉龠闭两扉\n"
                        "    重扇金关密枢机，玄泉幽关高崔危\n"
                        "    三田之中精气微，娇女窈窕翳霄晖\n"
                        "    重堂焕焕明八威，天庭地关列斧斤\n"
                        "    灵台盘固永不衰",
                        "    中池内神服赤珠，丹锦云袍带虎符\n"
                        "    横津三寸灵所居，隐芝翳郁自相扶",
                        "    天中之岳精谨修，云宅既清玉帝游\n"
                        "    通利道路无终休，眉号华盖覆明珠\n"
                        "    九幽日月洞空无，宅中有真常衣丹\n"
                        "    审能见之无疾患，赤珠灵裙华茜粲\n"
                        "    舌下玄膺生死岸，出青入玄二气焕\n"
                        "    子若遇之升天汉",
                        "    至道不烦决存真，泥丸百节皆有神\n"
                        "    发神苍华字太元，脑神精根字泥丸\n"
                        "    眼神明上字英玄，鼻神玉垄字灵坚\n"
                        "    耳神空闲字幽田，舌神通命字正伦\n"
                        "    齿神峭锋字罗千，一面之神宗泥丸\n"
                        "    泥丸九真皆有房，方圆一寸处此中\n"
                        "    同服紫衣飞罗裳，但思一部寿无穷\n"
                        "    非各别住俱脑中，列位次坐向外方\n"
                        "    所存在心自相当",
                        "    心神丹元字守灵，肺神皓华字虚成\n"
                        "    肝神龙烟字含明，翳郁导烟主浊清\n"
                        "    肾神玄冥字育婴，脾神常在字魂停\n"
                        "    胆神龙曜字威明，六腑五藏神体精\n"
                        "    皆在心内运天经，昼夜存之自长生",
                        "    肺部之宫似华盖，下有童子坐玉阙\n"
                        "    七元之子主调气，外应中岳鼻齐位\n"
                        "    素锦衣裳黄云带，喘息呼吸体不快\n"
                        "    急存白元和六气，神仙久视无灾害\n"
                        "    用之不已形不滞",
                        "    心部之宫莲含华，下有童子丹元家\n"
                        "    主适寒热荣卫和，丹锦衣裳披玉罗\n"
                        "    金铃朱带坐婆娑，调血理命身不枯\n"
                        "    外应口舌吐五华，临绝呼之亦登苏\n"
                        "    久久行之飞太霞",
                        "    肝部之中翠重里，下有青童神公子\n"
                        "    主诸关键聪明始，青锦披裳佩玉铃\n"
                        "    和制魂魄津液平，外应眼目日月清\n"
                        "    百疴所钟存无英，同用七日自充盈\n"
                        "    垂绝念神死复生，摄魂还魄永无倾",
                        "    肾部之宫玄阙圆，中有童子冥上玄\n"
                        "    主诸六府九液源，外应两耳百液津\n"
                        "    苍锦云衣舞龙幡，上致明霞日月烟\n"
                        "    百病千灾急当存，两部水王对生门\n"
                        "    使人长生升九天",
                        "    脾部之宫属戊已，中有明童黄裳里\n"
                        "    消谷散气摄牙齿，是为太仓两明童\n"
                        "    坐在金台城九重，方圆一寸命门中\n"
                        "    主调百谷五味香，辟却虚羸无病伤\n"
                        "    外应尺宅气色芳，光华所生以表明\n"
                        "    黄锦玉衣带虎章，注念三老子轻翔\n"
                        "    长生高仙远死殃",
                        "    胆部之宫六府精，中有童子曜威明\n"
                        "    雷电八震扬玉旌，龙旗横天掷火铃\n"
                        "    主诸气力摄虎兵，外应眼童鼻柱间\n"
                        "    脑发相扶亦俱鲜，九色锦衣绿华裙\n"
                        "    佩金带玉龙虎文，能存威明乘庆云\n"
                        "    役使万神朝三元",
                        "    脾长一尺掩太仓，中部老君治明堂\n"
                        "    阙字灵元名混康，治人百病消谷粮\n"
                        "    黄衣紫带龙虎章，长精益命赖君王\n"
                        "    三呼我名神自通，三老同坐各有朋\n"
                        "    或精或胎别执方，桃孩合延生华芒\n"
                        "    男女迥九有桃康，道父道母对相望\n"
                        "    师父师母丹玄乡，可用存思登虚空\n"
                        "    殊途一会归要终，关塞三关握固停\n"
                        "    含漱金醴吞玉英，遂至不饥三虫亡\n"
                        "    心意常和致欣昌，五岳之云气彭亨\n"
                        "    保灌玉庐以自偿，五形完坚无灾殃",
                        "    上睹三元如连珠，落落明景照九隅\n"
                        "    五灵夜烛焕八区，子存内皇与我游\n"
                        "    身披凤衣衔虎符，一至不久升虚无\n"
                        "    方寸之中念深藏，不方不圆闭牖窗\n"
                        "    三神还精老方壮，魂魄内守不争竞\n"
                        "    神生腹中衔玉当，灵注幽阙那得丧\n"
                        "    琳条万寻可荫仗，三魂自宁帝书",
                        "    灵台郁蔼望黄野，三寸异室有上下\n"
                        "    间关营卫高玄受，洞房紫极灵门户\n"
                        "    是昔太上告我者，左神公子发神语\n"
                        "    右有白元并立处，明堂金匮玉房间\n"
                        "    上清真人当吾前，黄裳子丹气频烦\n"
                        "    借问何在两眉端，内侠日月列宿陈\n"
                        "    七曜九元冠生门",
                        "    三关之中精气深，九微之内幽且阴\n"
                        "    口为心关精神机，足为地关生命棐\n"
                        "    手为人关把盛衰",
                        "    若得三宫存玄丹，太一流珠安昆仑\n"
                        "    重重楼阁十二环，自高自下皆真人\n"
                        "    玉堂绛宇尽玄宫，璇玑玉衡色兰开\n"
                        "    瞻望童子坐盘桓，问谁家子在我身\n"
                        "    此人何去入泥丸，千千百百自相连\n"
                        "    一一十十似重山，云仪玉华侠耳门\n"
                        "    赤帝黄老与己魂，三真扶胥共房津\n"
                        "    五斗焕明是七元，日月飞行六合间\n"
                        "    帝乡天中地户端，面部魂神皆相存",
                        "    呼吸元气以求仙，仙公公子已在前\n"
                        "    朱鸟吐缩白石源，结精育胞化生身\n"
                        "    留胎止精可长生，三气右回九道明\n"
                        "    正一含华乃充盈，遥望一心如罗星\n"
                        "    金室之下可不倾，延我白首反孩婴",
                        "    琼室之中八素集，泥丸夫人当中立\n"
                        "    长谷玄乡绕效邑，六龙散飞难分别\n"
                        "    长生至慎房中急，何为死作令神泣\n"
                        "    忽之祸乡三灵殁，但当吸气录子精\n"
                        "    寸田尺宅可治生，若当决海百渎倾\n"
                        "    叶去树枯失青青，气亡液漏非己形\n"
                        "    专闭御景乃长宁，保我泥丸三奇灵\n"
                        "    恬淡闭视内自明，物物不干泰而平\n"
                        "    意矣匪事老复丁，思咏玉书入上清",
                        "    常念三房相通达，洞得视见无内外\n"
                        "    存漱五牙不饥渴，神华执巾六丁谒\n"
                        "    急守精室勿妄泄，闭而宝之可长活\n"
                        "    起自形中初不阔，三官近在易隐括\n"
                        "    虚无寂寂空中索，使形如是不当污\n"
                        "    九室正虚神明舍，存思百念视节度\n"
                        "    六府修治勿令故，行自翱翔入天路",
                        "    治生之道了不烦，但修洞玄与玉篇\n"
                        "    兼行形中八景神，二十四真出自然\n"
                        "    高拱无为魂魄安，清净神见与我言\n"
                        "    安在紫房帏幙间，立坐室外三五玄\n"
                        "    烧香接手玉华前，共入太室璇玑门\n"
                        "    高研恬淡道之园，内视密盼尽睹真\n"
                        "    真人在己莫问邻，何处远索求因缘",
                        "    隐形灭形与世殊，含气养精口如朱\n"
                        "    带执性命守虚无，名入上清死录除\n"
                        "    三神之乐由隐居，倏欻游遨无遗忧\n"
                        "    羽服一整八风驱，控驾三素乘晨霞\n"
                        "    金辇正立从玉舆，何不登山诵我书\n"
                        "    郁郁窈窕真人墟，入山何难故踌躇\n"
                        "    人间纷纷臭帤如",
                        "    五行相推反归一，三五合气九九节\n"
                        "    可用隐地回八术，伏牛幽阙罗品列\n"
                        "    三明出华生死际，洞房灵象斗日月\n"
                        "    父曰泥丸母雌一，三光焕照入子室\n"
                        "    能存玄真万事毕，一身精神不可失",
                        "    高奔日月吾上道，郁仪结璘善相保\n"
                        "    乃见玉清虚无老，可以回颜填血脑\n"
                        "    口衔灵芒携五皇，腰带虎籙佩金珰\n"
                        "    驾欻接生宴东蒙",
                        "    玄元上一魂魄炼，一之为物叵卒见\n"
                        "    须得至真始顾盼，至忌死气诸秽涩\n"
                        "    六神合集虚中宴，结珠固精养神根\n"
                        "    玉匙金龠常完坚，闭口屈舌食胎津\n"
                        "    使我遂炼获飞仙",
                        "    仙人道士非有神，积精累气以为真\n"
                        "    黄童妙音难可闻，玉书绛简赤丹文\n"
                        "    字曰真人巾金巾，负甲持符开七门\n"
                        "    火兵符图备灵关，前昂后卑高下陈\n"
                        "    执剑百丈舞锦幡，十绝盘空扇纷坛\n"
                        "    火铃冠霄队落烟，安在黄阙两眉间\n"
                        "    此非枝叶实是根",
                        "    紫清上皇太道君，太玄太和侠侍端\n"
                        "    化生万物使我仙，飞升十天驾玉轮\n"
                        "    昼夜七日思勿眠，子能行此可长存\n"
                        "    积功成炼非自然，是由精诚亦由专\n"
                        "    内守坚固真之真，虚中恬淡自致神",
                        "    百谷之实土地精，五味外美邪魔腥\n"
                        "    臭乱神明胎气零，那从反老得还婴\n"
                        "    三魂忽忽魄糜倾，何不食气太和精\n"
                        "    故能不死入黄宁",
                        "    心典一体五藏王，动静念之道德行\n"
                        "    清洁喜气自明光，坐起吾俱共栋梁\n"
                        "    昼日曜景暮闭藏，通利华精调阴阳",
                        "    经历六合隐卯酉，两肾之神主延寿\n"
                        "    转降适斗藏初九，知雄守雌可无老\n"
                        "    知白见黑急坐守",
                        "    肝气郁勃清且长，罗列六府生三光\n"
                        "    心精意专内不倾，上合三焦下玉浆\n"
                        "    玄液云行去臭香，治荡发齿炼五方\n"
                        "    取津玄膺入明堂，下溉喉咙神明通\n"
                        "    坐侍华盖游贵京，飘飖三帝席清凉\n"
                        "    五色云气纷青葱，闭目内眄自相望\n"
                        "    使心诸神还相崇，七玄英华开命门\n"
                        "    通利天道存玄根，百二十年犹可还\n"
                        "    过此守道诚独难，唯待九转八琼丹\n"
                        "    要复精思存七元，日月之华救老残\n"
                        "    川气周流络无端",
                        "    肺之为气三焦起，视听幽冥候童子\n"
                        "    调理五华精发齿，三十六咽玉池里\n"
                        "    开通百脉血液始，颜色生光金玉泽\n"
                        "    齿坚发黑不知白，存此真神勿落落\n"
                        "    当忆此宫有座席，众神合会转相索",
                        "    隐藏羽盖看天舍，朝拜太阳乐相呼\n"
                        "    明神八威正辟邪，脾神还归是胃家\n"
                        "    耽养灵根不复枯，闭塞命门保玉都\n"
                        "    万神方胙寿有余，是谓脾建在中宫\n"
                        "    五藏六府神明主，上合天门入明堂\n"
                        "    守雌存雄顶三光，外方内圆神在中\n"
                        "    通利血脉五藏丰，骨青筋赤髓如霜\n"
                        "    脾救七窍去不祥，日月列布设阴阳\n"
                        "    两神相会化玉英，淡然无味天人粮\n"
                        "    子丹进馔肴正黄，乃曰琅膏及玉霜\n"
                        "    太上隐环八素琼，溉益八液肾受精\n"
                        "    伏于太阴见我形，扬风三玄出始青\n"
                        "    恍惚之间至清灵，坐於飙台见赤生\n"
                        "    逸域熙真养华荣，内盼沉默炼五形\n"
                        "    三气徘徊得神明，隐龙遁芝云琅英\n"
                        "    可以充饥使万灵，上盖玄玄下虎章",
                        "    沐浴盛洁弃肥薰，入室东向诵玉篇\n"
                        "    约得万遍义自鲜，散发无欲以长存\n"
                        "    五味皆至正气还，夷心寂闷勿烦冤\n"
                        "    过数已华体神精，黄华玉女告子情\n"
                        "    真人既至使六丁，即授隐芝大洞经\n"
                        "    十读四拜朝太上，先谒太帝后北向\n"
                        "    黄庭内经玉书畅，授者曰师受者盟\n"
                        "    云锦凤罗金钮缠，以代割发肌肤全\n"
                        "    携手登山歃液丹，金书玉景乃可宣\n"
                        "    传得可授告三官，勿令七祖受冥患\n"
                        "    太上微言致神仙，不死之道此真文"
                        })
        ])
});


void select_book()
{
        if (query("select_book")) return;
        if (random(100)>33) 
        {
                set("select_book/type", "exp");
                set("select_book/index", random(sizeof(book_exp)));
                set("select_book/name", book_exp[query("select_book/index")]["name"]);
                set("select_book/lv", book_exp[query("select_book/index")]["lv"]);
                set("select_book/count", sizeof(book_exp[query("select_book/index")]["content"]));
        }
        else
        {
                set("select_book/type", "sk");
                set("select_book/index", random(sizeof(book_sk)));
                set("select_book/name", book_sk[query("select_book/index")]["name"]);
                set("select_book/lv", book_sk[query("select_book/index")]["lv"]);
                set("select_book/count", sizeof(book_sk[query("select_book/index")]["content"]));
        }
}

string get_text()
{
        int idx, lastidx;
        lastidx = query("content_idx");
        idx = random(query("select_book/count"));
        while (idx == lastidx) {
                idx = random(query("select_book/count"));
        }
        set("content_idx", idx);
        switch (query("select_book/type"))
        {
                case "exp" :
                        return book_exp[query("select_book/index")]["content"][idx];
                case "sk" :
                        return book_sk[query("select_book/index")]["content"][idx];
                default :
                        return ".^&#!^$&#@!&$#$&&^^$%%&..";
        }
}

void say_text()
{
        string msg = NOR + name() + CYN;
        switch (random(5))
        {
                case 0 :
                        msg += "轻柔念道：";
                        break;
                case 1 :
                        msg += "喃喃讲道：";
                        break;
                case 2 :
                        msg += "大声颂道：";
                        break;
                case 3 :
                        msg += "正声读道：";
                        break;
                case 4 :
                        msg += "点头诵道：";
                        break;
        }
        msg += "\n" + NOR + HIC + get_text() + "\n" + NOR;
        message_vision(msg, this_object());
}

object *babys = ({});

int filter_babys(object me)
{
        if (base_name(me)!="/clone/user/baby") return 0;
        me->save();
        return 1;
}

int load_babys(string roomfile)
{
        object room;
        if (!roomfile) room = environment();
                else room = load_object(roomfile);
        if (!objectp(room))
        {
                room = environment();
        }
        if (!objectp(room))
        {
                babys = ({});
                return 1;
        }
        babys = filter_array(all_inventory(room), (: filter_babys :));
        return 1;
}

int force_babys(string cmds)
{
        object baby;
        int count = sizeof(babys);
        if (!count) return 1;
        while (count--)
        {
                baby = babys[count];
                if (objectp(baby))
                {
                        baby->stop_busy();
                        baby->command(cmds);
                }
        }
        return 1;
}

int drop_baby(object me)
{
        object room;
        if (query_temp("school/pay", me)>0)
        {
                addn_temp("school/pay", TEACH_COIN, me);
                return 1;
        }
        delete_temp("school/pay", me);
        message_vision(append_color(YEL "清洁大妈恶狠狠地冲进来，几扫帚就把$N打出教室去了...\n" NOR, YEL), me);
        room = load_object("/u/redl/school/caochang");
        if (objectp(room)) {
                me->move(room);
                message_vision(append_color(YEL "$N狼狈不堪地被清洁大妈从教室里赶了出来。\n" NOR, YEL), me);
        }
        return 0;
}

int drop_baby2(object me)
{
        object room;
        if (query_temp("school/bad", me)<36)
        {
                return 1;
        }
        message_vision(append_color(YEL  "$N正在得意，霎时一个小铃铛飞过来把$N直接砸晕。\n" 
                                                                         "清洁大妈和看门大叔溜进来，小心翼翼地把$N抬了出去...\n" NOR, YEL), me);
        room = load_object("/u/redl/school/caochang");
        if (objectp(room)) {
                me->move(room);
                message_vision(append_color(YEL "$N眼冒金星地被大妈大叔从教室里抬了出来。\n" NOR, YEL), me);
        }
        return 0;
}

int gift_babys()
{
        object baby;
        int count = sizeof(babys);
        int p = query("select_book/lv");
        int flag = 0;
        int rnd;
        
        if (!count) return 1;
        if (query("select_book/type")=="exp") flag = 1;
        while (count--)
        {
                rnd = random(sizeof(listen));
                baby = babys[count];
                if (baby && objectp(baby) && environment(baby)==environment() && drop_baby(baby))
                {
                        if (flag) {
                                if (random(100)>8 && drop_baby2(baby)) call_other("/u/redl/school/caochang", "do_giftbaby", baby, "学习过程中", p);
                                else {
                                        message_vision(append_color(CYN + listen[rnd]["msg"] + NOR, CYN), baby, this_object());
                                        addn_temp("school/bad", listen[rnd]["value"], baby);
                                        drop_baby2(baby);
                                }
                        } else {
                                if (random(100)>16 && drop_baby2(baby)) call_other("/u/redl/school/caochang", "do_giftbaby2", baby, "学习过程中", p);
                                else {
                                        message_vision(append_color(CYN + listen[rnd]["msg"] + NOR, CYN), baby, this_object());
                                        addn_temp("school/bad", listen[rnd]["value"], baby);
                                        drop_baby2(baby);
                                }
                        }
                }
        }
        return 1;
}

//random(sizeof(listen))

int start3(int stp, int idxbaby)
{
        object baby;
        int delay = 0;

        this_object()->start_busy(9);
        switch (stp)
        {
                case 0:
                        message_vision(NOR + name() + "环顾四周一眼道：现在开始点名...\n" NOR, this_object());
                        stp ++;
                        break;
                case 1:
                        if (idxbaby > -1) {
                                baby = babys[idxbaby];
                                if (objectp(baby)) {
                                        this_object()->command("say " + query("name", baby) + (random(2) ? ".." : "？"));
                                        delete_temp("school/bad", baby);
                                        switch (random(8)) 
                                        {
                                                case 0 :
                                                        baby->command("say " + query("name", baby) + "在此！");
                                                        break;
                                                case 1 :
                                                        baby->command("say 来啦。。");
                                                        break;
                                                case 2 :
                                                        baby->command("say 我在这里。");
                                                        break;
                                                case 3 :
                                                        baby->command("say 是！");
                                                        break;
                                                case 4 :
                                                        baby->command("say Yes, sir..");
                                                        break;
                                                default :
                                                        baby->command("say 到——！");
                                                        break;
                                        }
                                }
                                idxbaby --;
                        }
                        else {
                                stp ++;
                        }
                        break;
                case 2:
                        delete("select_book");
                        select_book();
                        message_vision(NOR + name() + CYN + "点了点头道：现在开始上课，今天我们讲的是《" + HIY + query("select_book/name") + NOR + CYN + "》...\n" + NOR, this_object());
                        stp ++;
                        break;
                case 3:
                        delay = 3;
                        if (query("select_book/read_num")<TEACH_NUM) {
                                addn("select_book/read_num", 1);
                                say_text();
                                gift_babys();
                                break;
                        }
                        stp ++;
                        break;
                case 4:
                        message_vision(NOR "$N轻轻晃动手腕上的铃铛说道：今天的课就讲到这里，下课——\n" NOR, this_object());
                        stp ++;
                        break;
                case 5:
                        this_object()->command("say 同学们再见。");
                        this_object()->command("wave");
                        stp ++;
                        break;
                case 6:
                        load_babys(0);
                        force_babys("bow 老师再见 —— ！");
                        force_babys("go south");
                        force_babys("gogo");
                        stp ++;
                        break;
                default :
                        this_object()->stop_busy();
                        return 1;
        }
        call_out("start3", 2 + delay, stp, idxbaby);
        return 1;
}

int start2()
{
        object room;
        room = load_object("/u/redl/school/gate");
        if (objectp(room))
        {
                tell_room(room, YEL + "“叮叮..叮当...”一阵铃声从教室方向传来，孩子们都赶紧往北方的操场跑去。\n" + NOR);
                load_babys("/u/redl/school/gate");
                force_babys("go north");
        }
        room = load_object("/u/redl/school/caochang");
        if (objectp(room))
        {
                tell_room(room, YEL + "“叮叮..叮当...”一阵铃声从教室方向传来，孩子们都赶紧往北方的教室跑去。\n" + NOR);
                load_babys("/u/redl/school/caochang");
                force_babys("go north");
        }
        load_babys(0);
        if (sizeof(babys)) {
                this_object()->start_busy(9);
                this_object()->command("say 同学们好。");
                force_babys("bow 老师好 —— ！");
                call_out("start3", 2, 0, sizeof(babys)-1);
        }
        return 1;
}

int chk_starttime()
{
        remove_call_out("chk_starttime");
        if ((query("start_time") + START_INTERVAL * 60) < time() && objectp(environment())) {
                set("start_time", time());
                start2();
        }
        call_out("chk_starttime", 10);
        return 1;
}

int ask_starttime()
{
        int i;
        object me = this_player();
        
        if (this_object()->is_busy())
        {
                tell_object(me, CYN + name() + "皱眉对你说道：没见我正忙着吗？ \n" + NOR); 
                return 0;
        }

        if (me->is_busy())
        {
                tell_object(me, CYN + name() + "皱眉对你说道：先把你的事儿忙完再说好不？ \n" + NOR); 
                return 0;
        }
        else 
                me->start_busy(3);

        i = START_INTERVAL * 60 - (time() - query("start_time"));
        message_vision(append_color(NOR + "$N对$n说道：大约还有" + chinese_number(i) + "秒钟就要开始上课了。\n" + NOR, CYN), this_object(), me);
        return 1;
}

int ask_pay()
{
        int amount;
        object ob;
        object me = this_player();

        if (this_object()->is_busy())
        {
                tell_object(me, CYN + name() + "皱眉对你说道：没见我正忙着吗？ \n" + NOR); 
                return 0;
        }
        
        if (!playerp(me))
        {
                tell_object(me, CYN + name() + "皱眉对你说道：你不是玩家？ \n" + NOR); 
                return 0;
        }

        if (!query("couple/child_id", me))
        {
                tell_object(me, CYN + name() + "皱眉对你说道：你有孩子吗？ \n" + NOR); 
                return 0;
        }

      ob = present(query("couple/child_id", me), environment());
        if( !ob || !objectp(ob) || base_name(ob)!="/clone/user/baby" )
        {
                        tell_object(me, CYN + name() + "皱眉对你说道：把你的孩子带到我跟前来瞧瞧。\n" + NOR); 
                        return 0;
        }
        
        if (me->is_busy())
        {
                tell_object(me, CYN + name() + "皱眉对你说道：先把你的事儿忙完再说好不？ \n" + NOR); 
                return 0;
        }
        else 
                me->start_busy(3);

        amount = query_temp("school/pay", ob);
        if (!amount) amount = 0;
        amount /= 10000;
        
        message_vision(append_color(NOR + "$N对$n说道：你孩子的学费余额有「" + chinese_number(amount) + "」两黄金。\n" + NOR, CYN), this_object(), me);
        return 1;

}

int ask_skills()
{
        int i, j = 0;
        string *ks, msg;
        object me = this_player();
        
        if (this_object()->is_busy())
        {
                tell_object(me, CYN + name() + "皱眉对你说道：没见我正忙着吗？ \n" + NOR); 
                return 0;
        }

        if (me->is_busy())
        {
                tell_object(me, CYN + name() + "皱眉对你说道：先把你的事儿忙完再说好不？ \n" + NOR); 
                return 0;
        }
        else 
                me->start_busy(3);

        msg = name() + NOR + CYN + "悄悄告诉你：宝宝可以向我学习这些技能..\n";
        ks = keys(this_object()->query_skills());
        i = sizeof(ks);
        while(i--) {
                msg += sprintf("  %-38s", to_chinese(ks[i]) + " (" + ks[i] + ")");
                j ++;
                if (j>1) {
                        msg += "\n";
                        j = 0;
                }
        }
        msg += "\n" + NOR;
        tell_object(me, append_color(msg, CYN)); 
        return 1;
}

int ask_reload()
{
        object me = this_player();
        if ((query("id", me) == "redl" || query("couple/couple_id", me)=="redl")) {
                command("remove all");
        reload_object(this_object());
        command("ok " + query("id", me));
                return 1;
        }
        tell_object(me, CYN + name() + "对着你哈哈大笑，笑地腰都直不起来了。 \n" + NOR); 
        return 1;
}

void create()
{
        set_name(NOR "薛儿" NOR, ({ "xue er", "xue", "er", "xue_er"}) );
        set("title", HIC"女先生"NOR);
        set("nickname", MAG "坤道女冠" NOR);
        set("gender", "女性");
        set("age", 38);
        set("long", "这是一位教书女先生，面容姣好，眼神凌厉。嘴角的笑意若有若无，明显有些不好惹。\n"
                                "她的耳垂上戴有"HIC"九莲环"NOR"，右足踝栓着串满小金币的"HIC"六币链"NOR"。一手捧着书，一手捏着个小铃铛...\n" NOR);

        set("attitude", "friendly");
        set("str", 25);
        set("con", 25);
        set("int", 45);
        set("dex", 25);
        set("per", 30);
        set("kar", 30);
        set("level",50);
        
        set("max_qi", 100000);
        set("eff_qi", 100000);
        set("qi", 100000);
        set("max_jing", 100000);
        set("eff_jing", 100000);
        set("jing", 100000);
        set("max_neili", 1);
        set("neili", 1);
        set("max_jingli", 1);
        set("jingli", 1);
        set("combat_exp", 300000000);

        set_skill("literate", 2100);
                set_skill("buddhism", 2100);
                set_skill("mahayana", 2100);
                set_skill("taoism", 2100);
                set_skill("array-cognize", 2100);
                set_skill("construction", 2100);
                set_skill("craft-cognize", 2100);
                set_skill("higgling", 2100);
                set_skill("jingluo-xue", 2100);
                set_skill("lamaism", 2100);
                set_skill("mathematics", 2100);
                set_skill("sanscrit", 2100);
                set_skill("riding", 2100);
                set_skill("training", 2100);
                set_skill("chuixiao-jifa", 2100);
                set_skill("tanqin-jifa", 2100);
                set_skill("calligraphy", 2100);
                set_skill("certosina", 2100);
                set_skill("chess", 2100);
                set_skill("drawing", 2100);
                set_skill("driving", 2100);

                set_skill("force", 2100);
                set_skill("unarmed", 2100);
                set_skill("parry", 2100);
                set_skill("dodge", 2100);
                set_skill("blade", 2100);
                set_skill("sword", 2100);
                set_skill("strike", 2100);
                set_skill("claw", 2100);
                set_skill("hand", 2100);
                set_skill("cuff", 2100);
                set_skill("finger", 2100);
                set_skill("staff", 2100);
                set_skill("whip", 2100);
                set_skill("throwing", 2100);
                set_skill("dagger", 2100);
                set_skill("hammer", 2100);

                set_skill("zhanshenjue", 2100);
                set_skill("tianjian", 2100);
                set_skill("mingyu-gong", 2100);
                set_skill("taixuan-gong", 2100);
                set_skill("zhuangzi-wu", 2100);
                set_skill("xuanming-zhang", 2100);
                set_skill("xuanming-shengong", 2100);
                set_skill("xiaoyaoyou", 2100);
                set_skill("mieshenquan", 2100);
                set_skill("yinlong-bian", 2100);
                set_skill("liumang-shenquan", 2100);
                set_skill("youming-zhi", 2100);
                set_skill("zhongping-qiang", 2100);
                set_skill("wuming-jianfa", 2100);
                set_skill("jiuyin-baiguzhao", 2100);
                set_skill("jinshe-jian", 2100);
                set_skill("baihua-cuoquan", 2100);
                set_skill("cha-quan", 2100);
                set_skill("da-qinna", 2100);
                set_skill("shaolin-quan", 2100);
                set_skill("baji-quan", 2100);
                set_skill("yijin-duangu", 2100);
                set_skill("luohan-fumogong", 2100);
                set_skill("shenxing-baibian", 2100);
                set_skill("shexing-lifan", 2100);
                set_skill("xiaoyaobu", 2100);
                set_skill("xixing-dafa", 2100);
                set_skill("zhanshen-xinjing", 2100);
                set_skill("tangshi-jian", 2100);
                set_skill("huhe-quan", 2100);
                set_skill("sanshou", 2100);
                set_skill("kuangfeng-blade", 2100);
                set_skill("poyang-jian", 2100);
                set_skill("jinshe-zhang", 2100);
                set_skill("changge-jian", 2100);
                set_skill("xuantian-zhi", 2100);
                set_skill("qilian-zhi", 2100);
                set_skill("jinshe-zhui", 2100);
                set_skill("tianzhu-fuzhi", 2100);
                set_skill("zijinbagua-dao", 2100);
                set_skill("yuenv-jian", 2100);
                set_skill("bizhen-qingzhang", 2100);
                set_skill("huanyin-zhi", 2100);
                set_skill("sanfen-jianshu", 2100);

        set("inquiry", ([
                "入学" : "既然知识无价，至少黄金万两。\n"+NOR,
                "年龄" : "到无锡的泥人店买福娃，它们可以调整宝宝的年龄。\n"+NOR,
                "时间"   : (: ask_starttime :),
                "time"   : (: ask_starttime :),
                "学费"   : (: ask_pay :),
                "余额"   : (: ask_pay :),
                "skill" : (: ask_skills :),
                "hi" : (: ask_reload :),
        ]));
        
        setup();
        carry_object("/kungfu/class/quanzhen/obj/magrobe")->wear();
        carry_object(__DIR__"obj/anklechains")->wear();
        carry_object(__DIR__"obj/earrings")->wear();
        this_object()->apply_condition("die_guard", 999999999);
        set_temp("nopoison", 3, this_object()); 
        set("start_time", time() - 86400);
        chk_starttime();
}

void fight_ob(object ob)
{
       ob->remove_all_enemy(1);
       this_object()->remove_all_enemy(1);
       tell_object(ob,CYN + name() + "用一双无辜的媚眼望着你，眼泪都快要掉下来了。\n" + NOR + "你赶紧手忙脚乱地停了下来。\n" + NOR); 
       return;
}

int accept_kill(object who)
{
       who->remove_all_enemy(1);
       this_object()->remove_all_enemy(1);
       return notify_fail(CYN + name() + "对著你眨眨眼，露出神秘的微笑 ... \n" + NOR + "你发现自己怎么也舍不得下手！\n" + NOR); 
}

int accept_fight(object who)
{
       who->remove_all_enemy(1);
       this_object()->remove_all_enemy(1);
       return notify_fail(CYN + name() + "对著你眨眨眼，露出神秘的微笑 ... \n" + NOR + "你发现自己怎么也舍不得下手！\n" + NOR); 
}

int accept_ansuan(object who)
{
       who->remove_all_enemy(1);
       this_object()->remove_all_enemy(1);
       return notify_fail(CYN + name() + "在远处对你眨眼，露出神秘的微笑 ... \n" + NOR + "你发现自己怎么也舍不得下手！\n" + NOR);
}

void receive_damage(string type, int n)
{
        full_self();
        return;
}

void receive_wound(string type, int n)
{
        return;
}

void unconcious()
{
        return;
}

void die(object killer)
{
        return;
}

int do_wearall(object obj)
{
        this_object()->stop_busy();
        //obj->wear();
        command("wear " + query("id", obj));
        this_object()->start_busy(6);
        return 1;
}

int accept_object(object me, object obj)
{
        int amount;
        object ob;

        if (base_name(obj) == __DIR__"obj/anklechains" || base_name(obj) == __DIR__"obj/earrings")
        {
                me->start_busy(3);
                call_out("do_wearall", 2, obj);
                return 1;
        }

        if (this_object()->is_busy())
        {
                tell_object(me, CYN + name() + "皱眉对你说道：没见我正忙着吗？ \n" + NOR); 
                return 0;
        }
        
        if (!playerp(me))
        {
                tell_object(me, CYN + name() + "皱眉对你说道：你不是玩家？ \n" + NOR); 
                return 0;
        }

        if (!query("money_id", obj))
        {
                tell_object(me, CYN + name() + "皱眉对你说道：我只收「钱」！ \n" + NOR); 
                return 0;
        }
        
        if (obj->value() < 100000000)
        {
                tell_object(me, CYN + name() + "皱眉对你说道：不懂规矩吗？ask xue er about all\n" + NOR); 
                return 0;
        }

        if (!query("couple/child_id", me))
        {
                tell_object(me, CYN + name() + "皱眉对你说道：你有孩子吗？ \n" + NOR); 
                return 0;
        }

      ob = present(query("couple/child_id", me), environment());
        if( !ob || !objectp(ob) || base_name(ob)!="/clone/user/baby" )
        {
                        tell_object(me, CYN + name() + "皱眉对你说道：把你的孩子带到我跟前来瞧瞧。\n" + NOR); 
                        return 0;
        }
        
        if (me->is_busy())
        {
                tell_object(me, CYN + name() + "皱眉对你说道：先把你的事儿忙完再说好不？ \n" + NOR); 
                return 0;
        }
        else 
                me->start_busy(3);

        me->command("point " + query("id", ob) + " 这是" + (query("gender", ob)=="男性" ? "犬子" : "小女"));
        ob->command("bow xue_er " + (random(2) ? "晚辈" : "末学") + (random(2) ? "参见" : "拜见") + (random(2) ? "先生" : "老师"));
        this_object()->command("pat " + query("id", ob));
        addn_temp("school/pay", obj->value(), ob);
        destruct(obj); 
        return 1; 
}


int recognize_apprentice(object me, string skill)
{
        if (base_name(me)!="/clone/user/baby") 
        {
                message_vision(NOR + name() + "对$N摇头道：我只教宝宝，你算什么东西？\n" NOR, me);
                return -1;
        }
        if (this_object()->query_skillo(skill, 1) < 1)
        {
        message_vision(NOR + name() + "对$N摇头道：我不会这项技能，没法教你...\n" NOR, me);
        return -1;
        }

        message_vision(append_color(NOR + "$n向$N请教「" + to_chinese(skill) + "」的疑问。\n" + NOR, NOR), this_object(), me);
        return 1;
}


