#include <ansi.h>

string *action_msg = ({
        "葵花太监低头沉思了一会，突然惊讶的说：“",
        "葵花太监跺了跺脚：“",
        "葵花太监悠悠的说：“",        
        "葵花太监翻出一本册子：“",
        "葵花太监懒懒的伸了一下腰：“",
        "葵花太监目光盯向遥远的远方，若有所思的说：“",
        "葵花太监冷冷一笑：“",
        "葵花太监咬着牙恶狠狠的说：“",
        "葵花太监随意看看了四周，对你说：“",
        "葵花太监皱着眉头慢慢说：“",
        "葵花太监一字一字的说：“",
        "葵花太监头也不抬，随口说道：“",
        "葵花太监看了你一眼，冷笑着说：“",
        "葵花太监怒气冲冲的说：“",
        "葵花太监忧心忡忡的说：“",
        "葵花太监按着指关节，狠狠的说：“",
});

string *say_msg = ({
        "我怎么还没有name呢？你帮我type它一个来。”",
        "你跟着我也有一阵了，难道还不知道我现在需要什么？name！快去给我type来！”",
        "东西嘛，我基本都有了，不过name还没有，你能去type来么？”",
        "听说有一样东西叫name，你去给我type来看看！”",
        "人人都说name这个东西最近很紧缺，你快去给我type来备用！”",
        "name是不是很难找？怎么我最近老见不到，你去type一个来给我看看！”",
        "大内李总管最近需要name，你赶快去type来给我。”",
        "我本来不想要name，可是小皇帝却想看看这样东西，这个任务就交给你了。”",
        "稀奇的东西看多了，我想看看name，能type来吧？”",
        "如果连你都type不回来name，看来下次只有我亲自出马了，别让我失望！”",
        "金山银山再多，缺了name也不行，快去type吧。”",
        "不怕缺金少银，就怕没有name，你明白我的意思了？”",
        "刘娘娘也真是贵人多事，什么不好要，偏偏要name，你就去type一个来吧。”",
        "天下大部分东西我都有了，不过少了一样name，快去快回，type来了有赏！”",
        "name！我现在急需！快去type，type不到不要回来见我！”",
        "name这个东西很好玩么？怎么人人都想要？我倒是想看看！”",
        "怎么人人都不喜欢name，我觉得挺好的啊，你去type来给我，有赏！”",
});

string *kill_msg = ({
        "name这个人不听从我的号令，你去type了吧，利索点！”",
        "我很想念name呐，好久不见了，不知道是否还健在，你把头给我弄来看看血色如何就成！”",
        "听说name现在又长胖了，眼睛都眯成一条缝了，把头给我弄来看看。”",
        "人人都说name是个高手，我想也不见得就是，你能杀掉他吧？”",
        "name的骨头硬么？不知道是不是比刀硬，你去砍砍他得脖子看能不能砍断！”",
        "不见得人人都不怕死，像name这样的人是很少得，不过他还是得死！”",
        "name竟然说我不是男人，这种人还能活在世上么？”",
        "我听说有人在散布不利于我的留言，name嫌疑最大，宁可错杀一千，不可放过一个！”",
        "有些人活着还不如死了的好，比如name，就是一个光吃饭不干活的饭桶！”",
        "朝廷最近忙着清查叛贼，name这个人平时就不老实，该收拾他了！”",
        "听说name平时最吝啬，其实东西放我这里最安全，我就帮name保管一下头颅吧！”",
        "该死去的人，永远也不该活下去，name就不该活下去，明白我的意思吧？”",
        "现在江湖宵小越来越多，不把name这样的人杀几个，震不住别人！”",
});


string query_khmsg(string type,string name)
{
        string msg,msg1;
        msg = "";
        msg1 = "";
        msg += action_msg[random(sizeof(action_msg))];
        if (type == "寻") {
                msg1 = say_msg[random(sizeof(say_msg))];
                msg1 = replace_string(msg1,"name"," " + name + " ");
                msg1 = replace_string(msg1,"type","找");
        } else
        {
                msg1 = kill_msg[random(sizeof(kill_msg))];
                msg1 = replace_string(msg1,"name"," " + name + " ");
                msg1 = replace_string(msg1,"type","杀");
        }
        msg += msg1;
        return msg;
}
