// This program is a part of NT MudLIB
// zhoutiand.c

// #pragma optimize
// #pragma save_binary

#include <ansi.h>

inherit F_CLEAN_UP;

/*
nosave mapping data = ([
        "attack" : 1640,
        "max_neili" : 74160,
        "da_power" : 10,
        "reduce_damage" : 10,
        "avoid_poison" : 7,
        "research_times" : 100,
        "derive_effect" : 205,
        "max_jing" : 4540,
        "research_effect" : 193,
        "food" : 1620,
        "max_jingli" : 45800,
        "dex" : 172,
        "int" : 144,
        "max_experience" : 108370,
        "armor" : 990,
        "damage" : 1840,
        "water" : 1410,
        "con" : 162,
        "kar" : 11,
        "practice_effect" : 180,
        "reflect" : 12,
        "jiali" : 4440,
        "max_potential" : 210910,
        "str" : 216,
        "finish" : 1,
        "magic_find" : 11,
        "weapon" : 30,
        "max_qi" : 125630,
        "defense" : 150,
]);
*/
nosave mapping data = ([
        "attack" : 1800,
        "max_neili" : 200000,
        "da_power" : 10,
        "reduce_damage" : 10,
        "avoid_poison" : 10,
        "avoid_weak" : 10,
        "research_times" : 100,
        "derive_effect" : 210,
        "max_jing" : 5000,
        "research_effect" : 210,
        "food" : 5000,
        "max_jingli" : 50000,
        "dex" : 180,
        "int" : 180,
        "max_experience" : 200000,
        "armor" : 2000,
        "damage" : 2000,
        "water" : 5000,
        "con" : 180,
        "kar" : 15,
        "practice_effect" : 210,
        "reflect" : 20,
        "jiali" : 5000,
        "max_potential" : 300000,
        "str" : 220,
        "finish" : 1,
        "magic_find" : 20,
        "unarmed_damage" : 2000,
        "max_qi" : 150000,
        "defense" : 1800,
        "max_encumbrance" : 400000,
]);

int query_jingmai_buff(string key)
{
        return data[key];
}
string *x_zhoutian = ({
        "阴跷脉", "阳跷脉", "阴维脉", "阳维脉", "带脉", "冲脉", "任外脉", "督外脉", "经外奇脉",
});

string *d_zhoutian = ({
        "手太阴脉", "手太阳脉", "足太阴脉", "足太阳脉", "手少阳脉", "手少阴脉", "足少阴脉",
        "足少阳脉", "手阳明脉", "足阳明脉", "手厥阴脉", "足厥阴脉",
});

string *zhoutian = ({
        "阴跷脉", "阳跷脉", "阴维脉", "阳维脉", "带脉", "冲脉", "任外脉", "督外脉", "经外奇脉",
        "手太阴脉", "手太阳脉", "足太阴脉", "足太阳脉", "手少阳脉", "手少阴脉", "足少阴脉",
        "足少阳脉", "手阳明脉", "足阳明脉", "手厥阴脉", "足厥阴脉",
});


/*  冲穴效果代码列表
QI:N                   气血上限+N       /adm/daemons/race/human.c  jingmai
NEI:N                  内力上限+N       /clone/user/user.c         jingmai
ATK:N                  命中等级+N       combatd.c                  jingmai/attack
DMG:N                  伤害等级+N       power.c combatd.c          jingmai/damage
AMR:N                  防护等级+N       power.c combatd.c          jingmai/armor
WEAPON:N               兵器威力+N%      power.c & combatd.c        jingmai/weapon
JIALI:N                加力上限+N       /cmds/.. /jiali.c          jingmai/jiali
JING:N                 精力上限+N       /clone/user/user.c         jingmai
MAR:N                  体会上限+N       /clone/user/user.c         jingmai
POT:N                  潜能上限+N       /clone/user/user.c         jingmai
MINGSI:N               冥思效果+N%      /cmds/.../reflect.c        jingmai/reflect
FOOD:N                 食物上限+N       /feature/damage.c          jingmai/food
WATER:N                饮水上限+N       /feature/damage.c          jingmai/water
KANGDU:N               抗毒提升+N%      /feature/condition.c       jingmai/avoid_poison
_STR:N                 后天臂力+N       /feature/attribute.c       jingmai/str
_DEX:N                 后天身法+N       /feature/attribute.c       jingmai/dex
_INT:N                 后天悟性+N       /feature/attribute.c       jingmai/int
_CON:N                 后天根骨+N       /feature/attribute.c       jingmai/con
STR:N                  先天臂力+N       直接增加
DEX:N                  先天身法+N       直接增加
INT:N                  先天悟性+N       直接增加
CON:N                  先天臂力+N       直接增加
ADDPOT:N               增加潜能+N       直接增加
                       增加负重
                       增加福缘         power.c combatd.c          jingmai/kar
                       增加气运         power.c combatd.c          jingmai/magic_find
                       增加研究次数     /cmds/skill/yanjiu.c       jingmai/research_times
                       增加研究效率     /cmds/skill/yanjiu.c       jingmai/research_effect   %
                       提高汲取效率     /cmds/skill/jiqu.c         jingmai/derive_effect     %

*/

mapping tongren_list = ([
                     //({ 经脉名, 穴位名，冲穴效果，消耗内力})
        // 阴跷脉
        "tongren a1"    :  ({"阴跷脉","然谷穴", "QI:50","100"}),
        "tongren a2"    :  ({"阴跷脉","照海穴", "NEI:20","150"}),
        "tongren a3"    :  ({"阴跷脉","交信穴", "ATK:10","200"}),
        "tongren a4"    :  ({"阴跷脉","阴谷穴", "DMG:10","200"}),
        "tongren a5"    :  ({"阴跷脉","横谷穴", "AMR:10","200"}),
        "tongren a6"    :  ({"阴跷脉","气冲穴", "JIALI:50","200"}),
        "tongren a7"    :  ({"阴跷脉","乳根穴", "QI:30","100"}),
        "tongren a8"    :  ({"阴跷脉","盆缺穴", "JING:20","200"}),
        "tongren a9"    :  ({"阴跷脉","人迎穴", "MAR:10","100"}),
        "tongren a10"   :  ({"阴跷脉","晴明穴", "QI:10","100"}),
        "tongren a11"   :  ({"阴跷脉","不容穴", "AMR:10","100"}),
        "tongren a12"   :  ({"阴跷脉","梁门穴", "QI:10","100"}),
        "tongren a13"   :  ({"阴跷脉","横鼻穴", "QI:20","100"}),
        "tongren a14"   :  ({"阴跷脉","足三里穴", "QI:30","100"}),
        "tongren a15"   :  ({"阴跷脉","丰隆穴", "QI:40","100"}),
        "tongren a16"   :  ({"阴跷脉","解溪穴", "POT:20","100"}),
        "tongren a17"   :  ({"阴跷脉","冲阳穴", "NEI:10","100"}),
        "tongren a18"   :  ({"阴跷脉","属兑穴", "NEI:20","150"}),

        // 阳跷脉
        "tongren b1"    :  ({"阳跷脉","申脉穴", "QI:500","300"}),
        "tongren b2"    :  ({"阳跷脉","仆参穴", "QI:600","300"}),
        "tongren b3"    :  ({"阳跷脉","跗阳穴", "QI:700","500"}),
        "tongren b4"    :  ({"阳跷脉","居髎穴", "QI:800:AMR:10","900"}),
        "tongren b5"    :  ({"阳跷脉","臑俞穴", "QI:500:MAR:50","800"}),
        "tongren b6"    :  ({"阳跷脉","肩髃穴", "QI:300","300"}),
        "tongren b7"    :  ({"阳跷脉","地谷穴", "QI:600","300"}),
        "tongren b8"    :  ({"阳跷脉","巨仓穴", "QI:100","300"}),
        "tongren b9"    :  ({"阳跷脉","巨髎穴", "QI:100:ATK:10","400"}),
        "tongren b10"   :  ({"阳跷脉","承泣穴", "QI:400:NEI:40","400"}),
        "tongren b11"   :  ({"阳跷脉","风池穴", "QI:600","300"}),
        "tongren b12"   :  ({"阳跷脉","攒竹穴", "QI:200","300"}),
        "tongren b13"   :  ({"阳跷脉","眉冲穴", "QI:400","300"}),
        "tongren b14"   :  ({"阳跷脉","曲差穴", "QI:700:DMG:10","1200"}),
        "tongren b15"   :  ({"阳跷脉","五处穴", "QI:200:DMG:10","1200"}),
        "tongren b16"   :  ({"阳跷脉","承光穴", "QI:800:AMR:20","2000"}),
        "tongren b17"   :  ({"阳跷脉","通天穴", "QI:1200","1000"}),
        "tongren b18"   :  ({"阳跷脉","络却穴", "QI:500:MAR:100","1100"}),
        "tongren b19"   :  ({"阳跷脉","玉枕穴", "QI:400:POT:200","1200"}),
        "tongren b20"   :  ({"阳跷脉","天柱穴", "QI:800","500"}),
        "tongren b21"   :  ({"阳跷脉","承山穴", "QI:200","200"}),
        "tongren b22"   :  ({"阳跷脉","昆仑穴", "QI:500","300"}),
        "tongren b23"   :  ({"阳跷脉","飞扬穴", "QI:400","300"}),

        // 阴维脉
        "tongren c1"    :  ({"阴维脉","府舍穴", "NEI:120","800"}),
        "tongren c2"    :  ({"阴维脉","大横穴", "NEI:300:QI:50","800"}),
        "tongren c3"    :  ({"阴维脉","阳交穴", "NEI:100","800"}),
        "tongren c4"    :  ({"阴维脉","腹衰穴", "NEI:150","800"}),
        "tongren c5"    :  ({"阴维脉","期门穴", "NEI:400","800"}),
        "tongren c6"    :  ({"阴维脉","廉泉穴", "NEI:300","800"}),
        "tongren c7"    :  ({"阴维脉","极泉穴", "NEI:200","800"}),
        "tongren c8"    :  ({"阴维脉","青灵穴", "NEI:800:ATK:20","4000"}),
        "tongren c9"    :  ({"阴维脉","少海穴", "NEI:700:DMG:10","3400"}),
        "tongren c10"   :  ({"阴维脉","灵道穴", "NEI:100:QI:100","800"}),
        "tongren c11"   :  ({"阴维脉","通里穴", "NEI:200","800"}),
        "tongren c12"   :  ({"阴维脉","阴郄穴", "NEI:700","1500"}),
        "tongren c13"   :  ({"阴维脉","神门穴", "NEI:200","800"}),
        "tongren c14"   :  ({"阴维脉","少府穴", "NEI:500","800"}),
        "tongren c15"   :  ({"阴维脉","少冲穴", "NEI:500","800"}),
        "tongren c16"   :  ({"阴维脉","筑宾穴", "NEI:300","800"}),

        // 阳维脉
        "tongren d1"    :  ({"阳维脉","天髎穴", "POT:200","600"}),
        "tongren d2"    :  ({"阳维脉","臑俞穴", "POT:100","600"}),
        "tongren d3"    :  ({"阳维脉","肩井穴", "POT:200:MAR:200","2000"}),
        "tongren d4"    :  ({"阳维脉","阳交穴", "POT:600","600"}),
        "tongren d5"    :  ({"阳维脉","头维穴", "POT:400:JING:200","3000"}),
        "tongren d6"    :  ({"阳维脉","金门穴", "POT:400:NEI:200","1200"}),
        "tongren d7"    :  ({"阳维脉","阳白穴", "POT:300:QI:100","1000"}),
        "tongren d8"    :  ({"阳维脉","本神穴", "POT:200:JING:300","2200"}),
        "tongren d9"    :  ({"阳维脉","头临泣穴", "POT:200","600"}),
        "tongren d10"   :  ({"阳维脉","目窗穴", "POT:500:MINGSI:1","5500"}),
        "tongren d11"   :  ({"阳维脉","正营穴", "POT:500","600"}),
        "tongren d12"   :  ({"阳维脉","脑空穴", "POT:700:AMR:20","3500"}),
        "tongren d13"   :  ({"阳维脉","承灵穴", "POT:200","600"}),
        "tongren d14"   :  ({"阳维脉","风池穴", "POT:300:ATK:10","2200"}),
        "tongren d15"   :  ({"阳维脉","风府穴", "POT:500","600"}),
        "tongren d16"   :  ({"阳维脉","哑门穴", "POT:300","600"}),
        "tongren d17"   :  ({"阳维脉","云门穴", "POT:100:NEI:200","1200"}),
        "tongren d18"   :  ({"阳维脉","尺泽穴", "POT:100","600"}),
        "tongren d19"   :  ({"阳维脉","孔最穴", "POT:400:JING:200","2000"}),
        "tongren d20"   :  ({"阳维脉","列缺穴", "POT:300","600"}),
        "tongren d21"   :  ({"阳维脉","经渠穴", "POT:600","600"}),
        "tongren d22"   :  ({"阳维脉","太渊穴", "POT:100:MINGSI:2","12000"}),
        "tongren d23"   :  ({"阳维脉","鱼际穴", "POT:400","600"}),
        "tongren d24"   :  ({"阳维脉","少商穴", "POT:300","600"}),

        // 带脉
        "tongren e1"    :  ({"带脉","带脉穴", "QI:200:NEI:50","1000"}),
        "tongren e2"    :  ({"带脉","五枢穴", "ATK:20","1200"}),
        "tongren e3"    :  ({"带脉","维道穴", "JIALI:50","1200"}),
        "tongren e4"    :  ({"带脉","天冲穴", "AMR:10","1200"}),
        "tongren e5"    :  ({"带脉","浮白穴", "WEAPON:10","6000"}),
        "tongren e6"    :  ({"带脉","头窍阴穴", "_INT:2","4000"}),
        "tongren e7"    :  ({"带脉","完骨穴", "NEI:100","1000"}),
        "tongren e8"    :  ({"带脉","本神穴", "JIALI:20","1200"}),
        "tongren e9"    :  ({"带脉","阳白穴", "QI:50","1000"}),
        "tongren e10"   :  ({"带脉","头临泣穴", "JIALI:20","1800"}),
        "tongren e11"   :  ({"带脉","目窗穴", "JIALI:30","1800"}),
        "tongren e12"   :  ({"带脉","正营穴", "JIALI:40","1800"}),
        "tongren e13"   :  ({"带脉","承灵穴", "JIALI:10","1800"}),
        "tongren e14"   :  ({"带脉","脑空穴", "JIALI:60","1800"}),
        "tongren e15"   :  ({"带脉","外丘穴", "JIALI:30","1800"}),
        "tongren e16"   :  ({"带脉","光明穴", "JIALI:30","1800"}),
        "tongren e17"   :  ({"带脉","阳辅穴", "JIALI:80","1800"}),
        "tongren e18"   :  ({"带脉","悬钟穴", "JIALI:10","1800"}),
        "tongren e19"   :  ({"带脉","丘墟穴", "JIALI:40","1800"}),

        // 冲脉
        "tongren f1"    :  ({"冲脉","会阴穴", "QI:200","1000"}),
        "tongren f2"    :  ({"冲脉","阴交穴", "AMR:10","1000"}),
        "tongren f3"    :  ({"冲脉","气冲穴", "AMR:10","1000"}),
        "tongren f4"    :  ({"冲脉","横骨穴", "ATK:20","1000"}),
        "tongren f5"    :  ({"冲脉","大赫穴", "JIALI:50","1000"}),
        "tongren f6"    :  ({"冲脉","气穴", "JING:20","1000"}),
        "tongren f7"    :  ({"冲脉","四满穴", "JING:30","1000"}),
        "tongren f8"    :  ({"冲脉","中注穴", "AMR:20","2000"}),
        "tongren f9"    :  ({"冲脉","盲俞穴", "AMR:30","3000"}),
        "tongren f10"   :  ({"冲脉","商曲穴", "AMR:40","4000"}),
        "tongren f11"   :  ({"冲脉","石关穴", "NEI:50","1000"}),
        "tongren f12"   :  ({"冲脉","阴都穴", "QI:100","1000"}),
        "tongren f13"   :  ({"冲脉","通谷穴", "FOOD:100","1000"}),
        "tongren f14"   :  ({"冲脉","幽门穴", "FOOD:200","1000"}),
        "tongren f15"   :  ({"冲脉","关门穴", "WATER:100","1000"}),
        "tongren f16"   :  ({"冲脉","太乙穴", "WATER:200","1000"}),
        "tongren f17"   :  ({"冲脉","归来穴", "ADDPOT:600000","1000"}),
        "tongren f18"   :  ({"冲脉","大巨穴", "KANGDU:1","4000"}),
        "tongren f19"   :  ({"冲脉","天枢穴", "KANGDU:2","10000"}),
        "tongren f20"   :  ({"冲脉","气舍穴", "QI:20","1000"}),
        "tongren f21"   :  ({"冲脉","水突穴", "AMR:40","4000"}),
        "tongren f22"   :  ({"冲脉","水道穴", "DMG:10","4000"}),
        "tongren f23"   :  ({"冲脉","外陵穴", "DMG:30","22000"}),
        "tongren f24"   :  ({"冲脉","滑肉门穴", "_DEX:6","8000"}),

        // 督外脉
        "tongren g1"    :  ({"督外脉","长强穴", "JIALI:60","4000"}),
        "tongren g2"    :  ({"督外脉","腰俞穴", "JIALI:20","4000"}),
        "tongren g3"    :  ({"督外脉","阳关入命门穴", "JIALI:30","4000"}),
        "tongren g4"    :  ({"督外脉","上行悬枢穴", "JIALI:40","4000"}),
        "tongren g5"    :  ({"督外脉","脊中穴", "JIALI:100","4000"}),
        "tongren g6"    :  ({"督外脉","至中枢穴", "JIALI:20","4000"}),
        "tongren g7"    :  ({"督外脉","筋缩穴", "JIALI:10","4000"}),
        "tongren g8"    :  ({"督外脉","至阳归灵台穴", "JIALI:40","4000"}),
        "tongren g9"    :  ({"督外脉","神道穴", "JIALI:20","4000"}),
        "tongren g10"   :  ({"督外脉","身柱穴", "JIALI:30","4000"}),
        "tongren g11"   :  ({"督外脉","陶道开穴", "JIALI:40","4000"}),
        "tongren g12"   :  ({"督外脉","大椎穴", "JIALI:50","4000"}),
        "tongren g13"   :  ({"督外脉","哑门连风府穴", "JIALI:60","4000"}),
        "tongren g14"   :  ({"督外脉","脑户穴", "JIALI:10","4000"}),
        "tongren g15"   :  ({"督外脉","强间穴", "JIALI:5:DMG:10","12000"}),
        "tongren g16"   :  ({"督外脉","后顶排穴", "JIALI:10","4000"}),
        "tongren g17"   :  ({"督外脉","百合穴", "JIALI:80","4000"}),
        "tongren g18"   :  ({"督外脉","前顶通囟会穴", "JIALI:120","4000"}),
        "tongren g19"   :  ({"督外脉","上星穴", "JIALI:30","4000"}),
        "tongren g20"   :  ({"督外脉","神庭穴", "JIALI:20","4000"}),
        "tongren g21"   :  ({"督外脉","素穴", "JIALI:20","4000"}),
        "tongren g22"   :  ({"督外脉","水沟穴", "JIALI:10","4000"}),
        "tongren g23"   :  ({"督外脉","兑端穴", "JIALI:20","4000"}),
        "tongren g24"   :  ({"督外脉","龈交穴", "JIALI:15","4000"}),

        // 任外脉
        "tongren h1"    :  ({"任外脉","曲骨穴", "QI:20:_CON:2","6000"}),
        "tongren h2"    :  ({"任外脉","中极穴", "QI:20:_STR:2","9000"}),
        "tongren h3"    :  ({"任外脉","关元穴", "QI:20:_STR:1","6000"}),
        "tongren h4"    :  ({"任外脉","下脘穴", "QI:20:_DEX:4","6000"}),
        "tongren h5"    :  ({"任外脉","中脘穴", "NEI:20:_DEX:1","6000"}),
        "tongren h6"    :  ({"任外脉","上脘穴", "NEI:20:_INT:2","12000"}),
        "tongren h7"    :  ({"任外脉","天突穴", "NEI:20:_INT:1","9000"}),
        "tongren h8"    :  ({"任外脉","廉泉穴", "NEI:20:_CON:4","6000"}),
        "tongren h9"    :  ({"任外脉","承浆穴", "NEI:20:_INT:1","9000"}),
        "tongren h10"   :  ({"任外脉","大钟穴", "JING:20:_DEX:2","6000"}),
        "tongren h11"   :  ({"任外脉","水泉穴", "JING:20:_STR:5","25000"}),
        "tongren h12"   :  ({"任外脉","大赫穴", "JING:20:_CON:1","6000"}),
        "tongren h13"   :  ({"任外脉","灵墟穴", "JING:20:_CON:2","6000"}),
        "tongren h14"   :  ({"任外脉","箕门穴", "MAR:20:_STR:1","6000"}),
        "tongren h15"   :  ({"任外脉","涌泉穴", "MAR:20:_INT:1","9000"}),
        "tongren h16"   :  ({"任外脉","神封穴", "MAR:20:_DEX:2","6000"}),
        "tongren h17"   :  ({"任外脉","地机穴", "MAR:20:_DEX:3","6000"}),
        "tongren h18"   :  ({"任外脉","血海穴", "POT:20:_INT:1","9000"}),
        "tongren h19"   :  ({"任外脉","腹通谷穴", "POT:20:_STR:1","6000"}),
        "tongren h20"   :  ({"任外脉","步廊穴", "POT:20:_DEX:2","6000"}),
        "tongren h21"   :  ({"任外脉","神藏穴", "POT:20:_INT:1","9000"}),
        "tongren h22"   :  ({"任外脉","俞府穴", "JIALI:20:_INT:4","18000"}),
        "tongren h23"   :  ({"任外脉","腹溜穴", "JIALI:20:_CON:4","6000"}),
        "tongren h24"   :  ({"任外脉","阴陵穴", "JIALI:20:_STR:4","18000"}),

        // 经外奇脉
        "tongren i1"    :  ({"经外奇脉","神聪穴", "JING:20","8000"}),
        "tongren i2"    :  ({"经外奇脉","印堂穴", "JING:30","8000"}),
        "tongren i3"    :  ({"经外奇脉","鱼腰穴", "JING:40","8000"}),
        "tongren i4"    :  ({"经外奇脉","太阳穴", "JING:500","30000"}),
        "tongren i5"    :  ({"经外奇脉","耳尖穴", "JING:60","8000"}),
        "tongren i6"    :  ({"经外奇脉","球后穴", "NEI:30","8000"}),
        "tongren i7"    :  ({"经外奇脉","金津穴", "NEI:30","8000"}),
        "tongren i8"    :  ({"经外奇脉","玉液穴", "NEI:30","8000"}),
        "tongren i9"    :  ({"经外奇脉","八邪穴", "NEI:30","8000"}),
        "tongren i10"   :  ({"经外奇脉","四缝穴", "NEI:30","8000"}),
        "tongren i11"   :  ({"经外奇脉","翳明穴", "QI:50","8000"}),
        "tongren i12"   :  ({"经外奇脉","定喘穴", "QI:60","8000"}),
        "tongren i13"   :  ({"经外奇脉","十宣穴", "QI:70","8000"}),
        "tongren i14"   :  ({"经外奇脉","腰奇穴", "QI:80","8000"}),
        "tongren i15"   :  ({"经外奇脉","夹脊穴", "QI:90","8000"}),
        "tongren i16"   :  ({"经外奇脉","二白穴", "QI:100","8000"}),
        "tongren i17"   :  ({"经外奇脉","腰痛点穴", "MAR:10","8000"}),
        "tongren i18"   :  ({"经外奇脉","鹤顶穴", "MAR:20","8000"}),
        "tongren i19"   :  ({"经外奇脉","百虫窝穴", "MAR:30","8000"}),
        "tongren i20"   :  ({"经外奇脉","膝眼穴", "MAR:40","8000"}),
        "tongren i21"   :  ({"经外奇脉","胆囊穴", "DMG:10","30000"}),
        "tongren i22"   :  ({"经外奇脉","阑尾穴", "AMR:40","30000"}),
        "tongren i23"   :  ({"经外奇脉","八风穴", "ATK:10","30000"}),

/////////////////////////////////////////////////////////////////////////

                     //({ 经脉名, 穴位名，冲穴效果，消耗内力})
        // 手太阴脉
        "tongren j1"    :  ({"手太阴脉","少商穴", "QI:50","100"}),
        "tongren j2"    :  ({"手太阴脉","太渊穴", "QI:30","150"}),
        "tongren j3"    :  ({"手太阴脉","中府穴", "QI:20","200"}),
        "tongren j4"    :  ({"手太阴脉","鱼际穴", "NEI:10","200"}),
        "tongren j5"    :  ({"手太阴脉","云门穴", "NEI:30","200"}),
        "tongren j6"    :  ({"手太阴脉","天府穴", "QI:10","200"}),
        "tongren j7"    :  ({"手太阴脉","经渠穴", "NEI:20","100"}),
        "tongren j8"    :  ({"手太阴脉","尺泽穴", "JING:10","200"}),
        "tongren j9"    :  ({"手太阴脉","侠白穴", "JING:10","100"}),
        "tongren j10"   :  ({"手太阴脉","列缺穴", "POT:100","100"}),


        // 手太阳脉
        "tongren k1"    :  ({"手太阳脉","少泽穴", "JING:20:_INT:1","300"}),
        "tongren k2"    :  ({"手太阳脉","前谷穴", "JING:30","300"}),
        "tongren k3"    :  ({"手太阳脉","颧髎穴", "JING:40","500"}),
        "tongren k4"    :  ({"手太阳脉","后溪穴", "JING:80:ATK:10","900"}),
        "tongren k5"    :  ({"手太阳脉","腕骨穴", "JING:60","800"}),
        "tongren k6"    :  ({"手太阳脉","肩髃穴", "NEI:30","300"}),
        "tongren k7"    :  ({"手太阳脉","天容穴", "NEI:30:AMR:10","300"}),
        "tongren k8"    :  ({"手太阳脉","秉风穴", "NEI:30","300"}),
        "tongren k9"    :  ({"手太阳脉","听宫穴", "NEI:30","400"}),
        "tongren k10"   :  ({"手太阳脉","肩中俞穴", "NEI:30:JING:20","400"}),
        "tongren k11"   :  ({"手太阳脉","天宗穴", "JING:20","300"}),
        "tongren k12"   :  ({"手太阳脉","肩外俞穴", "JING:30","300"}),
        "tongren k13"   :  ({"手太阳脉","养老穴", "JING:40:NEI:30","300"}),
        "tongren k14"   :  ({"手太阳脉","阳骨穴", "JING:50","1200"}),
        "tongren k15"   :  ({"手太阳脉","曲垣穴", "JING:60:_DEX:1","1200"}),
        "tongren k16"   :  ({"手太阳脉","天窗穴", "NEI:30","2000"}),
        "tongren k17"   :  ({"手太阳脉","支正穴", "NEI:30","1000"}),
        "tongren k18"   :  ({"手太阳脉","儒俞穴", "NEI:30:_CON:1","1100"}),
        "tongren k19"   :  ({"手太阳脉","小海穴", "NEI:30","1200"}),
        "tongren k20"   :  ({"手太阳脉","肩贞穴", "NEI:30","500"}),


        // 足太阴脉
        "tongren l1"    :  ({"足太阴脉","血海穴", "QI:20:NEI:20","800"}),
        "tongren l2"    :  ({"足太阴脉","阴陵穴", "QI:30:JING:10","800"}),
        "tongren l3"    :  ({"足太阴脉","地机穴", "QI:40","800"}),
        "tongren l4"    :  ({"足太阴脉","箕门穴", "QI:50:_DEX:1","800"}),
        "tongren l5"    :  ({"足太阴脉","商丘穴", "QI:60","800"}),
        "tongren l6"    :  ({"足太阴脉","公孙穴", "NEI:30:POT:100","800"}),
        "tongren l7"    :  ({"足太阴脉","隐白穴", "NEI:30","800"}),
        "tongren l8"    :  ({"足太阴脉","大都穴", "NEI:30:MAR:50","4000"}),
        "tongren l9"    :  ({"足太阴脉","太白穴", "NEI:30","3400"}),
        "tongren l10"   :  ({"足太阴脉","漏骨穴", "NEI:30","800"}),
        "tongren l11"   :  ({"足太阴脉","冲门穴", "JING:20","800"}),
        "tongren l12"   :  ({"足太阴脉","府舍穴", "QI:30:DMG:10","1500"}),
        "tongren l13"   :  ({"足太阴脉","三阴交穴", "JING:40","800"}),
        "tongren l14"   :  ({"足太阴脉","腹结穴", "QI:50","800"}),
        "tongren l15"   :  ({"足太阴脉","大横穴", "JING:60:_STR:2","800"}),
        "tongren l16"   :  ({"足太阴脉","腹哀穴", "QI:30","800"}),
        "tongren l17"   :  ({"足太阴脉","食窦穴", "QI:30","800"}),
        "tongren l18"   :  ({"足太阴脉","胸乡穴", "NEI:30:AMR:10","800"}),
        "tongren l19"   :  ({"足太阴脉","大包穴", "NEI:30","1500"}),
        "tongren l20"   :  ({"足太阴脉","周荣穴", "NEI:30","800"}),
        "tongren l21"   :  ({"足太阴脉","天溪穴", "NEI:30:DMG:10","800"}),


        // 足太阳脉
        "tongren m1"    :  ({"足太阳脉","跗阳穴", "JING:20:QI:40","600"}),
        "tongren m2"    :  ({"足太阳脉","昆仑穴", "JING:30:JIALI:10","600"}),
        "tongren m3"    :  ({"足太阳脉","晴明穴", "JING:40","2000"}),
        "tongren m4"    :  ({"足太阳脉","飞扬穴", "JING:50","600"}),
        "tongren m5"    :  ({"足太阳脉","攒竹穴", "JING:60:JIALI:10","3000"}),
        "tongren m6"    :  ({"足太阳脉","风门穴", "NEI:30","1200"}),
        "tongren m7"    :  ({"足太阳脉","仆申穴", "NEI:30:ATK:10","1000"}),
        "tongren m8"    :  ({"足太阳脉","申脉穴", "NEI:30","2200"}),
        "tongren m9"    :  ({"足太阳脉","曲差穴", "NEI:30","600"}),
        "tongren m10"   :  ({"足太阳脉","眉冲穴", "NEI:30:JIALI:20","5500"}),
        "tongren m11"   :  ({"足太阳脉","五处穴", "QI:20","600"}),
        "tongren m12"   :  ({"足太阳脉","肺俞穴", "QI:30","3500"}),
        "tongren m13"   :  ({"足太阳脉","金门穴", "QI:40","600"}),
        "tongren m14"   :  ({"足太阳脉","京骨穴", "QI:50:ATK:10","2200"}),
        "tongren m15"   :  ({"足太阳脉","通天穴", "QI:60","600"}),
        "tongren m16"   :  ({"足太阳脉","承光穴", "NEI:30","600"}),
        "tongren m17"   :  ({"足太阳脉","络却穴", "NEI:30","1200"}),
        "tongren m18"   :  ({"足太阳脉","厥阴俞穴", "NEI:30:JIALI:30","600"}),
        "tongren m19"   :  ({"足太阳脉","束骨穴", "NEI:30","2000"}),
        "tongren m20"   :  ({"足太阳脉","足通骨穴", "NEI:30","600"}),
        "tongren m21"   :  ({"足太阳脉","天柱穴", "NEI:20","600"}),
        "tongren m22"   :  ({"足太阳脉","玉枕穴", "POT:20","12000"}),
        "tongren m23"   :  ({"足太阳脉","大纾穴", "POT:30:AMR:10","600"}),
        "tongren m24"   :  ({"足太阳脉","心俞穴", "POT:20","600"}),
        "tongren m25"   :  ({"足太阳脉","督俞穴", "POT:10:DMG:10","600"}),
        "tongren m26"   :  ({"足太阳脉","脾俞穴", "POT:60","2000"}),
        "tongren m27"   :  ({"足太阳脉","承山穴", "POT:10","600"}),
        "tongren m28"   :  ({"足太阳脉","胃俞穴", "NEI:30","600"}),
        "tongren m29"   :  ({"足太阳脉","上髎穴", "NEI:30:JIALI:20","12000"}),
        "tongren m30"   :  ({"足太阳脉","膈俞穴", "NEI:30","600"}),
        "tongren m31"   :  ({"足太阳脉","三焦俞穴", "NEI:20","600"}),
        "tongren m32"   :  ({"足太阳脉","气海俞穴", "JING:20","2000"}),
        "tongren m33"   :  ({"足太阳脉","肾俞穴", "JING:30","600"}),
        "tongren m34"   :  ({"足太阳脉","次髎穴", "JING:20","600"}),
        "tongren m35"   :  ({"足太阳脉","肝俞穴", "JING:10","12000"}),
        "tongren m36"   :  ({"足太阳脉","关元俞穴", "JING:60","600"}),
        "tongren m37"   :  ({"足太阳脉","大肠俞穴", "NEI:30","600"}),
        "tongren m38"   :  ({"足太阳脉","小肠俞穴", "NEI:30","600"}),
        "tongren m39"   :  ({"足太阳脉","中髎穴", "NEI:30:JIALI:20","2000"}),
        "tongren m40"   :  ({"足太阳脉","膀胱俞穴", "POT:30","600"}),
        "tongren m41"   :  ({"足太阳脉","白环俞穴", "POT:30","600"}),
        "tongren m42"   :  ({"足太阳脉","下髎穴", "POT:30","12000"}),
        "tongren m43"   :  ({"足太阳脉","会阳穴", "POT:20","600"}),
        "tongren m44"   :  ({"足太阳脉","委阳穴", "JING:30:DMG:10","600"}),
        "tongren m45"   :  ({"足太阳脉","合阳穴", "JING:40:ATK:20","2000"}),
        "tongren m46"   :  ({"足太阳脉","委中穴", "JING:10","600"}),
        "tongren m47"   :  ({"足太阳脉","附分穴", "JING:30","600"}),
        "tongren m48"   :  ({"足太阳脉","承扶穴", "NEI:30","12000"}),
        "tongren m49"   :  ({"足太阳脉","膏肓穴", "NEI:30:_STR:2","600"}),
        "tongren m50"   :  ({"足太阳脉","魄户穴", "NEI:30","600"}),
        "tongren m51"   :  ({"足太阳脉","肓门穴", "NEI:30","600"}),
        "tongren m52"   :  ({"足太阳脉","神堂穴", "NEI:30","2000"}),
        "tongren m53"   :  ({"足太阳脉","殷门穴", "JING:20:JIALI:40","600"}),
        "tongren m54"   :  ({"足太阳脉","膈关穴", "JING:30","600"}),
        "tongren m55"   :  ({"足太阳脉","志室穴", "JING:20","12000"}),
        "tongren m56"   :  ({"足太阳脉","魂门穴", "JING:50","600"}),
        "tongren m57"   :  ({"足太阳脉","意舍穴", "JING:60:_INT:2","600"}),
        "tongren m58"   :  ({"足太阳脉","阳刚穴", "NEI:30:JING:50","2000"}),

        // 手少阴脉
        "tongren n1"    :  ({"手少阴脉","阴郗穴", "JING:20:_DEX:3","1000"}),
        "tongren n2"    :  ({"手少阴脉","通里穴", "JING:30","1200"}),
        "tongren n3"    :  ({"手少阴脉","少府穴", "JING:40","1200"}),
        "tongren n4"    :  ({"手少阴脉","少冲穴", "JING:50:NEI:30","1200"}),
        "tongren n5"    :  ({"手少阴脉","灵道穴", "JING:60","6000"}),
        "tongren n6"    :  ({"手少阴脉","神门穴", "NEI:30","4000"}),
        "tongren n7"    :  ({"手少阴脉","青灵穴", "NEI:30:_INT:2","1000"}),
        "tongren n8"    :  ({"手少阴脉","少海穴", "NEI:30","1200"}),
        "tongren n9"    :  ({"手少阴脉","极泉穴", "NEI:30:_STR:2","1000"}),


        // 手少阳脉
        "tongren o1"    :  ({"手少阳脉","翳风穴", "NEI:20:JING:20","1000"}),
        "tongren o2"    :  ({"手少阳脉","丝竹空穴", "NEI:30:ATK:10","1000"}),
        "tongren o3"    :  ({"手少阳脉","耳门穴", "NEI:40","1000"}),
        "tongren o4"    :  ({"手少阳脉","耳门髎穴", "JING:20:AMR:10","1000"}),
        "tongren o5"    :  ({"手少阳脉","天髎穴", "JING:30","1000"}),
        "tongren o6"    :  ({"手少阳脉","支沟穴", "JING:40:JIALI:20","1000"}),
        "tongren o7"    :  ({"手少阳脉","关冲穴", "JING:50:JIALI:30","1000"}),
        "tongren o8"    :  ({"手少阳脉","液门穴", "JING:60","2000"}),
        "tongren o9"    :  ({"手少阳脉","天井穴", "NEI:30","3000"}),
        "tongren o10"   :  ({"手少阳脉","青冷渊穴", "NEI:30:MAR:50","4000"}),
        "tongren o11"   :  ({"手少阳脉","颅息穴", "NEI:30","1000"}),
        "tongren o12"   :  ({"手少阳脉","角孙穴", "NEI:30:DMG:10","1000"}),
        "tongren o13"   :  ({"手少阳脉","肩髎穴", "QI:20","1000"}),
        "tongren o14"   :  ({"手少阳脉","外关穴", "QI:30","1000"}),
        "tongren o15"   :  ({"手少阳脉","四渎穴", "QI:40","1000"}),
        "tongren o16"   :  ({"手少阳脉","消泺穴", "QI:50:_STR:1","1000"}),
        "tongren o17"   :  ({"手少阳脉","儒会穴", "QI:60","1000"}),
        "tongren o18"   :  ({"手少阳脉","阳池穴", "QI:30","4000"}),
        "tongren o19"   :  ({"手少阳脉","中泽穴", "QI:30:DMG:10","10000"}),
        "tongren o20"   :  ({"手少阳脉","会宗穴", "NEI:30","1000"}),
        "tongren o21"   :  ({"手少阳脉","三阳络穴", "NEI:30:JING:20","4000"}),


        // 足少阴脉
        "tongren p1"    :  ({"足少阴脉","大钟穴", "POT:50:WEAPON:10","4000"}),
        "tongren p2"    :  ({"足少阴脉","太溪穴", "POT:30","4000"}),
        "tongren p3"    :  ({"足少阴脉","然谷穴", "POT:40","4000"}),
        "tongren p4"    :  ({"足少阴脉","涌泉穴", "POT:20:JIALI:10","4000"}),
        "tongren p5"    :  ({"足少阴脉","交信穴", "POT:30","4000"}),
        "tongren p6"    :  ({"足少阴脉","照海穴", "POT:40","4000"}),
        "tongren p7"    :  ({"足少阴脉","水泉穴", "POT:50:ATK:30","4000"}),
        "tongren p8"    :  ({"足少阴脉","横骨穴", "POT:60","4000"}),
        "tongren p9"    :  ({"足少阴脉","商曲穴", "NEI:30:JIALI:20","4000"}),
        "tongren p10"   :  ({"足少阴脉","石关穴", "NEI:30","4000"}),
        "tongren p11"   :  ({"足少阴脉","阴都穴", "NEI:30","4000"}),
        "tongren p12"   :  ({"足少阴脉","腹通谷穴", "NEI:30:MINGSI:1","4000"}),
        "tongren p13"   :  ({"足少阴脉","幽门穴", "JING:20","4000"}),
        "tongren p14"   :  ({"足少阴脉","肓俞穴", "JING:30","4000"}),
        "tongren p15"   :  ({"足少阴脉","中注穴", "JING:40:DMG:20","12000"}),
        "tongren p16"   :  ({"足少阴脉","气穴", "JING:20","4000"}),
        "tongren p17"   :  ({"足少阴脉","复溜穴", "JING:30","4000"}),
        "tongren p18"   :  ({"足少阴脉","大赫穴", "QI:10:JIALI:20","4000"}),
        "tongren p19"   :  ({"足少阴脉","阴谷穴", "QI:10","4000"}),
        "tongren p20"   :  ({"足少阴脉","筑宾穴", "QI:10:JIALI:20","4000"}),
        "tongren p21"   :  ({"足少阴脉","四满穴", "QI:10","4000"}),
        "tongren p22"   :  ({"足少阴脉","神封穴", "QI:10","4000"}),
        "tongren p23"   :  ({"足少阴脉","灵墟穴", "QI:10:WEAPON:10","4000"}),
        "tongren p24"   :  ({"足少阴脉","俞府穴", "NEI:30","4000"}),
        "tongren p25"   :  ({"足少阴脉","神藏穴", "NEI:30:JIALI:30","4000"}),

        // 足少阳脉
        "tongren q1"    :  ({"足少阳脉","风池穴", "NEI:320:KANGDU:1","6000"}),
        "tongren q2"    :  ({"足少阳脉","脑空穴", "NEI:130:FOOD:100","9000"}),
        "tongren q3"    :  ({"足少阳脉","头窍阴穴", "NEI:340:_CON:1","6000"}),
        "tongren q4"    :  ({"足少阳脉","肩井穴", "NEI:120","6000"}),
        "tongren q5"    :  ({"足少阳脉","阳陵泉穴", "NEI:130:KANGDU:1","6000"}),
        "tongren q6"    :  ({"足少阳脉","浮白穴", "NEI:130:FOOD:100","12000"}),
        "tongren q7"    :  ({"足少阳脉","天冲穴", "NEI:150:WATER:100","9000"}),
        "tongren q8"    :  ({"足少阳脉","完骨穴", "NEI:160","6000"}),
        "tongren q9"    :  ({"足少阳脉","正营穴", "NEI:130:_STR:1","9000"}),
        "tongren q10"   :  ({"足少阳脉","目窗穴", "NEI:130","6000"}),
        "tongren q11"   :  ({"足少阳脉","头临泣穴", "NEI:130","25000"}),
        "tongren q12"   :  ({"足少阳脉","阳白穴", "NEI:130:_STR:1","6000"}),
        "tongren q13"   :  ({"足少阳脉","本神穴", "NEI:120","6000"}),
        "tongren q14"   :  ({"足少阳脉","环跳穴", "NEI:130:_CON:1","6000"}),
        "tongren q15"   :  ({"足少阳脉","京门穴", "NEI:140","9000"}),
        "tongren q16"   :  ({"足少阳脉","居髎穴", "NEI:120:_STR:1","6000"}),
        "tongren q17"   :  ({"足少阳脉","渊腋穴", "NEI:130","6000"}),
        "tongren q18"   :  ({"足少阳脉","上关穴", "NEI:140","9000"}),
        "tongren q19"   :  ({"足少阳脉","悬颅穴", "NEI:120:WATER:100","6000"}),
        "tongren q20"   :  ({"足少阳脉","听会穴", "NEI:130","6000"}),
        "tongren q21"   :  ({"足少阳脉","五枢穴", "NEI:140","9000"}),
        "tongren q22"   :  ({"足少阳脉","足窍阴穴", "NEI:150:KANGDU:1","18000"}),
        "tongren q23"   :  ({"足少阳脉","曲鬓穴", "NEI:160","6000"}),
        "tongren q24"   :  ({"足少阳脉","悬厘穴", "NEI:130:FOOD:100","18000"}),
        "tongren q25"   :  ({"足少阳脉","瞳子髎穴", "NEI:130","6000"}),
        "tongren q26"   :  ({"足少阳脉","带脉穴", "NEI:120:KANGDU:1","6000"}),
        "tongren q27"   :  ({"足少阳脉","率谷穴", "NEI:130","9000"}),
        "tongren q28"   :  ({"足少阳脉","风市穴", "NEI:140","6000"}),
        "tongren q29"   :  ({"足少阳脉","阳交穴", "NEI:120:_STR:1","6000"}),
        "tongren q30"   :  ({"足少阳脉","外丘穴", "NEI:130","9000"}),
        "tongren q31"   :  ({"足少阳脉","维道穴", "NEI:140:FOOD:100","6000"}),
        "tongren q32"   :  ({"足少阳脉","日月穴", "NEI:120:WATER:100","6000"}),
        "tongren q33"   :  ({"足少阳脉","地五会穴", "NEI:130","9000"}),
        "tongren q34"   :  ({"足少阳脉","侠溪穴", "NEI:210:_CON:1","18000"}),
        "tongren q35"   :  ({"足少阳脉","丘墟穴", "NEI:150","6000"}),
        "tongren q36"   :  ({"足少阳脉","悬钟穴", "NEI:160:_STR:1","18000"}),
        "tongren q37"   :  ({"足少阳脉","光明穴", "NEI:230","6000"}),
        "tongren q38"   :  ({"足少阳脉","阳辅穴", "NEI:330:_CON:1","18000"}),

        // 手阳明脉
        "tongren r1"    :  ({"手阳明脉","肘髎穴", "QI:20:ADDPOT:1000000","8000"}),
        "tongren r2"    :  ({"手阳明脉","手五里穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r3"    :  ({"手阳明脉","曲池穴", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r4"    :  ({"手阳明脉","迎香穴", "QI:20:ADDPOT:1000000","30000"}),
        "tongren r5"    :  ({"手阳明脉","臂儒穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r6"    :  ({"手阳明脉","巨骨穴", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r7"    :  ({"手阳明脉","天鼎穴", "QI:50:ADDPOT:1000000","8000"}),
        "tongren r8"    :  ({"手阳明脉","扶突穴", "QI:60:ADDPOT:1000000","8000"}),
        "tongren r9"    :  ({"手阳明脉","口禾髎穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r10"   :  ({"手阳明脉","合谷穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r11"   :  ({"手阳明脉","二间穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r12"   :  ({"手阳明脉","三间穴", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r13"   :  ({"手阳明脉","商阳穴", "FOOD:20:ADDPOT:1000000","8000"}),
        "tongren r14"   :  ({"手阳明脉","阳溪穴", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r15"   :  ({"手阳明脉","手三里穴", "FOOD:40:ADDPOT:1000000","8000"}),
        "tongren r16"   :  ({"手阳明脉","上廉穴", "WATER:20:ADDPOT:1000000","8000"}),
        "tongren r17"   :  ({"手阳明脉","下廉穴", "WATER:30:ADDPOT:1000000","8000"}),
        "tongren r18"   :  ({"手阳明脉","温溜穴", "WATER:40:ADDPOT:1000000","8000"}),
        "tongren r19"   :  ({"手阳明脉","偏历穴", "WATER:20:ADDPOT:1000000","8000"}),

        // 足阳明脉
        "tongren s1"    :  ({"足阳明脉","承泣穴", "MAR:20:FOOD:100","8000"}),
        "tongren s2"    :  ({"足阳明脉","四白穴", "MAR:30:FOOD:100","8000"}),
        "tongren s3"    :  ({"足阳明脉","巨髎穴", "MAR:40:FOOD:100","8000"}),
        "tongren s4"    :  ({"足阳明脉","地仓穴", "MAR:20:FOOD:100","30000"}),
        "tongren s5"    :  ({"足阳明脉","下关穴", "MAR:30:FOOD:100","8000"}),
        "tongren s6"    :  ({"足阳明脉","头维穴", "MAR:40:FOOD:100","8000"}),
        "tongren s7"    :  ({"足阳明脉","人迎穴", "MAR:50:FOOD:100","8000"}),
        "tongren s8"    :  ({"足阳明脉","水突穴", "MAR:60:FOOD:100","8000"}),
        "tongren s9"    :  ({"足阳明脉","气舍穴", "NEI:30:WATER:100","8000"}),
        "tongren s10"   :  ({"足阳明脉","缺盆穴", "NEI:30:WATER:100","8000"}),
        "tongren s11"   :  ({"足阳明脉","气户穴", "NEI:30:WATER:100","8000"}),
        "tongren s12"   :  ({"足阳明脉","库房穴", "NEI:30:WATER:100","8000"}),
        "tongren s13"   :  ({"足阳明脉","大迎穴", "JING:20:WATER:100","8000"}),
        "tongren s14"   :  ({"足阳明脉","屋翳穴", "JING:30:WATER:100","8000"}),
        "tongren s15"   :  ({"足阳明脉","梁门穴", "POT:40:WATER:100","8000"}),
        "tongren s16"   :  ({"足阳明脉","乳中穴", "POT:20:ATK:10","8000"}),
        "tongren s17"   :  ({"足阳明脉","乳根穴", "POT:30","8000"}),
        "tongren s18"   :  ({"足阳明脉","不容穴", "POT:40:_DEX:2","8000"}),
        "tongren s19"   :  ({"足阳明脉","承满穴", "POT:20:ATK:10","8000"}),
        "tongren s20"   :  ({"足阳明脉","关门穴", "POT:30","8000"}),
        "tongren s21"   :  ({"足阳明脉","太乙穴", "POT:40:DMG:10","8000"}),
        "tongren s22"   :  ({"足阳明脉","滑肉门穴", "POT:50:JIALI:30","8000"}),
        "tongren s23"   :  ({"足阳明脉","天枢穴", "POT:60","30000"}),
        "tongren s24"   :  ({"足阳明脉","外陵穴", "NEI:30:ATK:30","8000"}),
        "tongren s25"   :  ({"足阳明脉","大巨穴", "NEI:30","8000"}),
        "tongren s26"   :  ({"足阳明脉","水道穴", "JING:20:JIALI:50","8000"}),
        "tongren s27"   :  ({"足阳明脉","归来穴", "JING:30","8000"}),
        "tongren s28"   :  ({"足阳明脉","气冲穴", "JING:40:AMR:10","8000"}),
        "tongren s29"   :  ({"足阳明脉","伏兔穴", "JING:20","8000"}),
        "tongren s30"   :  ({"足阳明脉","阴市穴", "JING:30:ATK:10","8000"}),
        "tongren s31"   :  ({"足阳明脉","梁丘穴", "JING:40","8000"}),
        "tongren s32"   :  ({"足阳明脉","犊鼻穴", "QI:20:NEI:10","8000"}),
        "tongren s33"   :  ({"足阳明脉","上巨虚穴", "QI:30:ATK:10","8000"}),
        "tongren s34"   :  ({"足阳明脉","下巨虚穴", "QI:40","8000"}),
        "tongren s35"   :  ({"足阳明脉","丰隆穴", "QI:50","8000"}),
        "tongren s36"   :  ({"足阳明脉","解溪穴", "QI:60:JIALI:10","8000"}),
        "tongren s37"   :  ({"足阳明脉","冲阳穴", "QI:30","8000"}),
        "tongren s38"   :  ({"足阳明脉","陷骨穴", "QI:30:ATK:10","8000"}),
        "tongren s39"    :  ({"足阳明脉","内庭穴", "NEI:30:JIALI:10","8000"}),
        "tongren s40"    :  ({"足阳明脉","历兑穴", "NEI:30:AMR:10","8000"}),

        // 手厥阴脉
        "tongren t1"    :  ({"手厥阴脉","内关穴", "JING:50:NEI:50","8000"}),
        "tongren t2"    :  ({"手厥阴脉","大陵穴", "JING:50:NEI:50","8000"}),
        "tongren t3"    :  ({"手厥阴脉","天泉穴", "JING:50:NEI:50","8000"}),
        "tongren t4"    :  ({"手厥阴脉","间使穴", "JING:50:_DEX:1","30000"}),
        "tongren t5"    :  ({"手厥阴脉","劳宫穴", "JING:50:_DEX:1","8000"}),
        "tongren t6"    :  ({"手厥阴脉","天池穴", "JING:50:_DEX:1","8000"}),
        "tongren t7"    :  ({"手厥阴脉","曲泽穴", "JING:50:_DEX:1","8000"}),
        "tongren t8"    :  ({"手厥阴脉","蹊门穴", "JING:50:MAR:50","8000"}),
        "tongren t9"    :  ({"手厥阴脉","中冲穴", "JING:50:MAR:50","8000"}),

        // 足厥阴脉
        "tongren u1"    :  ({"足厥阴脉","太冲穴", "JING:50:DMG:20","8000"}),
        "tongren u2"    :  ({"足厥阴脉","大敦穴", "JING:30:_CON:3","8000"}),
        "tongren u3"    :  ({"足厥阴脉","行间穴", "JING:40","8000"}),
        "tongren u4"    :  ({"足厥阴脉","中都穴", "JING:20:QI:20","30000"}),
        "tongren u5"    :  ({"足厥阴脉","臂沟穴", "JING:30:ATK:20","8000"}),
        "tongren u6"    :  ({"足厥阴脉","中封穴", "JING:40","8000"}),
        "tongren u7"    :  ({"足厥阴脉","章门穴", "JING:50:_DEX:2","8000"}),
        "tongren u8"    :  ({"足厥阴脉","足五里穴", "JING:60:NEI:50","8000"}),
        "tongren u9"    :  ({"足厥阴脉","膝关穴", "NEI:30:_DEX:1","8000"}),
        "tongren u10"   :  ({"足厥阴脉","曲泉穴", "JING:30:_CON:3","8000"}),
        "tongren u11"   :  ({"足厥阴脉","急脉穴", "JING:40:_STR:2","8000"}),
        "tongren u12"   :  ({"足厥阴脉","阴包穴", "JING:50","8000"}),
        "tongren u13"   :  ({"足厥阴脉","期门穴", "JING:60:QI:20","8000"}),
        "tongren u14"   :  ({"足厥阴脉","阴廉穴", "NEI:40:_STR:2","8000"}),
]);

// 无名铜人鉴定出的小周天铜人列表
mapping tongren_list1 = ([
                     //({ 经脉名, 穴位名，冲穴效果，消耗内力})
        // 阴跷脉
        "tongren a1"    :  ({"阴跷脉","然谷穴", "QI:50","100"}),
        "tongren a2"    :  ({"阴跷脉","照海穴", "NEI:20","150"}),
        "tongren a3"    :  ({"阴跷脉","交信穴", "ATK:10","200"}),
        "tongren a4"    :  ({"阴跷脉","阴谷穴", "DMG:10","200"}),
        "tongren a5"    :  ({"阴跷脉","横谷穴", "AMR:10","200"}),
        "tongren a6"    :  ({"阴跷脉","气冲穴", "JIALI:50","200"}),
        "tongren a7"    :  ({"阴跷脉","乳根穴", "QI:30","100"}),
        "tongren a8"    :  ({"阴跷脉","盆缺穴", "JING:20","200"}),
        "tongren a9"    :  ({"阴跷脉","人迎穴", "MAR:10","100"}),
        "tongren a10"   :  ({"阴跷脉","晴明穴", "QI:10","100"}),
        "tongren a11"   :  ({"阴跷脉","不容穴", "AMR:10","100"}),
        "tongren a12"   :  ({"阴跷脉","梁门穴", "QI:10","100"}),
        "tongren a13"   :  ({"阴跷脉","横鼻穴", "QI:20","100"}),
        "tongren a14"   :  ({"阴跷脉","足三里穴", "QI:30","100"}),
        "tongren a15"   :  ({"阴跷脉","丰隆穴", "QI:40","100"}),
        "tongren a16"   :  ({"阴跷脉","解溪穴", "POT:20","100"}),
        "tongren a17"   :  ({"阴跷脉","冲阳穴", "NEI:10","100"}),
        "tongren a18"   :  ({"阴跷脉","属兑穴", "NEI:20","150"}),

        // 阳跷脉
        "tongren b1"    :  ({"阳跷脉","申脉穴", "QI:500","300"}),
        "tongren b2"    :  ({"阳跷脉","仆参穴", "QI:600","300"}),
        "tongren b3"    :  ({"阳跷脉","跗阳穴", "QI:700","500"}),
        "tongren b4"    :  ({"阳跷脉","居髎穴", "QI:800:AMR:10","900"}),
        "tongren b5"    :  ({"阳跷脉","臑俞穴", "QI:500:MAR:50","800"}),
        "tongren b6"    :  ({"阳跷脉","肩髃穴", "QI:300","300"}),
        "tongren b7"    :  ({"阳跷脉","地谷穴", "QI:600","300"}),
        "tongren b8"    :  ({"阳跷脉","巨仓穴", "QI:100","300"}),
        "tongren b9"    :  ({"阳跷脉","巨髎穴", "QI:100:ATK:10","400"}),
        "tongren b10"   :  ({"阳跷脉","承泣穴", "QI:400:NEI:40","400"}),
        "tongren b11"   :  ({"阳跷脉","风池穴", "QI:600","300"}),
        "tongren b12"   :  ({"阳跷脉","攒竹穴", "QI:200","300"}),
        "tongren b13"   :  ({"阳跷脉","眉冲穴", "QI:400","300"}),
        "tongren b14"   :  ({"阳跷脉","曲差穴", "QI:700:DMG:10","1200"}),
        "tongren b15"   :  ({"阳跷脉","五处穴", "QI:200:DMG:10","1200"}),
        "tongren b16"   :  ({"阳跷脉","承光穴", "QI:800:AMR:20","2000"}),
        "tongren b17"   :  ({"阳跷脉","通天穴", "QI:1200","1000"}),
        "tongren b18"   :  ({"阳跷脉","络却穴", "QI:500:MAR:100","1100"}),
        "tongren b19"   :  ({"阳跷脉","玉枕穴", "QI:400:POT:200","1200"}),
        "tongren b20"   :  ({"阳跷脉","天柱穴", "QI:800","500"}),
        "tongren b21"   :  ({"阳跷脉","承山穴", "QI:200","200"}),
        "tongren b22"   :  ({"阳跷脉","昆仑穴", "QI:500","300"}),
        "tongren b23"   :  ({"阳跷脉","飞扬穴", "QI:400","300"}),

        // 阴维脉
        "tongren c1"    :  ({"阴维脉","府舍穴", "NEI:120","800"}),
        "tongren c2"    :  ({"阴维脉","大横穴", "NEI:300:QI:50","800"}),
        "tongren c3"    :  ({"阴维脉","阳交穴", "NEI:100","800"}),
        "tongren c4"    :  ({"阴维脉","腹衰穴", "NEI:150","800"}),
        "tongren c5"    :  ({"阴维脉","期门穴", "NEI:400","800"}),
        "tongren c6"    :  ({"阴维脉","廉泉穴", "NEI:300","800"}),
        "tongren c7"    :  ({"阴维脉","极泉穴", "NEI:200","800"}),
        "tongren c8"    :  ({"阴维脉","青灵穴", "NEI:800:ATK:20","4000"}),
        "tongren c9"    :  ({"阴维脉","少海穴", "NEI:700:DMG:10","3400"}),
        "tongren c10"   :  ({"阴维脉","灵道穴", "NEI:100:QI:100","800"}),
        "tongren c11"   :  ({"阴维脉","通里穴", "NEI:200","800"}),
        "tongren c12"   :  ({"阴维脉","阴郄穴", "NEI:700","1500"}),
        "tongren c13"   :  ({"阴维脉","神门穴", "NEI:200","800"}),
        "tongren c14"   :  ({"阴维脉","少府穴", "NEI:500","800"}),
        "tongren c15"   :  ({"阴维脉","少冲穴", "NEI:500","800"}),
        "tongren c16"   :  ({"阴维脉","筑宾穴", "NEI:300","800"}),

        // 阳维脉
        "tongren d1"    :  ({"阳维脉","天髎穴", "POT:200","600"}),
        "tongren d2"    :  ({"阳维脉","臑俞穴", "POT:100","600"}),
        "tongren d3"    :  ({"阳维脉","肩井穴", "POT:200:MAR:200","2000"}),
        "tongren d4"    :  ({"阳维脉","阳交穴", "POT:600","600"}),
        "tongren d5"    :  ({"阳维脉","头维穴", "POT:400:JING:200","3000"}),
        "tongren d6"    :  ({"阳维脉","金门穴", "POT:400:NEI:200","1200"}),
        "tongren d7"    :  ({"阳维脉","阳白穴", "POT:300:QI:100","1000"}),
        "tongren d8"    :  ({"阳维脉","本神穴", "POT:200:JING:300","2200"}),
        "tongren d9"    :  ({"阳维脉","头临泣穴", "POT:200","600"}),
        "tongren d10"   :  ({"阳维脉","目窗穴", "POT:500:MINGSI:1","5500"}),
        "tongren d11"   :  ({"阳维脉","正营穴", "POT:500","600"}),
        "tongren d12"   :  ({"阳维脉","脑空穴", "POT:700:AMR:20","3500"}),
        "tongren d13"   :  ({"阳维脉","承灵穴", "POT:200","600"}),
        "tongren d14"   :  ({"阳维脉","风池穴", "POT:300:ATK:10","2200"}),
        "tongren d15"   :  ({"阳维脉","风府穴", "POT:500","600"}),
        "tongren d16"   :  ({"阳维脉","哑门穴", "POT:300","600"}),
        "tongren d17"   :  ({"阳维脉","云门穴", "POT:100:NEI:200","1200"}),
        "tongren d18"   :  ({"阳维脉","尺泽穴", "POT:100","600"}),
        "tongren d19"   :  ({"阳维脉","孔最穴", "POT:400:JING:200","2000"}),
        "tongren d20"   :  ({"阳维脉","列缺穴", "POT:300","600"}),
        "tongren d21"   :  ({"阳维脉","经渠穴", "POT:600","600"}),
        "tongren d22"   :  ({"阳维脉","太渊穴", "POT:100:MINGSI:2","12000"}),
        "tongren d23"   :  ({"阳维脉","鱼际穴", "POT:400","600"}),
        "tongren d24"   :  ({"阳维脉","少商穴", "POT:300","600"}),

        // 带脉
        "tongren e1"    :  ({"带脉","带脉穴", "QI:200:NEI:50","1000"}),
        "tongren e2"    :  ({"带脉","五枢穴", "ATK:20","1200"}),
        "tongren e3"    :  ({"带脉","维道穴", "JIALI:50","1200"}),
        "tongren e4"    :  ({"带脉","天冲穴", "AMR:10","1200"}),
        "tongren e5"    :  ({"带脉","浮白穴", "WEAPON:10","6000"}),
        "tongren e6"    :  ({"带脉","头窍阴穴", "_INT:2","4000"}),
        "tongren e7"    :  ({"带脉","完骨穴", "NEI:100","1000"}),
        "tongren e8"    :  ({"带脉","本神穴", "JIALI:20","1200"}),
        "tongren e9"    :  ({"带脉","阳白穴", "QI:50","1000"}),
        "tongren e10"   :  ({"带脉","头临泣穴", "JIALI:20","1800"}),
        "tongren e11"   :  ({"带脉","目窗穴", "JIALI:30","1800"}),
        "tongren e12"   :  ({"带脉","正营穴", "JIALI:40","1800"}),
        "tongren e13"   :  ({"带脉","承灵穴", "JIALI:10","1800"}),
        "tongren e14"   :  ({"带脉","脑空穴", "JIALI:60","1800"}),
        "tongren e15"   :  ({"带脉","外丘穴", "JIALI:30","1800"}),
        "tongren e16"   :  ({"带脉","光明穴", "JIALI:30","1800"}),
        "tongren e17"   :  ({"带脉","阳辅穴", "JIALI:80","1800"}),
        "tongren e18"   :  ({"带脉","悬钟穴", "JIALI:10","1800"}),
        "tongren e19"   :  ({"带脉","丘墟穴", "JIALI:40","1800"}),

        // 冲脉
        "tongren f1"    :  ({"冲脉","会阴穴", "QI:200","1000"}),
        "tongren f2"    :  ({"冲脉","阴交穴", "AMR:10","1000"}),
        "tongren f3"    :  ({"冲脉","气冲穴", "AMR:10","1000"}),
        "tongren f4"    :  ({"冲脉","横骨穴", "ATK:20","1000"}),
        "tongren f5"    :  ({"冲脉","大赫穴", "JIALI:50","1000"}),
        "tongren f6"    :  ({"冲脉","气穴", "JING:20","1000"}),
        "tongren f7"    :  ({"冲脉","四满穴", "JING:30","1000"}),
        "tongren f8"    :  ({"冲脉","中注穴", "AMR:20","2000"}),
        "tongren f9"    :  ({"冲脉","盲俞穴", "AMR:30","3000"}),
        "tongren f10"   :  ({"冲脉","商曲穴", "AMR:40","4000"}),
        "tongren f11"   :  ({"冲脉","石关穴", "NEI:50","1000"}),
        "tongren f12"   :  ({"冲脉","阴都穴", "QI:100","1000"}),
        "tongren f13"   :  ({"冲脉","通谷穴", "FOOD:100","1000"}),
        "tongren f14"   :  ({"冲脉","幽门穴", "FOOD:200","1000"}),
        "tongren f15"   :  ({"冲脉","关门穴", "WATER:100","1000"}),
        "tongren f16"   :  ({"冲脉","太乙穴", "WATER:200","1000"}),
        "tongren f17"   :  ({"冲脉","归来穴", "ADDPOT:600000","1000"}),
        "tongren f18"   :  ({"冲脉","大巨穴", "KANGDU:1","4000"}),
        "tongren f19"   :  ({"冲脉","天枢穴", "KANGDU:2","10000"}),
        "tongren f20"   :  ({"冲脉","气舍穴", "QI:20","1000"}),
        "tongren f21"   :  ({"冲脉","水突穴", "AMR:40","4000"}),
        "tongren f22"   :  ({"冲脉","水道穴", "DMG:10","4000"}),
        "tongren f23"   :  ({"冲脉","外陵穴", "DMG:30","22000"}),
        "tongren f24"   :  ({"冲脉","滑肉门穴", "_DEX:6","8000"}),

        // 督外脉
        "tongren g1"    :  ({"督外脉","长强穴", "JIALI:60","4000"}),
        "tongren g2"    :  ({"督外脉","腰俞穴", "JIALI:20","4000"}),
        "tongren g3"    :  ({"督外脉","阳关入命门穴", "JIALI:30","4000"}),
        "tongren g4"    :  ({"督外脉","上行悬枢穴", "JIALI:40","4000"}),
        "tongren g5"    :  ({"督外脉","脊中穴", "JIALI:100","4000"}),
        "tongren g6"    :  ({"督外脉","至中枢穴", "JIALI:20","4000"}),
        "tongren g7"    :  ({"督外脉","筋缩穴", "JIALI:10","4000"}),
        "tongren g8"    :  ({"督外脉","至阳归灵台穴", "JIALI:40","4000"}),
        "tongren g9"    :  ({"督外脉","神道穴", "JIALI:20","4000"}),
        "tongren g10"   :  ({"督外脉","身柱穴", "JIALI:30","4000"}),
        "tongren g11"   :  ({"督外脉","陶道开穴", "JIALI:40","4000"}),
        "tongren g12"   :  ({"督外脉","大椎穴", "JIALI:50","4000"}),
        "tongren g13"   :  ({"督外脉","哑门连风府穴", "JIALI:60","4000"}),
        "tongren g14"   :  ({"督外脉","脑户穴", "JIALI:10","4000"}),
        "tongren g15"   :  ({"督外脉","强间穴", "JIALI:5:DMG:10","12000"}),
        "tongren g16"   :  ({"督外脉","后顶排穴", "JIALI:10","4000"}),
        "tongren g17"   :  ({"督外脉","百合穴", "JIALI:80","4000"}),
        "tongren g18"   :  ({"督外脉","前顶通囟会穴", "JIALI:120","4000"}),
        "tongren g19"   :  ({"督外脉","上星穴", "JIALI:30","4000"}),
        "tongren g20"   :  ({"督外脉","神庭穴", "JIALI:20","4000"}),
        "tongren g21"   :  ({"督外脉","素穴", "JIALI:20","4000"}),
        "tongren g22"   :  ({"督外脉","水沟穴", "JIALI:10","4000"}),
        "tongren g23"   :  ({"督外脉","兑端穴", "JIALI:20","4000"}),
        "tongren g24"   :  ({"督外脉","龈交穴", "JIALI:15","4000"}),

        // 任外脉
        "tongren h1"    :  ({"任外脉","曲骨穴", "QI:20:_CON:2","6000"}),
        "tongren h2"    :  ({"任外脉","中极穴", "QI:20:_STR:2","9000"}),
        "tongren h3"    :  ({"任外脉","关元穴", "QI:20:_STR:1","6000"}),
        "tongren h4"    :  ({"任外脉","下脘穴", "QI:20:_DEX:4","6000"}),
        "tongren h5"    :  ({"任外脉","中脘穴", "NEI:20:_DEX:1","6000"}),
        "tongren h6"    :  ({"任外脉","上脘穴", "NEI:20:_INT:2","12000"}),
        "tongren h7"    :  ({"任外脉","天突穴", "NEI:20:_INT:1","9000"}),
        "tongren h8"    :  ({"任外脉","廉泉穴", "NEI:20:_CON:4","6000"}),
        "tongren h9"    :  ({"任外脉","承浆穴", "NEI:20:_INT:1","9000"}),
        "tongren h10"   :  ({"任外脉","大钟穴", "JING:20:_DEX:2","6000"}),
        "tongren h11"   :  ({"任外脉","水泉穴", "JING:20:_STR:5","25000"}),
        "tongren h12"   :  ({"任外脉","大赫穴", "JING:20:_CON:1","6000"}),
        "tongren h13"   :  ({"任外脉","灵墟穴", "JING:20:_CON:2","6000"}),
        "tongren h14"   :  ({"任外脉","箕门穴", "MAR:20:_STR:1","6000"}),
        "tongren h15"   :  ({"任外脉","涌泉穴", "MAR:20:_INT:1","9000"}),
        "tongren h16"   :  ({"任外脉","神封穴", "MAR:20:_DEX:2","6000"}),
        "tongren h17"   :  ({"任外脉","地机穴", "MAR:20:_DEX:3","6000"}),
        "tongren h18"   :  ({"任外脉","血海穴", "POT:20:_INT:1","9000"}),
        "tongren h19"   :  ({"任外脉","腹通谷穴", "POT:20:_STR:1","6000"}),
        "tongren h20"   :  ({"任外脉","步廊穴", "POT:20:_DEX:2","6000"}),
        "tongren h21"   :  ({"任外脉","神藏穴", "POT:20:_INT:1","9000"}),
        "tongren h22"   :  ({"任外脉","俞府穴", "JIALI:20:_INT:4","18000"}),
        "tongren h23"   :  ({"任外脉","腹溜穴", "JIALI:20:_CON:4","6000"}),
        "tongren h24"   :  ({"任外脉","阴陵穴", "JIALI:20:_STR:4","18000"}),

        // 经外奇脉
        "tongren i1"    :  ({"经外奇脉","神聪穴", "JING:20","8000"}),
        "tongren i2"    :  ({"经外奇脉","印堂穴", "JING:30","8000"}),
        "tongren i3"    :  ({"经外奇脉","鱼腰穴", "JING:40","8000"}),
        "tongren i4"    :  ({"经外奇脉","太阳穴", "JING:500","30000"}),
        "tongren i5"    :  ({"经外奇脉","耳尖穴", "JING:60","8000"}),
        "tongren i6"    :  ({"经外奇脉","球后穴", "NEI:30","8000"}),
        "tongren i7"    :  ({"经外奇脉","金津穴", "NEI:30","8000"}),
        "tongren i8"    :  ({"经外奇脉","玉液穴", "NEI:30","8000"}),
        "tongren i9"    :  ({"经外奇脉","八邪穴", "NEI:30","8000"}),
        "tongren i10"   :  ({"经外奇脉","四缝穴", "NEI:30","8000"}),
        "tongren i11"   :  ({"经外奇脉","翳明穴", "QI:50","8000"}),
        "tongren i12"   :  ({"经外奇脉","定喘穴", "QI:60","8000"}),
        "tongren i13"   :  ({"经外奇脉","十宣穴", "QI:70","8000"}),
        "tongren i14"   :  ({"经外奇脉","腰奇穴", "QI:80","8000"}),
        "tongren i15"   :  ({"经外奇脉","夹脊穴", "QI:90","8000"}),
        "tongren i16"   :  ({"经外奇脉","二白穴", "QI:100","8000"}),
        "tongren i17"   :  ({"经外奇脉","腰痛点穴", "MAR:10","8000"}),
        "tongren i18"   :  ({"经外奇脉","鹤顶穴", "MAR:20","8000"}),
        "tongren i19"   :  ({"经外奇脉","百虫窝穴", "MAR:30","8000"}),
        "tongren i20"   :  ({"经外奇脉","膝眼穴", "MAR:40","8000"}),
        "tongren i21"   :  ({"经外奇脉","胆囊穴", "DMG:10","30000"}),
        "tongren i22"   :  ({"经外奇脉","阑尾穴", "AMR:40","30000"}),
        "tongren i23"   :  ({"经外奇脉","八风穴", "ATK:10","30000"}),
]);

// 无名铜人鉴定出的大周天铜人列表
mapping tongren_list2 = ([

                     //({ 经脉名, 穴位名，冲穴效果，消耗内力})
        // 手太阴脉
        "tongren j1"    :  ({"手太阴脉","少商穴", "QI:50","100"}),
        "tongren j2"    :  ({"手太阴脉","太渊穴", "QI:30","150"}),
        "tongren j3"    :  ({"手太阴脉","中府穴", "QI:20","200"}),
        "tongren j4"    :  ({"手太阴脉","鱼际穴", "NEI:10","200"}),
        "tongren j5"    :  ({"手太阴脉","云门穴", "NEI:30","200"}),
        "tongren j6"    :  ({"手太阴脉","天府穴", "QI:10","200"}),
        "tongren j7"    :  ({"手太阴脉","经渠穴", "NEI:20","100"}),
        "tongren j8"    :  ({"手太阴脉","尺泽穴", "JING:10","200"}),
        "tongren j9"    :  ({"手太阴脉","侠白穴", "JING:10","100"}),
        "tongren j10"   :  ({"手太阴脉","列缺穴", "POT:100","100"}),


        // 手太阳脉
        "tongren k1"    :  ({"手太阳脉","少泽穴", "JING:20:_INT:1","300"}),
        "tongren k2"    :  ({"手太阳脉","前谷穴", "JING:30","300"}),
        "tongren k3"    :  ({"手太阳脉","颧髎穴", "JING:40","500"}),
        "tongren k4"    :  ({"手太阳脉","后溪穴", "JING:80:ATK:10","900"}),
        "tongren k5"    :  ({"手太阳脉","腕骨穴", "JING:60","800"}),
        "tongren k6"    :  ({"手太阳脉","肩髃穴", "NEI:30","300"}),
        "tongren k7"    :  ({"手太阳脉","天容穴", "NEI:30:AMR:10","300"}),
        "tongren k8"    :  ({"手太阳脉","秉风穴", "NEI:30","300"}),
        "tongren k9"    :  ({"手太阳脉","听宫穴", "NEI:30","400"}),
        "tongren k10"   :  ({"手太阳脉","肩中俞穴", "NEI:30:JING:20","400"}),
        "tongren k11"   :  ({"手太阳脉","天宗穴", "JING:20","300"}),
        "tongren k12"   :  ({"手太阳脉","肩外俞穴", "JING:30","300"}),
        "tongren k13"   :  ({"手太阳脉","养老穴", "JING:40:NEI:30","300"}),
        "tongren k14"   :  ({"手太阳脉","阳骨穴", "JING:50","1200"}),
        "tongren k15"   :  ({"手太阳脉","曲垣穴", "JING:60:_DEX:1","1200"}),
        "tongren k16"   :  ({"手太阳脉","天窗穴", "NEI:30","2000"}),
        "tongren k17"   :  ({"手太阳脉","支正穴", "NEI:30","1000"}),
        "tongren k18"   :  ({"手太阳脉","儒俞穴", "NEI:30:_CON:1","1100"}),
        "tongren k19"   :  ({"手太阳脉","小海穴", "NEI:30","1200"}),
        "tongren k20"   :  ({"手太阳脉","肩贞穴", "NEI:30","500"}),


        // 足太阴脉
        "tongren l1"    :  ({"足太阴脉","血海穴", "QI:20:NEI:20","800"}),
        "tongren l2"    :  ({"足太阴脉","阴陵穴", "QI:30:JING:10","800"}),
        "tongren l3"    :  ({"足太阴脉","地机穴", "QI:40","800"}),
        "tongren l4"    :  ({"足太阴脉","箕门穴", "QI:50:_DEX:1","800"}),
        "tongren l5"    :  ({"足太阴脉","商丘穴", "QI:60","800"}),
        "tongren l6"    :  ({"足太阴脉","公孙穴", "NEI:30:POT:100","800"}),
        "tongren l7"    :  ({"足太阴脉","隐白穴", "NEI:30","800"}),
        "tongren l8"    :  ({"足太阴脉","大都穴", "NEI:30:MAR:50","4000"}),
        "tongren l9"    :  ({"足太阴脉","太白穴", "NEI:30","3400"}),
        "tongren l10"   :  ({"足太阴脉","漏骨穴", "NEI:30","800"}),
        "tongren l11"   :  ({"足太阴脉","冲门穴", "JING:20","800"}),
        "tongren l12"   :  ({"足太阴脉","府舍穴", "QI:30:DMG:10","1500"}),
        "tongren l13"   :  ({"足太阴脉","三阴交穴", "JING:40","800"}),
        "tongren l14"   :  ({"足太阴脉","腹结穴", "QI:50","800"}),
        "tongren l15"   :  ({"足太阴脉","大横穴", "JING:60:_STR:2","800"}),
        "tongren l16"   :  ({"足太阴脉","腹哀穴", "QI:30","800"}),
        "tongren l17"   :  ({"足太阴脉","食窦穴", "QI:30","800"}),
        "tongren l18"   :  ({"足太阴脉","胸乡穴", "NEI:30:AMR:10","800"}),
        "tongren l19"   :  ({"足太阴脉","大包穴", "NEI:30","1500"}),
        "tongren l20"   :  ({"足太阴脉","周荣穴", "NEI:30","800"}),
        "tongren l21"   :  ({"足太阴脉","天溪穴", "NEI:30:DMG:10","800"}),


        // 足太阳脉
        "tongren m1"    :  ({"足太阳脉","跗阳穴", "JING:20:QI:40","600"}),
        "tongren m2"    :  ({"足太阳脉","昆仑穴", "JING:30:JIALI:10","600"}),
        "tongren m3"    :  ({"足太阳脉","晴明穴", "JING:40","2000"}),
        "tongren m4"    :  ({"足太阳脉","飞扬穴", "JING:50","600"}),
        "tongren m5"    :  ({"足太阳脉","攒竹穴", "JING:60:JIALI:10","3000"}),
        "tongren m6"    :  ({"足太阳脉","风门穴", "NEI:30","1200"}),
        "tongren m7"    :  ({"足太阳脉","仆申穴", "NEI:30:ATK:10","1000"}),
        "tongren m8"    :  ({"足太阳脉","申脉穴", "NEI:30","2200"}),
        "tongren m9"    :  ({"足太阳脉","曲差穴", "NEI:30","600"}),
        "tongren m10"   :  ({"足太阳脉","眉冲穴", "NEI:30:JIALI:20","5500"}),
        "tongren m11"   :  ({"足太阳脉","五处穴", "QI:20","600"}),
        "tongren m12"   :  ({"足太阳脉","肺俞穴", "QI:30","3500"}),
        "tongren m13"   :  ({"足太阳脉","金门穴", "QI:40","600"}),
        "tongren m14"   :  ({"足太阳脉","京骨穴", "QI:50:ATK:10","2200"}),
        "tongren m15"   :  ({"足太阳脉","通天穴", "QI:60","600"}),
        "tongren m16"   :  ({"足太阳脉","承光穴", "NEI:30","600"}),
        "tongren m17"   :  ({"足太阳脉","络却穴", "NEI:30","1200"}),
        "tongren m18"   :  ({"足太阳脉","厥阴俞穴", "NEI:30:JIALI:30","600"}),
        "tongren m19"   :  ({"足太阳脉","束骨穴", "NEI:30","2000"}),
        "tongren m20"   :  ({"足太阳脉","足通骨穴", "NEI:30","600"}),
        "tongren m21"   :  ({"足太阳脉","天柱穴", "NEI:20","600"}),
        "tongren m22"   :  ({"足太阳脉","玉枕穴", "POT:20","12000"}),
        "tongren m23"   :  ({"足太阳脉","大纾穴", "POT:30:AMR:10","600"}),
        "tongren m24"   :  ({"足太阳脉","心俞穴", "POT:20","600"}),
        "tongren m25"   :  ({"足太阳脉","督俞穴", "POT:10:DMG:10","600"}),
        "tongren m26"   :  ({"足太阳脉","脾俞穴", "POT:60","2000"}),
        "tongren m27"   :  ({"足太阳脉","承山穴", "POT:10","600"}),
        "tongren m28"   :  ({"足太阳脉","胃俞穴", "NEI:30","600"}),
        "tongren m29"   :  ({"足太阳脉","上髎穴", "NEI:30:JIALI:20","12000"}),
        "tongren m30"   :  ({"足太阳脉","膈俞穴", "NEI:30","600"}),
        "tongren m31"   :  ({"足太阳脉","三焦俞穴", "NEI:20","600"}),
        "tongren m32"   :  ({"足太阳脉","气海俞穴", "JING:20","2000"}),
        "tongren m33"   :  ({"足太阳脉","肾俞穴", "JING:30","600"}),
        "tongren m34"   :  ({"足太阳脉","次髎穴", "JING:20","600"}),
        "tongren m35"   :  ({"足太阳脉","肝俞穴", "JING:10","12000"}),
        "tongren m36"   :  ({"足太阳脉","关元俞穴", "JING:60","600"}),
        "tongren m37"   :  ({"足太阳脉","大肠俞穴", "NEI:30","600"}),
        "tongren m38"   :  ({"足太阳脉","小肠俞穴", "NEI:30","600"}),
        "tongren m39"   :  ({"足太阳脉","中髎穴", "NEI:30:JIALI:20","2000"}),
        "tongren m40"   :  ({"足太阳脉","膀胱俞穴", "POT:30","600"}),
        "tongren m41"   :  ({"足太阳脉","白环俞穴", "POT:30","600"}),
        "tongren m42"   :  ({"足太阳脉","下髎穴", "POT:30","12000"}),
        "tongren m43"   :  ({"足太阳脉","会阳穴", "POT:20","600"}),
        "tongren m44"   :  ({"足太阳脉","委阳穴", "JING:30:DMG:10","600"}),
        "tongren m45"   :  ({"足太阳脉","合阳穴", "JING:40:ATK:20","2000"}),
        "tongren m46"   :  ({"足太阳脉","委中穴", "JING:10","600"}),
        "tongren m47"   :  ({"足太阳脉","附分穴", "JING:30","600"}),
        "tongren m48"   :  ({"足太阳脉","承扶穴", "NEI:30","12000"}),
        "tongren m49"   :  ({"足太阳脉","膏肓穴", "NEI:30:_STR:2","600"}),
        "tongren m50"   :  ({"足太阳脉","魄户穴", "NEI:30","600"}),
        "tongren m51"   :  ({"足太阳脉","肓门穴", "NEI:30","600"}),
        "tongren m52"   :  ({"足太阳脉","神堂穴", "NEI:30","2000"}),
        "tongren m53"   :  ({"足太阳脉","殷门穴", "JING:20:JIALI:40","600"}),
        "tongren m54"   :  ({"足太阳脉","膈关穴", "JING:30","600"}),
        "tongren m55"   :  ({"足太阳脉","志室穴", "JING:20","12000"}),
        "tongren m56"   :  ({"足太阳脉","魂门穴", "JING:50","600"}),
        "tongren m57"   :  ({"足太阳脉","意舍穴", "JING:60:_INT:2","600"}),
        "tongren m58"   :  ({"足太阳脉","阳刚穴", "NEI:30:JING:50","2000"}),

        // 手少阴脉
        "tongren n1"    :  ({"手少阴脉","阴郗穴", "JING:20:_DEX:3","1000"}),
        "tongren n2"    :  ({"手少阴脉","通里穴", "JING:30","1200"}),
        "tongren n3"    :  ({"手少阴脉","少府穴", "JING:40","1200"}),
        "tongren n4"    :  ({"手少阴脉","少冲穴", "JING:50:NEI:30","1200"}),
        "tongren n5"    :  ({"手少阴脉","灵道穴", "JING:60","6000"}),
        "tongren n6"    :  ({"手少阴脉","神门穴", "NEI:30","4000"}),
        "tongren n7"    :  ({"手少阴脉","青灵穴", "NEI:30:_INT:2","1000"}),
        "tongren n8"    :  ({"手少阴脉","少海穴", "NEI:30","1200"}),
        "tongren n9"    :  ({"手少阴脉","极泉穴", "NEI:30:_STR:2","1000"}),


        // 手少阳脉
        "tongren o1"    :  ({"手少阳脉","翳风穴", "NEI:20:JING:20","1000"}),
        "tongren o2"    :  ({"手少阳脉","丝竹空穴", "NEI:30:ATK:10","1000"}),
        "tongren o3"    :  ({"手少阳脉","耳门穴", "NEI:40","1000"}),
        "tongren o4"    :  ({"手少阳脉","耳门髎穴", "JING:20:AMR:10","1000"}),
        "tongren o5"    :  ({"手少阳脉","天髎穴", "JING:30","1000"}),
        "tongren o6"    :  ({"手少阳脉","支沟穴", "JING:40:JIALI:20","1000"}),
        "tongren o7"    :  ({"手少阳脉","关冲穴", "JING:50:JIALI:30","1000"}),
        "tongren o8"    :  ({"手少阳脉","液门穴", "JING:60","2000"}),
        "tongren o9"    :  ({"手少阳脉","天井穴", "NEI:30","3000"}),
        "tongren o10"   :  ({"手少阳脉","青冷渊穴", "NEI:30:MAR:50","4000"}),
        "tongren o11"   :  ({"手少阳脉","颅息穴", "NEI:30","1000"}),
        "tongren o12"   :  ({"手少阳脉","角孙穴", "NEI:30:DMG:10","1000"}),
        "tongren o13"   :  ({"手少阳脉","肩髎穴", "QI:20","1000"}),
        "tongren o14"   :  ({"手少阳脉","外关穴", "QI:30","1000"}),
        "tongren o15"   :  ({"手少阳脉","四渎穴", "QI:40","1000"}),
        "tongren o16"   :  ({"手少阳脉","消泺穴", "QI:50:_STR:1","1000"}),
        "tongren o17"   :  ({"手少阳脉","儒会穴", "QI:60","1000"}),
        "tongren o18"   :  ({"手少阳脉","阳池穴", "QI:30","4000"}),
        "tongren o19"   :  ({"手少阳脉","中泽穴", "QI:30:DMG:10","10000"}),
        "tongren o20"   :  ({"手少阳脉","会宗穴", "NEI:30","1000"}),
        "tongren o21"   :  ({"手少阳脉","三阳络穴", "NEI:30:JING:20","4000"}),


        // 足少阴脉
        "tongren p1"    :  ({"足少阴脉","大钟穴", "POT:50:WEAPON:10","4000"}),
        "tongren p2"    :  ({"足少阴脉","太溪穴", "POT:30","4000"}),
        "tongren p3"    :  ({"足少阴脉","然谷穴", "POT:40","4000"}),
        "tongren p4"    :  ({"足少阴脉","涌泉穴", "POT:20:JIALI:10","4000"}),
        "tongren p5"    :  ({"足少阴脉","交信穴", "POT:30","4000"}),
        "tongren p6"    :  ({"足少阴脉","照海穴", "POT:40","4000"}),
        "tongren p7"    :  ({"足少阴脉","水泉穴", "POT:50:ATK:30","4000"}),
        "tongren p8"    :  ({"足少阴脉","横骨穴", "POT:60","4000"}),
        "tongren p9"    :  ({"足少阴脉","商曲穴", "NEI:30:JIALI:20","4000"}),
        "tongren p10"   :  ({"足少阴脉","石关穴", "NEI:30","4000"}),
        "tongren p11"   :  ({"足少阴脉","阴都穴", "NEI:30","4000"}),
        "tongren p12"   :  ({"足少阴脉","腹通谷穴", "NEI:30:MINGSI:1","4000"}),
        "tongren p13"   :  ({"足少阴脉","幽门穴", "JING:20","4000"}),
        "tongren p14"   :  ({"足少阴脉","肓俞穴", "JING:30","4000"}),
        "tongren p15"   :  ({"足少阴脉","中注穴", "JING:40:DMG:20","12000"}),
        "tongren p16"   :  ({"足少阴脉","气穴", "JING:20","4000"}),
        "tongren p17"   :  ({"足少阴脉","复溜穴", "JING:30","4000"}),
        "tongren p18"   :  ({"足少阴脉","大赫穴", "QI:10:JIALI:20","4000"}),
        "tongren p19"   :  ({"足少阴脉","阴谷穴", "QI:10","4000"}),
        "tongren p20"   :  ({"足少阴脉","筑宾穴", "QI:10:JIALI:20","4000"}),
        "tongren p21"   :  ({"足少阴脉","四满穴", "QI:10","4000"}),
        "tongren p22"   :  ({"足少阴脉","神封穴", "QI:10","4000"}),
        "tongren p23"   :  ({"足少阴脉","灵墟穴", "QI:10:WEAPON:10","4000"}),
        "tongren p24"   :  ({"足少阴脉","俞府穴", "NEI:30","4000"}),
        "tongren p25"   :  ({"足少阴脉","神藏穴", "NEI:30:JIALI:30","4000"}),

        // 足少阳脉
        "tongren q1"    :  ({"足少阳脉","风池穴", "NEI:320:KANGDU:1","6000"}),
        "tongren q2"    :  ({"足少阳脉","脑空穴", "NEI:130:FOOD:100","9000"}),
        "tongren q3"    :  ({"足少阳脉","头窍阴穴", "NEI:340:_CON:1","6000"}),
        "tongren q4"    :  ({"足少阳脉","肩井穴", "NEI:120","6000"}),
        "tongren q5"    :  ({"足少阳脉","阳陵泉穴", "NEI:130:KANGDU:1","6000"}),
        "tongren q6"    :  ({"足少阳脉","浮白穴", "NEI:130:FOOD:100","12000"}),
        "tongren q7"    :  ({"足少阳脉","天冲穴", "NEI:150:WATER:100","9000"}),
        "tongren q8"    :  ({"足少阳脉","完骨穴", "NEI:160","6000"}),
        "tongren q9"    :  ({"足少阳脉","正营穴", "NEI:130:_STR:1","9000"}),
        "tongren q10"   :  ({"足少阳脉","目窗穴", "NEI:130","6000"}),
        "tongren q11"   :  ({"足少阳脉","头临泣穴", "NEI:130","25000"}),
        "tongren q12"   :  ({"足少阳脉","阳白穴", "NEI:130:_STR:1","6000"}),
        "tongren q13"   :  ({"足少阳脉","本神穴", "NEI:120","6000"}),
        "tongren q14"   :  ({"足少阳脉","环跳穴", "NEI:130:_CON:1","6000"}),
        "tongren q15"   :  ({"足少阳脉","京门穴", "NEI:140","9000"}),
        "tongren q16"   :  ({"足少阳脉","居髎穴", "NEI:120:_STR:1","6000"}),
        "tongren q17"   :  ({"足少阳脉","渊腋穴", "NEI:130","6000"}),
        "tongren q18"   :  ({"足少阳脉","上关穴", "NEI:140","9000"}),
        "tongren q19"   :  ({"足少阳脉","悬颅穴", "NEI:120:WATER:100","6000"}),
        "tongren q20"   :  ({"足少阳脉","听会穴", "NEI:130","6000"}),
        "tongren q21"   :  ({"足少阳脉","五枢穴", "NEI:140","9000"}),
        "tongren q22"   :  ({"足少阳脉","足窍阴穴", "NEI:150:KANGDU:1","18000"}),
        "tongren q23"   :  ({"足少阳脉","曲鬓穴", "NEI:160","6000"}),
        "tongren q24"   :  ({"足少阳脉","悬厘穴", "NEI:130:FOOD:100","18000"}),
        "tongren q25"   :  ({"足少阳脉","瞳子髎穴", "NEI:130","6000"}),
        "tongren q26"   :  ({"足少阳脉","带脉穴", "NEI:120:KANGDU:1","6000"}),
        "tongren q27"   :  ({"足少阳脉","率谷穴", "NEI:130","9000"}),
        "tongren q28"   :  ({"足少阳脉","风市穴", "NEI:140","6000"}),
        "tongren q29"   :  ({"足少阳脉","阳交穴", "NEI:120:_STR:1","6000"}),
        "tongren q30"   :  ({"足少阳脉","外丘穴", "NEI:130","9000"}),
        "tongren q31"   :  ({"足少阳脉","维道穴", "NEI:140:FOOD:100","6000"}),
        "tongren q32"   :  ({"足少阳脉","日月穴", "NEI:120:WATER:100","6000"}),
        "tongren q33"   :  ({"足少阳脉","地五会穴", "NEI:130","9000"}),
        "tongren q34"   :  ({"足少阳脉","侠溪穴", "NEI:210:_CON:1","18000"}),
        "tongren q35"   :  ({"足少阳脉","丘墟穴", "NEI:150","6000"}),
        "tongren q36"   :  ({"足少阳脉","悬钟穴", "NEI:160:_STR:1","18000"}),
        "tongren q37"   :  ({"足少阳脉","光明穴", "NEI:230","6000"}),
        "tongren q38"   :  ({"足少阳脉","阳辅穴", "NEI:330:_CON:1","18000"}),

        // 手阳明脉
        "tongren r1"    :  ({"手阳明脉","肘髎穴", "QI:20:ADDPOT:1000000","8000"}),
        "tongren r2"    :  ({"手阳明脉","手五里穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r3"    :  ({"手阳明脉","曲池穴", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r4"    :  ({"手阳明脉","迎香穴", "QI:20:ADDPOT:1000000","30000"}),
        "tongren r5"    :  ({"手阳明脉","臂儒穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r6"    :  ({"手阳明脉","巨骨穴", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r7"    :  ({"手阳明脉","天鼎穴", "QI:50:ADDPOT:1000000","8000"}),
        "tongren r8"    :  ({"手阳明脉","扶突穴", "QI:60:ADDPOT:1000000","8000"}),
        "tongren r9"    :  ({"手阳明脉","口禾髎穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r10"   :  ({"手阳明脉","合谷穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r11"   :  ({"手阳明脉","二间穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r12"   :  ({"手阳明脉","三间穴", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r13"   :  ({"手阳明脉","商阳穴", "FOOD:20:ADDPOT:1000000","8000"}),
        "tongren r14"   :  ({"手阳明脉","阳溪穴", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r15"   :  ({"手阳明脉","手三里穴", "FOOD:40:ADDPOT:1000000","8000"}),
        "tongren r16"   :  ({"手阳明脉","上廉穴", "WATER:20:ADDPOT:1000000","8000"}),
        "tongren r17"   :  ({"手阳明脉","下廉穴", "WATER:30:ADDPOT:1000000","8000"}),
        "tongren r18"   :  ({"手阳明脉","温溜穴", "WATER:40:ADDPOT:1000000","8000"}),
        "tongren r19"   :  ({"手阳明脉","偏历穴", "WATER:20:ADDPOT:1000000","8000"}),

        // 足阳明脉
        "tongren s1"    :  ({"足阳明脉","承泣穴", "MAR:20:FOOD:100","8000"}),
        "tongren s2"    :  ({"足阳明脉","四白穴", "MAR:30:FOOD:100","8000"}),
        "tongren s3"    :  ({"足阳明脉","巨髎穴", "MAR:40:FOOD:100","8000"}),
        "tongren s4"    :  ({"足阳明脉","地仓穴", "MAR:20:FOOD:100","30000"}),
        "tongren s5"    :  ({"足阳明脉","下关穴", "MAR:30:FOOD:100","8000"}),
        "tongren s6"    :  ({"足阳明脉","头维穴", "MAR:40:FOOD:100","8000"}),
        "tongren s7"    :  ({"足阳明脉","人迎穴", "MAR:50:FOOD:100","8000"}),
        "tongren s8"    :  ({"足阳明脉","水突穴", "MAR:60:FOOD:100","8000"}),
        "tongren s9"    :  ({"足阳明脉","气舍穴", "NEI:30:WATER:100","8000"}),
        "tongren s10"   :  ({"足阳明脉","缺盆穴", "NEI:30:WATER:100","8000"}),
        "tongren s11"   :  ({"足阳明脉","气户穴", "NEI:30:WATER:100","8000"}),
        "tongren s12"   :  ({"足阳明脉","库房穴", "NEI:30:WATER:100","8000"}),
        "tongren s13"   :  ({"足阳明脉","大迎穴", "JING:20:WATER:100","8000"}),
        "tongren s14"   :  ({"足阳明脉","屋翳穴", "JING:30:WATER:100","8000"}),
        "tongren s15"   :  ({"足阳明脉","梁门穴", "POT:40:WATER:100","8000"}),
        "tongren s16"   :  ({"足阳明脉","乳中穴", "POT:20:ATK:10","8000"}),
        "tongren s17"   :  ({"足阳明脉","乳根穴", "POT:30","8000"}),
        "tongren s18"   :  ({"足阳明脉","不容穴", "POT:40:_DEX:2","8000"}),
        "tongren s19"   :  ({"足阳明脉","承满穴", "POT:20:ATK:10","8000"}),
        "tongren s20"   :  ({"足阳明脉","关门穴", "POT:30","8000"}),
        "tongren s21"   :  ({"足阳明脉","太乙穴", "POT:40:DMG:10","8000"}),
        "tongren s22"   :  ({"足阳明脉","滑肉门穴", "POT:50:JIALI:30","8000"}),
        "tongren s23"   :  ({"足阳明脉","天枢穴", "POT:60","30000"}),
        "tongren s24"   :  ({"足阳明脉","外陵穴", "NEI:30:ATK:30","8000"}),
        "tongren s25"   :  ({"足阳明脉","大巨穴", "NEI:30","8000"}),
        "tongren s26"   :  ({"足阳明脉","水道穴", "JING:20:JIALI:50","8000"}),
        "tongren s27"   :  ({"足阳明脉","归来穴", "JING:30","8000"}),
        "tongren s28"   :  ({"足阳明脉","气冲穴", "JING:40:AMR:10","8000"}),
        "tongren s29"   :  ({"足阳明脉","伏兔穴", "JING:20","8000"}),
        "tongren s30"   :  ({"足阳明脉","阴市穴", "JING:30:ATK:10","8000"}),
        "tongren s31"   :  ({"足阳明脉","梁丘穴", "JING:40","8000"}),
        "tongren s32"   :  ({"足阳明脉","犊鼻穴", "QI:20:NEI:10","8000"}),
        "tongren s33"   :  ({"足阳明脉","上巨虚穴", "QI:30:ATK:10","8000"}),
        "tongren s34"   :  ({"足阳明脉","下巨虚穴", "QI:40","8000"}),
        "tongren s35"   :  ({"足阳明脉","丰隆穴", "QI:50","8000"}),
        "tongren s36"   :  ({"足阳明脉","解溪穴", "QI:60:JIALI:10","8000"}),
        "tongren s37"   :  ({"足阳明脉","冲阳穴", "QI:30","8000"}),
        "tongren s38"   :  ({"足阳明脉","陷骨穴", "QI:30:ATK:10","8000"}),
        "tongren s39"    :  ({"足阳明脉","内庭穴", "NEI:30:JIALI:10","8000"}),
        "tongren s40"    :  ({"足阳明脉","历兑穴", "NEI:30:AMR:10","8000"}),

        // 手厥阴脉
        "tongren t1"    :  ({"手厥阴脉","内关穴", "JING:50:NEI:50","8000"}),
        "tongren t2"    :  ({"手厥阴脉","大陵穴", "JING:50:NEI:50","8000"}),
        "tongren t3"    :  ({"手厥阴脉","天泉穴", "JING:50:NEI:50","8000"}),
        "tongren t4"    :  ({"手厥阴脉","间使穴", "JING:50:_DEX:1","30000"}),
        "tongren t5"    :  ({"手厥阴脉","劳宫穴", "JING:50:_DEX:1","8000"}),
        "tongren t6"    :  ({"手厥阴脉","天池穴", "JING:50:_DEX:1","8000"}),
        "tongren t7"    :  ({"手厥阴脉","曲泽穴", "JING:50:_DEX:1","8000"}),
        "tongren t8"    :  ({"手厥阴脉","蹊门穴", "JING:50:MAR:50","8000"}),
        "tongren t9"    :  ({"手厥阴脉","中冲穴", "JING:50:MAR:50","8000"}),

        // 足厥阴脉
        "tongren u1"    :  ({"足厥阴脉","太冲穴", "JING:50:DMG:20","8000"}),
        "tongren u2"    :  ({"足厥阴脉","大敦穴", "JING:30:_CON:3","8000"}),
        "tongren u3"    :  ({"足厥阴脉","行间穴", "JING:40","8000"}),
        "tongren u4"    :  ({"足厥阴脉","中都穴", "JING:20:QI:20","30000"}),
        "tongren u5"    :  ({"足厥阴脉","臂沟穴", "JING:30:ATK:20","8000"}),
        "tongren u6"    :  ({"足厥阴脉","中封穴", "JING:40","8000"}),
        "tongren u7"    :  ({"足厥阴脉","章门穴", "JING:50:_DEX:2","8000"}),
        "tongren u8"    :  ({"足厥阴脉","足五里穴", "JING:60:NEI:50","8000"}),
        "tongren u9"    :  ({"足厥阴脉","膝关穴", "NEI:30:_DEX:1","8000"}),
        "tongren u10"   :  ({"足厥阴脉","曲泉穴", "JING:30:_CON:3","8000"}),
        "tongren u11"   :  ({"足厥阴脉","急脉穴", "JING:40:_STR:2","8000"}),
        "tongren u12"   :  ({"足厥阴脉","阴包穴", "JING:50","8000"}),
        "tongren u13"   :  ({"足厥阴脉","期门穴", "JING:60:QI:20","8000"}),
        "tongren u14"   :  ({"足厥阴脉","阴廉穴", "NEI:40:_STR:2","8000"}),
]);

string effect_desc(string effect)
{
        string *tmp;
        int n, i;
        string msg;

        msg = "";
        tmp = explode(effect, ":");
        n = sizeof(tmp);

        if( !n )return "未定义";

        for( i = 1; i <= n;i += 2 )
        {
                switch(tmp[i-1])
                {
                        case "QI":
                                msg += "提升气血上限：" + tmp[i] + "点、";
                                break;
                        case "NEI":
                                msg += "提升内力上限：" + tmp[i] + "点、";
                                break;
                        case "ATK":
                                msg += "提升命中等级：+" + tmp[i];
                                break;
                        case "DMG":
                                msg += "提升伤害等级：+" + tmp[i];
                                break;
                        case "AMR":
                                msg += "提升防护等级：+" + tmp[i] + "点、";
                                break;
                        case "JIALI":
                                msg += "提升加力上限：" + tmp[i] + "点、";
                                break;
                        case "JING":
                                msg += "提升精力上限：" + tmp[i] + "点、";
                                break;
                        case "MAR":
                                msg += "提升体会上限：" + tmp[i] + "点、";
                                break;
                        case "POT":
                                msg += "提升潜能上限：" + tmp[i] + "点、";
                                break;
                        case "MINGSI":
                                msg += "提升冥思效率：+" + tmp[i] + "%、";
                                break;
                        case "FOOD":
                                msg += "提升食物上限：" + tmp[i] + "点、";
                                break;
                        case "WATER":
                                msg += "提升饮水上限：" + tmp[i] + "点、";
                                break;
                        case "KANGDU":
                                msg += "提升抗毒能力：+" + tmp[i] + "%、";
                                break;
                        case "_STR":
                                msg += "提升后天臂力：+" + tmp[i];
                                break;
                        case "_DEX":
                                msg += "提升后天身法：+" + tmp[i];
                                break;
                        case "_INT":
                                msg += "提升后天悟性：+" + tmp[i];
                                break;
                        case "_CON":
                                msg += "提升后天根骨：+" + tmp[i];
                                break;
                        case "STR":
                                msg += "提升先天臂力：+" + tmp[i];
                                break;
                        case "DEX":
                                msg += "提升先天身法：+" + tmp[i];
                                break;
                        case "INT":
                                msg += "提升先天悟性：+" + tmp[i];
                                break;
                        case "CON":
                                msg += "提升先天根骨：+" + tmp[i];
                                break;
                        case "WEAPON":
                                msg += "提升兵器伤害：+" + tmp[i] + "%、";
                                break;
                        case "ADDPOT":
                                msg += "冲穴后获取潜能：" + tmp[i] + "点、";
                                break;
                        default:
                                return "未定义。";

                }
        }
        return msg;
}

void add_chongxue_effect(object me, string effect)
{
        string *tmp;
        int n, i, p;

        tmp = explode(effect, ":");
        n = sizeof(tmp);

        if( !n )
                return;

        // 每冲开一穴获取10万潜，3万体会
        addn("potential", 100000, me);
        addn("experience", 30000, me);
        write(HIC "冲穴效果：" + effect_desc(effect) + "\n" NOR);
        write(HIY "冲穴奖励：十万点潜能及三万点实战体会。\n" NOR);

        // 增加效果
        for( i = 1; i <= n; i += 2 )
        {
                sscanf(tmp[i], "%d", p);

                switch(tmp[i-1])
                {
                        case "QI":
                                addn("jingmai/max_qi", p, me);
                                break;
                        case "NEI":
                                addn("jingmai/max_neili", p, me);
                                break;
                        case "ATK":
                                addn("jingmai/attack", p, me);
                                break;
                        case "DMG":
                                addn("jingmai/damage", p, me);
                                break;
                        case "AMR":
                                addn("jingmai/armor", p, me);
                                break;
                        case "JIALI":
                                addn("jingmai/jiali", p, me);
                                break;
                        case "JING":
                                addn("jingmai/max_jing", p, me);
                        case "MAR":
                                addn("jingmai/max_experience", p, me);
                                break;
                        case "POT":
                                addn("jingmai/max_potential", p, me);
                                break;
                        case "MINGSI":
                                addn("jingmai/reflect", p, me);
                                break;
                        case "FOOD":
                                addn("jingmai/food", p, me);
                                break;
                        case "WATER":
                                addn("jingmai/water", p, me);
                                break;
                        case "KANGDU":
                                addn("jingmai/avoid_poison", p, me);
                                break;
                        case "_STR":
                                addn("jingmai/str", p, me);
                                break;
                        case "_DEX":
                                addn("jingmai/dex", p, me);
                                break;
                        case "_INT":
                                addn("jingmai/int", p, me);
                                break;
                        case "_CON":
                                addn("jingmai/con", p, me);
                                break;
                        case "STR":
                                addn("str", p, me);
                                addn("jm/str", p, me);
                                break;
                        case "DEX":
                                addn("dex", p, me);
                                addn("jm/dex", p, me);
                                break;
                        case "INT":
                                addn("int", p, me);
                                addn("jm/int", p, me);
                                break;
                        case "CON":
                                addn("con", p, me);
                                addn("jm/con", p, me);
                                break;
                        case "WEAPON":
                                addn("jingmai/unarmed_damage", p, me);
                                break;
                        case "ADDPOT":
                                addn("potential", p, me);
                                break;
                        default:
                                write("default error.\n");
                                return;
                }
        }
}

// 追加通脉效果
void add_jingmai_effect(object me, string jing)
{
        switch( jing )
        {
                case "阴跷脉":
                        addn("jingmai/max_qi", 600, me);
                        addn("jingmai/max_neili", 200, me);
                        addn("jingmai/max_jingli", 200, me);
                        addn("jingmai/max_potential", 400, me);
                        addn("jingmai/damage", 20, me);
                        addn("jingmai/kar", 1, me);

                        MYGIFT_D->check_mygift(me, "newbie_mygift/yinqiaomai");
                        break;

                case "阳跷脉":
                        addn("jingmai/max_qi", 20000, me);
                        addn("jingmai/max_neili", 800, me);
                        addn("jingmai/max_jingli", 600, me);
                        addn("jingmai/max_potential", 1000, me);
                        addn("jingmai/max_experience", 200, me);
                        addn("jingmai/armor", 50, me);
                        addn("jingmai/damage", 40, me);
                        addn("jingmai/magic_find", 1, me);
                        break;

                case "阴维脉":
                        addn("jingmai/max_qi", 1000, me);
                        addn("jingmai/max_neili", 5000, me);
                        addn("jingmai/max_experience", 1000, me);
                        addn("jingmai/attack", 40, me);
                        addn("jingmai/damage", 20, me);
                        break;

                case "阳维脉":
                        addn("jingmai/max_qi", 500, me);
                        addn("jingmai/max_neili", 500, me);
                        addn("jingmai/max_experience", 4000, me);
                        addn("jingmai/max_potential", 10000, me);
                        addn("jingmai/research_times", 100, me);
                        addn("jingmai/research_effect", 5, me);
                        addn("jingmai/derive_effect", 10, me);
                        addn("jingmai/reflect", 3, me);
                        break;

                case "带脉":
                        addn("jingmai/max_qi", 500, me);
                        addn("jingmai/max_neili", 500, me);
                        addn("jingmai/max_jingli", 500, me);
                        addn("jingmai/jiali", 400, me);
                        addn("jingmai/damage", 100, me);
                        addn("jingmai/armor", 120, me);
                        addn("jingmai/attack", 120, me);
                        addn("jingmai/magic_find", 1, me);
                        addn("jingmai/kar", 1, me);
                        break;

                case "冲脉":
                        addn("jingmai/max_qi", 4000, me);
                        addn("jingmai/max_neili", 200, me);
                        addn("jingmai/max_jingli", 600, me);
                        addn("jingmai/damage", 20, me);
                        addn("jingmai/armor", 200, me);
                        break;

                case "督外脉":
                        addn("jingmai/max_qi", 300, me);
                        addn("jingmai/max_neili", 200, me);
                        addn("jingmai/damage", 300, me);
                        addn("jingmai/attack", 300, me);
                        addn("jingmai/jiali", 1000, me);
                        break;

                case "任外脉":
                        addn("jingmai/max_qi", 200, me);
                        addn("jingmai/max_neili", 100, me);
                        addn("jingmai/max_jingli", 100, me);
                        addn("jingmai/max_experience", 600, me);
                        addn("jingmai/max_potential", 200, me);
                        addn("jingmai/str", 60, me);
                        addn("jingmai/dex", 60, me);
                        addn("jingmai/con", 60, me);
                        addn("jingmai/int", 60, me);
                        addn("jingmai/max_encumbrance", 100000, me);
                        break;

                case "经外奇脉":
                        addn("jingmai/max_qi", 20000, me);
                        addn("jingmai/max_neili", 10000, me);
                        addn("jingmai/max_jingli", 5000, me);
                        addn("jingmai/max_experience", 5000, me);
                        addn("jingmai/damage", 100, me);
                        addn("jingmai/armor", 100, me);
                        addn("jingmai/attack", 100, me);
                        addn("jingmai/magic_find", 2, me);
                        addn("jingmai/kar", 2, me);
                        //me->add("str", 1);
                        //me->add("dex", 1);
                        //me->add("con", 1);
                        addn("int", 1, me);
                        break;

                case "手太阴脉":
                        addn("jingmai/max_qi", 800, me);
                        addn("jingmai/max_neili", 400, me);
                        addn("jingmai/max_jingli", 400, me);
                        addn("jingmai/max_potential", 10000, me);
                        addn("jingmai/damage", 30, me);
                        addn("jingmai/attack", 40, me);
                        addn("jingmai/armor", 40, me);
                        break;

                case "手太阳脉":
                        addn("jingmai/max_qi", 2000, me);
                        addn("jingmai/max_neili", 1000, me);
                        addn("jingmai/max_jingli", 1000, me);
                        addn("jingmai/max_potential", 10000, me);
                        addn("jingmai/magic_find", 2, me);
                        addn("jingmai/damage", 50, me);
                        addn("jingmai/str", 10, me);
                        addn("jingmai/dex", 12, me);

                        break;

                case "足太阴脉":
                        addn("jingmai/max_qi", 2000, me);
                        addn("jingmai/max_jingli", 1000, me);
                        addn("jingmai/max_neili", 2000, me);
                        addn("jingmai/max_potential", 30000, me);
                        addn("jingmai/damage", 50, me);
                        addn("jingmai/kar", 2, me);
                        addn("jingmai/str", 10, me);
                        addn("jingmai/con", 12, me);

                        break;

                case "足太阳脉":
                        addn("jingmai/max_qi", 20000, me);
                        addn("jingmai/max_jingli", 10000, me);
                        addn("jingmai/max_neili", 10000, me);
                        addn("jingmai/max_potential", 100000, me);
                        addn("jingmai/max_experience", 50000, me);
                        addn("jingmai/kar", 4, me);
                        addn("jingmai/magic_find", 4, me);
                        addn("jingmai/damage", 400, me);
                        addn("jingmai/attack", 200, me);
                        //me->add("int", 3);
                        //me->add("dex", 1);
                        addn("str", 1, me);
                        //me->add("con", 1);

                        break;

                case "手少阴脉":
                        addn("jingmai/max_qi", 1000, me);
                        addn("jingmai/max_neili", 400, me);
                        addn("jingmai/max_jingli", 400, me);
                        addn("jingmai/max_potential", 2000, me);
                        addn("jingmai/armor", 100, me);
                        addn("jingmai/str", 6, me);
                        addn("jingmai/int", 6, me);
                        addn("jingmai/dex", 6, me);
                        addn("jingmai/con", 6, me);

                        break;

                case "手少阳脉":
                        addn("jingmai/max_qi", 2000, me);
                        addn("jingmai/max_neili", 5000, me);
                        addn("jingmai/max_jingli", 5000, me);
                        addn("jingmai/max_potential", 5000, me);
                        addn("jingmai/max_experience", 3000, me);
                        addn("jingmai/research_effect", 8, me);
                        break;

                case "足少阴脉":
                        addn("jingmai/max_qi", 3000, me);
                        addn("jingmai/max_neili", 3000, me);
                        addn("jingmai/max_jingli", 2000, me);
                        addn("jingmai/max_potential", 1000, me);
                        addn("jingmai/max_experience", 10000, me);
                        addn("jingmai/derive_effect", 15, me);
                        addn("jingmai/reflect", 5, me);
                        addn("jingmai/max_encumbrance", 200000, me);

                        break;

                case "足少阳脉":
                        addn("jingmai/max_qi", 10000, me);
                        addn("jingmai/max_neili", 5000, me);
                        addn("jingmai/max_jingli", 4000, me);
                        addn("jingmai/max_experience", 5000, me);
                        addn("jingmai/max_potential", 4000, me);
                        addn("jingmai/jiali", 500, me);
                        addn("jingmai/damage", 200, me);
                        addn("jingmai/attack", 150, me);
                        addn("jingmai/defense", 150, me);

                        break;

                case "手阳明脉":
                        addn("jingmai/max_qi", 2000, me);
                        addn("jingmai/max_neili", 2000, me);
                        addn("jingmai/max_jingli", 2000, me);
                        addn("jingmai/max_experience", 2000, me);
                        addn("jingmai/max_potential", 5000, me);
                        addn("jingmai/jiali", 200, me);
                        addn("jingmai/damage", 40, me);
                        addn("jingmai/attack", 40, me);
                        addn("jingmai/magic_find", 1, me);
                        addn("jingmai/kar", 1, me);

                        break;

                case "足阳明脉":
                        addn("jingmai/max_qi", 10000, me);
                        addn("jingmai/max_neili", 10000, me);
                        addn("jingmai/max_jingli", 10000, me);
                        addn("jingmai/max_experience", 20000, me);
                        addn("jingmai/max_potential", 20000, me);
                        addn("jingmai/jiali", 500, me);
                        addn("jingmai/damage", 200, me);
                        addn("jingmai/attack", 200, me);
                        addn("jingmai/str", 60, me);
                        addn("jingmai/dex", 60, me);
                        addn("jingmai/int", 60, me);
                        addn("jingmai/con", 60, me);

                        break;

                case "手厥阴脉":
                        addn("jingmai/max_qi", 1000, me);
                        addn("jingmai/max_neili", 1000, me);
                        addn("jingmai/max_jingli", 1000, me);
                        addn("jingmai/max_potential", 1000, me);
                        addn("jingmai/armor", 50, me);
                        addn("jingmai/attack", 100, me);
                        addn("jingmai/str", 20, me);
                        break;

                case "足厥阴脉":
                        addn("jingmai/max_qi", 10000, me);
                        addn("jingmai/max_neili", 2000, me);
                        addn("jingmai/max_jingli", 2000, me);
                        addn("jingmai/max_experience", 2000, me);
                        addn("jingmai/max_potential", 2000, me);
                        addn("jingmai/damage", 60, me);
                        addn("jingmai/attack", 60, me);
                        addn("jingmai/str", 20, me);
                        addn("jingmai/max_encumbrance", 100000, me);
                        break;

                default:
                        write("经脉错误：" + jing + "\n");
                        break;
        }

        write(HIR "恭喜你，打通了" + HIY + jing + HIR "。\n" NOR);

        // 系统通告
        CHANNEL_D->do_channel(this_object(), "rumor", "恭喜" + HIY + me->name() + HIM "打通了" + HIR +
                                                      jing + HIM "。\n");
        return;
}

// 检查大小周天是否被打通
int check_zhoutian(object me, string jing)
{
        int i, flag = 0;

        if( !query("x_zhoutian", me) )
        {
                for( i=0; i<sizeof(x_zhoutian); i++ )
                        if( !query("jingmai/"+x_zhoutian[i]+"/chongxue_ok", me) )
                        {
                                flag = 1;
                                break;
                        }

                if( !flag )
                {
                        set("x_zhoutian", 1, me);
                        write(HIR "恭喜你，打通了" + HIY + "小周天经脉" + HIR "。\n" NOR);
                        addn("potential", 1000000, me);
                        addn("experience", 300000, me);
                        addn("jingmai/research_effect", 30, me);
                        addn("jingmai/derive_effect", 30, me);
                        addn("jingmai/practice_effect", 30, me);
                        write(HIY "打通小周天奖励：一百万点潜能及三十万点实战体会。\n" NOR);

                        // 系统通告
                        CHANNEL_D->do_channel(this_object(), "rumor", "恭喜" + HIY + me->name() + HIM "打通了" + HIR +
                                              "小周天经脉" + HIM "，功力突飞猛进。\n");
                }
        }

        flag = 0;
        if( !query("d_zhoutian", me) )
        {
                for( i=0; i<sizeof(d_zhoutian); i++ )
                        if( !query("jingmai/"+d_zhoutian[i]+"/chongxue_ok", me) )
                        {
                                flag = 1;
                                break;
                        }

                if( !flag )
                {
                        set("d_zhoutian", 1, me);
                        write(HIR "恭喜你，打通了" + HIY + "大周天经脉" + HIR "。\n" NOR);

                        addn("potential", 2000000, me);
                        addn("experience", 600000, me);
                        addn("jingmai/research_effect", 50, me);
                        addn("jingmai/derive_effect", 50, me);
                        addn("jingmai/practice_effect", 50, me);
                        write(HIY "打通大周天奖励：二百万点潜能及六十万点实战体会。\n" NOR);

                        // 系统通告
                        CHANNEL_D->do_channel(this_object(), "rumor", "恭喜" + HIY + me->name() + HIM "打通了" + HIR +
                                              "大周天经脉" + HIM "，功力进入全新的境界。\n");
                }
        }

        if( query("breakup", me))return 1;

        if( query("x_zhoutian", me) && query("d_zhoutian", me) )
        {
                set("breakup", 1, me);
                delete("jingmai", me);
                set("jingmai/finish", 1, me);
                write(HIR "恭喜你，打通了" + HIY + "全身大小周天经脉" + HIR "。\n" NOR);

                addn("potential", 10000000, me);
                addn("experience", 3000000, me);
                /*
                addn("jingmai/research_effect", 100, me);
                addn("jingmai/derive_effect", 100, me);
                addn("jingmai/practice_effect", 100, me);
                addn("jingmai/reduce_damage", 10, me);
                */
                write(HIY "打通大小周天奖励：一千万点潜能及三百万点实战体会。\n" NOR);

                // 系统通告
                CHANNEL_D->do_channel(this_object(), "rumor", "恭喜" + HIY + me->name() + HIM "打通了" + HIR +
                                      "全身大小周天经脉" + HIM "，功力已如神人。\n");
                return 1;
        }

        return 0;
}

// 检查指定经脉是否被打通
int check_jingmai(object me, string jing)
{
        int n;

        if( !query("jingmai/"+jing, me) )
                return 0;

        n=sizeof(keys(query("jingmai/"+jing, me)));

        switch( jing )
        {
                case "阴跷脉":
                        if( n < 18 ) return 0;
                        break;

                case "阳跷脉":
                        if( n < 23 ) return 0;
                        break;

                case "阴维脉":
                        if( n < 16 ) return 0;
                        break;

                case "阳维脉":
                        if( n < 24 ) return 0;
                        break;

                case "带脉":
                        if( n < 19 ) return 0;
                        break;

                case "冲脉":
                        if( n < 24 ) return 0;
                        break;

                case "督外脉":
                        if( n < 24 ) return 0;
                        break;

                case "任外脉":
                        if( n < 24 ) return 0;
                        break;

                case "经外奇脉":
                        if( n < 23 ) return 0;
                        break;

                case "手太阴脉":
                        if( n < 10 ) return 0;
                        break;

                case "手太阳脉":
                        if( n < 20 ) return 0;
                        break;

                case "足太阴脉":
                        if( n < 21 ) return 0;
                        break;

                case "足太阳脉":
                        if( n < 58 ) return 0;
                        break;

                case "手少阴脉":
                        if( n < 9 )  return 0;
                        break;

                case "手少阳脉":
                        if( n < 21 ) return 0;
                        break;

                case "足少阴脉":
                        if( n < 25 ) return 0;
                        break;

                case "足少阳脉":
                        if( n < 38 ) return 0;
                        break;

                case "手阳明脉":
                        if( n < 19 ) return 0;
                        break;

                case "足阳明脉":
                        if( n < 40 ) return 0;
                        break;

                case "手厥阴脉":
                        if( n < 9 )  return 0;
                        break;

                case "足厥阴脉":
                        if( n < 14 ) return 0;
                        break;

                default:
                        write("经脉名字错误：" + jing + "\n");
                        return 0;
        }

        set("jingmai/"+jing+"/chongxue_ok", 1, me);
        add_jingmai_effect(me, jing);
        check_zhoutian(me, jing);
        return 1;
}

int do_chongxue(object me, object tongren_ob)
{
        string jing, xue;
        string effect;
        string tongren_id;

        jing=query("jingmai_name", tongren_ob);
        xue=query("xuewei_name", tongren_ob);
        tongren_id=query("id", tongren_ob);

        if( query("jingmai/"+jing+"/"+tongren_id, me) )
                return notify_fail(xue + "已经被打通了。\n");

        if( query("neili", me)<query("cost_neili", tongren_ob) )
                return notify_fail("你当前内力值不足，不足以冲穴。\n");

        message_vision( HIC "突然$N" HIC "大喝一声，一股无形气浪"
                        HIC "陡然散布开来，四周空气登时变得燥热。\n" NOR, me);
        tell_object(me, HIG "你顿时觉得浑身一阵轻松，一股清凉之意油然"
                        HIG "而起，心灵一片空明，内力没有丝毫阻滞，" + xue +"已然畅通，舒泰之极。\n" NOR);

        addn("neili", -1*query("cost_neili", tongren_ob), me);

        // 记录冲穴数据
        set("jingmai/"+jing+"/"+tongren_id, 1, me);

        // 提示
        write(HIG "恭喜你，冲穴成功！\n" NOR);

/*
        CHANNEL_D->do_channel(this_object(), "rumor", "听说" + HIY + me->name() + HIM "冲开了" + HIY +
                                                       jing + "·" + xue + HIM "。\n");
*/

        // 获取冲穴效果参数
        effect=query("chongxue_xiaoguo", tongren_ob);

        // 销毁铜人
        destruct(tongren_ob);

        // 调用冲穴成功函数增加效果
        add_chongxue_effect(me, effect);
        check_jingmai(me, jing);

        me->save();
        return 1;
}

// 返回指定经脉的所有穴位,格式 ([ 穴位名1:穴位ID1..])
mapping query_xuewei(string jing)
{
        mapping result;
        int i;
        string *key, *tmp;

        key = keys(tongren_list);
        result = ([]);

        for( i = 0; i < sizeof(key); i ++ )
        {
                tmp = tongren_list[key[i]];
                if( tmp[0] == jing )
                        result += ([tmp[1]:key[i]]);
        }

        return result;
}

// 查看经脉冲穴情况
void show_jingmai(object me, string jing)
{
        string xuewei_id, xuewei_name;
        string msg;
        string status;
        string *xuewei_names;
        mapping xueweis;
        int i;

        msg  = sprintf("%-20s%-20s%-11s\n", HIC "穴位名称" NOR, HIC "冲穴状态" NOR, HIY "铜人编号" NOR);
        msg += "=----------------------------------------------=\n";

        xueweis = query_xuewei(jing);
        if( sizeof(xueweis) < 1 )
        {
                write("没有这个经脉，请核实后再查询。\n");
                return;
        }

        xuewei_names = keys(xueweis);
        for( i = 0; i < sizeof(xuewei_names); i ++ )
        {
                xuewei_name = xuewei_names[i];
                xuewei_id = xueweis[xuewei_name];
                if( query("jingmai/"+jing+"/"+xuewei_id, me) )
                        status = HIG "已打通" NOR;
                else
                        status = WHT "未打通" NOR;

                if( query("jingmai/finish", me) ) status = HIG "已打通" NOR;
                xuewei_id = replace_string(xuewei_id, "tongren ", "");
                msg += sprintf("%-20s%-20s%-11s\n", xuewei_name, status, xuewei_id);
        }
        msg += "=----------------------------------------------=\n";

        write(msg);
        return;
}

// 返回铜人编号列表
varargs string show_bianhao(string arg)
{
        string str;
        int i;
        string *key;
        string *list, *temp;

        if( !arg ) return "";

        switch( arg )
        {
                case "all" :
                        list = keys(tongren_list);
                        break;
                case "bh" :
                        list = keys(tongren_list1);
                        break;
                case "bh2" :
                        list = keys(tongren_list2);
                        break;
                default :
                        key = keys(tongren_list);
                        list = filter_array(key, (: $(tongren_list)[$1][0] == $(arg) :));
                        break;
        }

        list = sort_array(list, 1);

        str  = HIR "<冲穴铜人编号>\n" NOR;
        str += sprintf(HIY "%-20s%-20s%-20s\n" NOR, "铜人编号", "所属经脉", "穴位名称");
        str += HIC "----------------------------------------------------\n" NOR;
        for( i = 0; i < sizeof(list); i ++ )
        {
                temp = tongren_list[list[i]];
                str += sprintf(HIW "%-20s%-20s%-20s\n" NOR, replace_string(list[i], "tongren ", ""), temp[0], temp[1]);
        }

        str += HIC "----------------------------------------------------\n" NOR;

        return str;
}

// 生成铜人文件 目录 /clone/tongren/
void create_tongren_file()
{
        string file, filename, tongren_name, tongren_id;
        string *temp;
        string *list;
        int i;

        list = keys(tongren_list);

        for( i = 0; i < sizeof(list); i ++ )
        {
                reset_eval_cost();
                temp = tongren_list[list[i]];
                tongren_id = list[i];
                tongren_name = "冲穴铜人·" + temp[0] + "·" + temp[1];
                filename = replace_string(list[i], "tongren ", "tongren_");

                file = read_file("/clone/tongren/tongren.h");
                file = replace_string(file, "铜人NAME", tongren_name);
                file = replace_string(file, "铜人ID", tongren_id);
                file = replace_string(file, "JINGMAI_NAME", temp[0]);
                file = replace_string(file, "XUEWEI_NAME", temp[1]);
                file = replace_string(file, "CHONGXUE_XIAOGUO", temp[2]);
                file = replace_string(file, "NEILI_COST", temp[3]);

                write_file("/clone/tongren/" + filename + ".c", file, 1);
        }

        write(sprintf("%d", i) + " Files created at /clone/tongren/ .\n");
        return;
}

// 鉴定无名铜人
mixed identify_tongren(object me, object ob)
{
        object tongren;
        string *list;
        string tongren_id;

        if( ob->query_tongren() == 1 )
                list = keys(tongren_list1);
        else
        if( ob->query_tongren() == 2 )
                list = keys(tongren_list2);
        else
        {
                write(ob->name()+"退还，请联系本站巫师查看问题。\n");
                return;
        }

        tongren_id = list[random(sizeof(list))];
        tongren_id = replace_string(tongren_id, "tongren ", "tongren_");
        tongren = new("/clone/tongren/" + tongren_id);

        if( !tongren )
        {
                log_file("tongren", "tongren identify error, id:" + tongren_id + ".\n");
                write("意外错误终止，无名铜人退还，请联系本站巫师查看系统记录。\n");
                return;
        }

        ob->add_amount(-1);

        write("恭喜你，获得鉴定出" + tongren->name() + NOR "。\n");
        return tongren;
}
