string *surname = ({
"赵","钱","孙","李","周","吴","郑","王","宋","卢","公孙","关","林","呼延",
"杨","马","牛","吕","亲","花","柴","朱","鲁","武","张","董","徐","索","戴",
"史","刘","穆","雷","阮","燕","解","黄","单","韩","郝","彭","魏","齐","萧",
"欧阳","邓","凌","安","郭","蒋","薛","高","鲍","孔","金","项","童","孟",
"侯","陈","梁","郑","龚","陶","范","包","樊","石","时","段","左","辛","于",
"余","尉迟","曹","姬","崔","贾","顾","杜","毛","何","费","施","潘","严",
"喻","方","颜","唐","廉","单","霍",
});
string *manname1 = ({
"尽忠","报国","金刚","霸天","天趣","天赐","先务","对口","铁嘴","四海",
"阿四","弃耕","福禄","儿郎","二愣","八郎","九郎","十郎","十一郎","狗儿",
"阿牛","富贵","百万","生菜","铁牛","金彩","万福","万贵","常贵","根福",
"明","贵","虎","豹","庆","顺","云","飞","坚","狮","龙","宝生","得子",
"金贵","万年","大年","胜","横","平","弘","天洪","保生",
});
string *nickname1 =({
"长白","太行","中条","西山","飞凤","白虎","青龙","河洛","黄河","长江",
"华山","武当","恶","大力","柔情","别离良","杀人","伏牛","崆峒","扬州一",
"京城一","伤心","相见","屠龙","霸王","温柔","怜香","惜玉","碎玉","多情",
"燕子","舞柳","随风","八仙","八卦","落英","伏虎","绝杀","不空回","天马行空",
"有来无回","诗意","杀人如麻",
});
string *nickname2 =({
"刀","剑","枪","戟","锤","斧","鞭",
});

string comm_man_name()
{
        return surname[ random ( sizeof ( surname ) ) ] +
        manname1[ random ( sizeof(manname1 ) ) ];
}

string comm_man_nick()
{
        return nickname1[ random( sizeof( nickname1 ) ) ] +
        nickname2[ random (sizeof ( nickname2 ) ) ];
}

