inherit ROOM; 

void create() 
{ 
        set("short", "紫禁地宫"); 
        set("long", @LONG 
自己站在长长的白玉石阶之底，石阶直通向上方那六丈来高、十里
来宽的巨大平台。仰头望去，广阔的黑色顶穹缀满了千万颗宝石、明珠，
光彩夺目，璀璨似星河，浩瀚如夜空，将四周照得一片皎皎明亮。在那
瑰丽的顶穹下方，赫然竟是一座拔地而起、连天入穹的雄伟宫城。那巍
峨壮丽的城楼殿宇，钩心斗角的流檐飞瓦，绵延雄矗于白玉石台上，如
泰山压顶，竟比长安城楼还要气势磅礴、雄奇瑰丽！石阶两边的广场上，
密密麻麻竟全是列成方阵的兵俑。铜人、陶俑、石雕……交相陈杂，少
说也有几万之众，军姿雄壮，威风凛凛。广场上，一条条银带蜿蜒交错，
闪耀着炫目的光泽，就像是江河汇集，一齐朝东面一个白光闪闪的水池
流去。
LONG
); 
                        
        set("outdoors", "prison"); 
        set("virtual_room", 1);
        set("no_death", 1);
        set("no_magic", 1);

        set("objects",([
                "/maze/prison/npc/jinyiwei" : 8,
                "/maze/prison/npc/li" : 1,
        ])); 
        setup();
} 

