// hangzhou

inherit WAREHOUSE;

void create()
{
        set("short", "杭州城商栈");
        set("long", @LONG
这里就是著名的杭州商栈，杭州买卖商品的集散地，也是富商大
贾云集之所，由杭州商会控制。在杭州大宗商品的买卖都要通过这里
进行。门口挂着一块木牌(sign)。
LONG );

        set("item_desc",([
        "sign" : "
list                    查看当地各种商品的价格。
shou <数量> 商品        收购一定数量的商品。
pao <数量> 商品         在本地抛售一定数量的商品。
fasong                  将你在本地的货物发往其它的地点。
\n",
]));

        set("exits",([
        "south" : __DIR__"majiu",
]));

        // 初始货物数量
        set("all_wares",([
        "rice" : 300000,     //1   本地
        "wheat" : 120000,    //2
        "corn" : 140000,     //3
        "ganzhe" : 200000,   //4
        "goober" : 200000,   //5
        "silk" : 200000,     //6   本地
        "cloth" : 200000,    //7
        "zxiu" : 140000,     //8
        "iron" : 0,         //9   需要
        "tong" : 250000,     //10
        "diamand" : 80000,  //11
        "suis" : 130000,     //12
        "gold" : 120000,      //13
        "silver" : 0,       //14  需要
        "picture" : 40000,   //15  
        "jxiu" : 20000,      //16
        "book" : 14000,      //17
        "vase" : 13000,      //18
        "harm" : 150000,     //19
        "guiy" : 70000,     //20
        "meat" : 90000,     //21
        "fish" : 120000,     //22
        "orange" : 80000,   //23
        "tea" : 180000,      //24  本地
        "yye" : 130000,      //25
        "shen" : 11000,      //26
        "deer" : 12000,      //27
        "sdan" : 15000,      //28
        "bamboo" : 140000,   //29
        "pei" : 28000,       //30
        "hairpin" : 20000,   //31
        "qilin" : 13000,     //32  
        "guan" : 12000,      //33  
        "ddai" : 20000,      //34
        "mxia" : 20000,      //35
        "jade" : 30000,      //36
        "pearl" : 11000,     //37
        "bonsai" : 15000,    //38
        "spear" : 140000,    //39
        "sword" : 150000,    //40
        "blade" : 150000,    //41
        "shield" : 140000,   //42
        "jian" : 200000,     //43
        "armor" : 150000,    //44
        "wood" : 200000,     //45
        "stone" : 150000,    //46
        "cansi" : 290000,    //47  
        "cotton" : 220000,   //48
        "salt" : 220000,     //49 
        "paper" : 200000,    //50
]));

        // 各类商品的价格指数
        set("kind_rate",([
        "rice" : 96,     // 1  本地
        "silk" : 79,     // 6  本地
       "iron" : 124,  // 9  需要
       "silver" : 110,      //14  需要
       "tea" : 75,     //24  本地
]));
 
	set("coor/x", 850);
	set("coor/y", -2060);
	set("coor/z", 0);
	setup();
}